
&НаКлиенте
Процедура ОбновитьВсеКоллекции(Команда)
	
	ОбновитьВсеКоллекцииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьВсеКоллекцииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КоллекцииДляСайтаСостав.Ссылка КАК Коллекция,
		|	КоллекцииДляСайтаСостав.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.КоллекцииДляСайта.Состав КАК КоллекцииДляСайтаСостав
		|ГДЕ
		|	КоллекцииДляСайтаСостав.Ссылка.Активность = ИСТИНА
		|	И КоллекцииДляСайтаСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
		|ИТОГИ ПО
		|	Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		ПредставлениеКоллекции = "";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПредставлениеКоллекции = ПредставлениеКоллекции + СокрЛП(ВыборкаДетальныеЗаписи.Коллекция) + "; ";			
		КонецЦикла;
		ПредставлениеКоллекции = СокрЛП(ПредставлениеКоллекции);
		Если Прав(ПредставлениеКоллекции,1) = ";" тогда
			ПредставлениеКоллекции = Лев(ПредставлениеКоллекции,СтрДлина(ПредставлениеКоллекции)-1);
		КонецЕсли;		
		МенеджерЗаписи = РегистрыСведений.КоллекцииНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = ВыборкаСсылка.Номенклатура;
		МенеджерЗаписи.Коллекции = ПредставлениеКоллекции;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры	
