
&НаСервере
Функция ПолучитьПараметрыФормы(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		ПараметрыФормы = Новый Структура("БизнесПроцесс", ПараметрКоманды.БизнесПроцесс);
	//ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.удалитьCRM_Сделка") Тогда
	//	ПараметрыФормы = Новый Структура("БизнесПроцесс", ПараметрКоманды.БизнесПроцесс);
	Иначе
		ПараметрыФормы = Новый Структура("БизнесПроцесс", ПараметрКоманды);
	КонецЕсли;
	
	Возврат  ПараметрыФормы;
	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПолучитьПараметрыФормы(ПараметрКоманды);
	
	Если ПараметрыФормы.БизнесПроцесс = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для личной задачи нельзя отобразить карту маршрута'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.CRM_КартаМаршрутаБизнесПроцесса.Форма", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
