
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	
	НовыйМассив = ЗаполнитьМассивДляПередачиПараметров(ПараметрКоманды);
	
	Если НовыйМассив.Количество() > 0 Тогда
		ОткрытьФорму("Отчет.CRM_КарточкаКлиента.Форма",	Новый Структура("Партнер",НовыйМассив),,НовыйМассив,ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ЗаполнитьМассивДляПередачиПараметров(ПараметрКоманды)
	
	НовыйМассив = Новый Массив;
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
			Для Каждого Элем Из ПараметрКоманды Цикл
				Если ЗначениеЗаполнено(Элем) И НЕ (Элем.ЭтоГруппа) Тогда
					НовыйМассив.Добавить(Элем);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовыйМассив;
		
КонецФункции
	
