
&НаКлиенте
Процедура ЗагружаемДанныеЗаГодПриИзменении(Элемент)
	НачалоПериода = НачалоГода(НачалоПериода);
КонецПроцедуры


&НаСервере
Функция ЗагрузитьДанныеНаСервере()
	
	Если пропуститьПервуюСтроку тогда
		Проверка = ТабДок.Область(2,1,2,1);
		НомерСтроки=2;
	Иначе
		Проверка = ТабДок.Область(1,1,1,1);
		НомерСтроки=1;
	КонецЕсли;
	ТаблицаДанных.Очистить();
	Пока Проверка.Текст<>"" цикл
		
		//1 - Филиал
		//2 - Бренд
		//3 - Номенклатурная группа
		//4 - Торговая точка
		//5 - Торговая точка (GUID)
		ФилиалСтрока = СокрЛП(ТабДок.Область(НомерСтроки,1,НомерСтроки,1).Текст);
		БрендСтрока = СокрЛП(ТабДок.Область(НомерСтроки,2,НомерСтроки,2).Текст);
		НоменклатурнаяГруппаСтрока = СокрЛП(ТабДок.Область(НомерСтроки,3,НомерСтроки,3).Текст);
		ТТСтрока = СокрЛП(ТабДок.Область(НомерСтроки,4,НомерСтроки,4).Текст);
		ТТИД = СокрЛП(ТабДок.Область(НомерСтроки,5,НомерСтроки,5).Текст);
		МенеджерСтрока = СокрЛП(ТабДок.Область(НомерСтроки,6,НомерСтроки,6).Текст);
		КоординаторСтрока = СокрЛП(ТабДок.Область(НомерСтроки,7,НомерСтроки,7).Текст);
		
		Если нрег(ФилиалСтрока) = "вог сибирь" или нрег(ФилиалСтрока) = "вог-сибирь" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000009");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог урал" или нрег(ФилиалСтрока) = "вог-урал" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000003");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог самара" или нрег(ФилиалСтрока) = "вог-самара" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000008");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог юг - ростов" или нрег(ФилиалСтрока) = "вог-юг-ростов" или нрег(ФилиалСтрока) = "вог юг ростов" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("CR-000015");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог юг - кмв" или нрег(ФилиалСтрока) = "вог-юг-кмв" или нрег(ФилиалСтрока) = "вог юг кмв" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000004");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог кубань" или нрег(ФилиалСтрока) = "вог-кубань" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000002");		
		ИначеЕсли нрег(ФилиалСтрока) = "декор-к"  тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000013");		
		ИначеЕсли нрег(ФилиалСтрока) = "тк вог" или нрег(ФилиалСтрока) = "тк-вог" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000006");		
		ИначеЕсли нрег(ФилиалСтрока) = "вог керамика" или нрег(ФилиалСтрока) = "вог-керамика" тогда
			Филиал = Справочники.СтруктураПредприятия.НайтиПоКоду("000000001");		
		Иначе
			Филиал = Справочники.СтруктураПредприятия.ПустаяСсылка();
			Сообщить("Ошибка обработки филиала строка "+ НомерСтроки);	
		КонецЕсли;
		
		Если БрендСтрока = "Лассельсбергер" тогда
			БрендСтрока = "LBCeramics";
		КонецЕсли;                                           
		Если БрендСтрока = "Глобал Тайл" тогда
			БрендСтрока = "GlobalTile";
		КонецЕсли;                                           
		Если БрендСтрока<>"" тогда
			Бренд = Справочники.вогБренды.НайтиПоНаименованию(БрендСтрока);
		КонецЕсли;                                           
		
		
		Если Не ЗначениеЗаполнено(Бренд) тогда
			Сообщить("Ошибка обработки бренда строка "+ НомерСтроки);	
		КонецЕсли;
		
		НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НоменклатурнаяГруппаСтрока);
		Менеджер = Справочники.Пользователи.НайтиПоНаименованию(МенеджерСтрока);
		Координатор = Справочники.Пользователи.НайтиПоНаименованию(КоординаторСтрока);
		
		Если ЗначениеЗаполнено(ТТИД) тогда
			ТТ = Справочники.вогТорговыеТочки.ПолучитьСсылку(Новый УникальныйИдентификатор(ТТИД));	
			Юр = Справочники.вогЮридическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(ТТИД));
			Если ЗначениеЗаполнено(ТТ.Партнер) тогда
				Партнер = ТТ.Партнер;
			ИначеЕсли ЗначениеЗаполнено(Юр.Партнер) тогда
				ТТ = Справочники.вогТорговыеТочки.ПустаяСсылка();
				Партнер = Юр.Партнер;
			КонецЕсли;
		ИначеЕсли  ЗначениеЗаполнено(ТТСтрока) тогда
			ТТ = Справочники.вогТорговыеТочки.НайтиПоНаименованию(ТТСтрока,Истина);
			Партнер = Справочники.Партнеры.НайтиПоНаименованию(ТТСтрока,Истина);
			Если ЗначениеЗаполнено(Партнер) тогда
				ТТ = Справочники.вогТорговыеТочки.ПустаяСсылка();
			ИначеЕсли ЗначениеЗаполнено(ТТ) тогда
				Партнер = ТТ.Партнер;
			КонецЕсли;
		Иначе
			ТТ = Справочники.вогТорговыеТочки.ПустаяСсылка();
		КонецЕсли;
	
		Если ЗагружаемДанныеЗаГод тогда
			КоличествоПериодов = 12;	
		Иначе
			КоличествоПериодов = 1;	
		КонецЕсли;
		// +++ VOG Кулаков П.Л. 15.03.2021
		// Ошибка при загрузке
		//Если ЗагружаемКоличество и ЗагружаемСумму тогда
		//	КоличествоПериодов = КоличествоПериодов * 3;
		//КонецЕсли;
		// --- VOG Кулаков П.Л.
		нСтрока = ТаблицаДанных.Добавить();
		нСтрока.Филиал = Филиал;
		нСтрока.Бренд = Бренд;
		нСтрока.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
		нСтрока.ТТ = ТТ;
		нСтрока.Бренд = Бренд;
		нСтрока.НачалоПериода = НачалоПериода;
		нСтрока.ДанныеЗаОдинПериод = НЕ ЗагружаемДанныеЗаГод;
		нСтрока.Партнер = Партнер;
		нСтрока.Менеджер = Менеджер;
		нСтрока.Координатор = Координатор;
		Если ЗначениеЗаполнено(нСтрока.менеджер) и Не ЗначениеЗаполнено(нСтрока.Филиал) тогда
			нСтрока.Филиал = вогОбщегоНазначения.ПолучитьФилиалПользователя(нСтрока.Менеджер);
		КонецЕсли;
		
		Счетчик = 1;
		Для НомерПериода = 1 по КоличествоПериодов  цикл
			Ошибка = Ложь;
			Если ЗагружаемКоличество и ЗагружаемСумму тогда
				Попытка
					ДанныеК = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,7+Счетчик,НомерСтроки,7+Счетчик).Текст),",",".")," ",""));
					ДанныеС = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,8+Счетчик,НомерСтроки,8+Счетчик).Текст),",",".")," ",""));
					ДанныеНДС = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,9+Счетчик,НомерСтроки,9+Счетчик).Текст),",",".")," ",""));
				Исключение
				КонецПопытки;
				нСтрока["Количество"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеК;	
				нСтрока["Сумма"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеС;
				нСтрока["НДС"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеНДС;	
				Счетчик = Счетчик+3;
			ИначеЕсли ЗагружаемКоличество тогда 
				Попытка
					ДанныеК = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,7+НомерПериода,НомерСтроки,7+НомерПериода).Текст),",",".")," ",""));
				Исключение
				КонецПопытки;
				нСтрока["Количество"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеК;	
			ИНачеЕсли ЗагружаемСумму тогда
				Попытка
					ДанныеС = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,7+Счетчик,НомерСтроки,7+Счетчик).Текст),",",".")," ",""));
					ДанныеНДС = Число(СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(НомерСтроки,8+Счетчик,НомерСтроки,8+Счетчик).Текст),",",".")," ",""));
				Исключение
				КонецПопытки;
				нСтрока["Сумма"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеС;	
				нСтрока["НДС"+Формат(НомерПериода,"ЧДЦ=0; ЧГ=0")] = ДанныеНДС;	
				Счетчик = Счетчик+2;
			КонецЕслИ;
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
		Проверка = ТабДок.Область(НомерСтроки,1,НомерСтроки,1);
	КонецЦикла;
	АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаДанных.Выгрузить(),Новый УникальныйИдентификатор);
	Возврат АдресВХранилище;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	АдресХ = ЗагрузитьДанныеНаСервере();
	Закрыть(АдресХ);
	
КонецПроцедуры
