//++ VOG Иванов С.А. 20.11.2019 ID заявки: 000000827 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму("Справочник.вогДелегированиеПрав.Форма.ФормаСписка",, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка); //Павелко, Баг 000001014, 13.12.2019 - заменил форму элемента на форму справочника
КонецПроцедуры
//-- VOG Иванов С.А. 20.11.2019 ID заявки: 000000827