
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПодключения = Константы.CRM_ДанныеПодключенияСистемыКлассификаторов.Получить().Получить();
	Если ДанныеПодключения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеПодключения);	
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	СохранитьСервер();
	ОбновитьПовторноИспользуемыеЗначения();
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура СохранитьСервер()

	ДанныеПодключения = Новый Структура("Адрес, Логин, Пароль");
	ЗаполнитьЗначенияСвойств(ДанныеПодключения, ЭтаФорма);	
	
	Константы.CRM_ДанныеПодключенияСистемыКлассификаторов.Установить(Новый ХранилищеЗначения(ДанныеПодключения, Новый СжатиеДанных(9)));
	
КонецПроцедуры // СохранитьСервер()

#КонецОбласти
