#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Формат(Данные.Дата, "ДФ=dd.MM.yyyy")
		+ ?(Данные.Ссылка.ОжидаемаяВыручка <> 0, ", " + Формат(Данные.Ссылка.ОжидаемаяВыручка, "ЧГ=3,0") +" "+ Константы.ВалютаУправленческогоУчета.Получить().Наименование, "")
		+ ", " + Данные.Ссылка.Тема;
	
КонецПроцедуры

Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Результат = Новый Массив;
	Если ЗначениеЗаполнено(Ссылка.КонтактноеЛицо) Тогда
		Результат.Добавить(Ссылка.КонтактноеЛицо);
	ИначеЕсли ЗначениеЗаполнено(Ссылка.Партнер) Тогда
		Результат.Добавить(Ссылка.Партнер);
	ИначеЕсли ЗначениеЗаполнено(Ссылка.ПотенциальныйКлиент) Тогда
		Результат.Добавить(Ссылка.ПотенциальныйКлиент);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если НЕ Параметры.Свойство("Ключ") Тогда
			СтандартнаяОбработка = Ложь;
			Основание = Неопределено;
			Если Параметры.Свойство("Основание", Основание)  Тогда
				Если ТипЗнч(Основание) = Тип("СправочникСсылка.Партнеры") Тогда
					Параметры.Вставить("Партнер", Основание);
				КонецЕсли;
			ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда	
				Если Параметры.ЗначенияЗаполнения.Свойство("Партнер") Тогда
					Параметры.Вставить("Партнер", Параметры.ЗначенияЗаполнения.Партнер);
				КонецЕсли;
			КонецЕсли;
			ВыбраннаяФорма = "Обработка.CRM_МастерРегистрацииОбращения.Форма.Форма";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
