
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДеревоОтборовВидСравненияПриИзмененииНаСервере(СтруктураСтроки) Экспорт
	
	Обработки.вогПодборИсполнителей.ДеревоОтборовВидСравненияПриИзменении(СтруктураСтроки);
	
КонецПроцедуры

Функция ПолучитьСписокТиповПредметов() Экспорт
	
	Возврат вогБизнесПроцессыИЗадачиПовтИсп.ПолучитьСписокТиповПредметов();
	
КонецФункции

Функция СформироватьМакетЗадачиИсполнителя(Форма, Предмет, Мониторинг) Экспорт
	
	Возврат вогБизнесПроцессыИЗадачиСервер.СформироватьМакетЗадачиИсполнителя(Форма, Предмет, Мониторинг);
	
КонецФункции

Функция ДоступныНовыеПоручения() Экспорт
	
	//Кайдашов 20/11/2020
	СписокКоманд = Новый СписокЗначений;
	СписокКоманд.Добавить(1, "По новой форме");
	Возврат СписокКоманд;
	
	//Если РольДоступна("ПолныеПрава") Тогда
	//	СписокКоманд.Добавить(0, "По старой форме");
	//	СписокКоманд.Добавить(1, "По новой форме");
	//Иначе
	//	
	//	Если РольДоступна("вогДоступКНовымПоручениям") Тогда
	//		СписокКоманд.Добавить(1, "По новой форме");
	//	Иначе
	//		СписокКоманд.Добавить(0, "По старой форме");
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//Возврат СписокКоманд;
	
КонецФункции

Функция ПредметуДоступныВариантыОпроса(Предмет) Экспорт
	Возврат вогБизнесПроцессыИЗадачиСервер.ПредметуДоступныВариантыОпроса(Предмет);
КонецФункции

Функция ПолучитьТипРеспондента(Предмет) Экспорт
	
	Возврат Предмет.Метаданные().ПолноеИмя();
	
КонецФункции

#КонецОбласти