
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка на дубли
	//НайтиДокументСхему(Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НайтиДокументСхему(Отказ)
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//|	МаршрутыПроцессов.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.МаршрутыПроцессов КАК МаршрутыПроцессов
	//|ГДЕ
	//|	МаршрутыПроцессов.Документ ПОДОБНО &Документ
	//|	И НЕ МаршрутыПроцессов.ПометкаУдаления
	//|	И МаршрутыПроцессов.Ссылка <> &Ссылка
	//|	И  МаршрутыПроцессов.Включен");
	//Запрос.УстановитьПараметр("Документ",Документ);
	//Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Такая схема статусов есть. Отключите предыдущую схему статусов'"));
	//	Отказ = Истина;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

