
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Автор = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Предмет = ДанныеЗаполнения.Предмет;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Предмет = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	Режим = вогОбщегоНазначенияКлиентСервер.РаспределениеЗадач_РежимРаботыОднаЗадача();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Режим = вогОбщегоНазначенияКлиентСервер.РаспределениеЗадач_РежимРаботыОднаЗадача() Тогда 
		
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "ИсполнителиИЗадачи.Важность");
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Автор = Пользователи.ТекущийПользователь();

	Для Каждого СтрокаИИЗ Из ИсполнителиИЗадачи Цикл 
		СтрокаИИЗ.Поручение = БизнесПроцессы.CRM_БизнесПроцесс.ПустаяСсылка();
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
