Функция ПолучитьТЗРеквизитов() Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Реквизит");
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("ИмяКолонки");
	ТЗ.Колонки.Добавить("Представление");
	ТЗ.Колонки.Добавить("ПроверятьЗаполнение");
	ТЗ.Колонки.Добавить("ИмяКолонкиПроверятьЗаполнение");
	ТЗ.Колонки.Добавить("НеЗатиратьЗаполненные");
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "Наименование";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "НаименованиеSKU";
	СтрокаТЗ.Представление = "Наименование (Номенклатура)";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "НаименованиеПолное";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "НаименованиеПолноеSKU";
	СтрокаТЗ.Представление = "НаименованиеПолное (Номенклатура)";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "Артикул";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "Артикул";
	СтрокаТЗ.Представление = "Артикул (Номенклатура)";
	
	// ++ VOG Солодов В.В. 21.09.2021 CRM-1224
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "ОписаниеТовара";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "ОписаниеТовара";
	СтрокаТЗ.Представление = "Описание товара (Номенклатура)";
	// До изменения
	//СтрокаТЗ = ТЗ.Добавить();
	//СтрокаТЗ.Реквизит = "Комментарий";
	//СтрокаТЗ.Объект = "Номенклатура";
	//СтрокаТЗ.ИмяКолонки = "Комментарий";
	//СтрокаТЗ.Представление = "Комментарий (Номенклатура)";
	// -- VOG Солодов В.В. 21.09.2021 CRM-1224
	
	//СтрокаТЗ = ТЗ.Добавить();
	//СтрокаТЗ.Реквизит = "НоменклатурнаяПозиция";
	//СтрокаТЗ.Объект = "Номенклатура";
	//СтрокаТЗ.ИмяКолонки = "НоменклатурнаяПозиция";
	//СтрокаТЗ.Представление = "НоменклатурнаяПозиция (Номенклатура)";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "ДатаЗапуска";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "ДатаЗапуска";
	СтрокаТЗ.Представление = "ДатаЗапуска (Номенклатура)";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "ДатаПоследнегоТиража";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "ДатаПоследнегоТиража";
	СтрокаТЗ.Представление = "ДатаПоследнегоТиража (Номенклатура)";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "ДатаСнятия";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "ДатаСнятия";
	СтрокаТЗ.Представление = "ДатаСнятия (Номенклатура)";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "НоменклатурнаяГруппа";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "НоменклатурнаяГруппаСсылка";
	СтрокаТЗ.Представление = "НоменклатурнаяГруппа (Номенклатура)"; //1
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "ЦеновойСегментФабрики";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "ЦеновойСегментФабрикиСсылка";
	СтрокаТЗ.Представление = "ЦеновойСегментФабрики (Номенклатура)";
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение = "ЦеновойСегментФабрики"; //1
	
	// +++ VOG Кулаков П.Л. 15.04.2021 DEV-397
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "ЦеноваяГруппа";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "ЦеноваяГруппаСсылка";
	СтрокаТЗ.Представление = "ЦеноваяГруппа (Номенклатура)";
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	// --- VOG Кулаков П.Л.
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "Изображение";
	СтрокаТЗ.Объект = "Номенклатура";
	СтрокаТЗ.ИмяКолонки = "Изображение";
	СтрокаТЗ.Представление = "Изображение (Номенклатура)";

	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "Коллекция";
	СтрокаТЗ.Объект = "Номенклатура";
	// ++ VOG Солодов В.В. 21.12.2020 CRM-1130
	СтрокаТЗ.ИмяКолонки = "КоллекцияСсылка";
	// До изменения
	//СтрокаТЗ.ИмяКолонки = "Коллекция";
	// -- VOG Солодов В.В. 21.12.2020 CRM-1130
	СтрокаТЗ.Представление = "Коллекция (Номенклатура)";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "РаппортОбои";
	СтрокаТЗ.Объект = "Дизайн";
	СтрокаТЗ.ИмяКолонки = "Раппорт";
	СтрокаТЗ.Представление = "Раппорт (Дизайн)"; //1
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "СдвигОбои";
	СтрокаТЗ.Объект = "Дизайн";
	СтрокаТЗ.ИмяКолонки = "Сдвиг";
	СтрокаТЗ.Представление = "Сдвиг (Дизайн)"; //1
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "НоменклатурнаяГруппа";
	СтрокаТЗ.Объект = "Дизайн";
	СтрокаТЗ.ИмяКолонки = "НоменклатурнаяГруппаСсылка";
	СтрокаТЗ.Представление = "НоменклатурнаяГруппа (Дизайн)"; //1
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "ТипНоменклатуры";
	СтрокаТЗ.Объект = "Дизайн";
	СтрокаТЗ.ИмяКолонки = "ТипНоменклатурыСсылка";
	СтрокаТЗ.Представление = "ТипНоменклатуры (Дизайн)"; //1
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "Бренд";
	СтрокаТЗ.Объект = "Дизайн";
	СтрокаТЗ.ИмяКолонки = "БрендСсылка";
	СтрокаТЗ.Представление = "Бренд (Дизайн)";
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение = "Бренд"; //1
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "СтильРисункаПроизводителя";
	СтрокаТЗ.Объект = "Дизайн";
	СтрокаТЗ.ИмяКолонки = "СтильРисункаПроизводителяСсылка";
	СтрокаТЗ.Представление = "СтильРисункаПроизводителя (Дизайн)";
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение = "СтильРисункаПроизводителя"; //1	
	
	// ++ VOG Солодов В.В. 08.09.2021 CRM-1193
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит 						= "СтильРисункаОбои";
	СтрокаТЗ.Объект 						= "Дизайн";
	СтрокаТЗ.ИмяКолонки 					= "СтильРисункаОбоиСсылка";
	СтрокаТЗ.Представление 					= "СтильРисункаОбои (Дизайн)";
	СтрокаТЗ.ПроверятьЗаполнение 			= Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение 	= "СтильРисунка";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит 						= "СтруктураОбои";
	СтрокаТЗ.Объект 						= "Дизайн";
	СтрокаТЗ.ИмяКолонки 					= "СтруктураОбоиСсылка";
	СтрокаТЗ.Представление 					= "СтруктураОбои (Дизайн)";
	СтрокаТЗ.ПроверятьЗаполнение 			= Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение 	= "ВидСтруктуры";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит 						= "ВидСтруктурыПроизводителя";
	СтрокаТЗ.Объект 						= "Дизайн";
	СтрокаТЗ.ИмяКолонки 					= "СтруктураПроизводителяОбоиСсылка";
	СтрокаТЗ.Представление 					= "СтруктураПроизводителяОбои (Дизайн)";
	СтрокаТЗ.ПроверятьЗаполнение 			= Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение 	= "ВидСтруктуры";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит 						= "ЭлементРисунка";
	СтрокаТЗ.Объект 						= "Дизайн";
	СтрокаТЗ.ИмяКолонки 					= "ЭлементРисункаСсылка";
	СтрокаТЗ.Представление 					= "ЭлементРисунка (Дизайн)";
	СтрокаТЗ.ПроверятьЗаполнение 			= Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение 	= "ЭлементРисунка";
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит 						= "ЭлементРисункаПроизводителя";
	СтрокаТЗ.Объект 						= "Дизайн";
	СтрокаТЗ.ИмяКолонки 					= "ЭлементРисункаПроизводителяСсылка";
	СтрокаТЗ.Представление 					= "ЭлементРисункаПроизводителя (Дизайн)";
	СтрокаТЗ.ПроверятьЗаполнение 			= Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение 	= "ЭлементРисунка";
	// До изменения
	//СтрокаТЗ = ТЗ.Добавить();
	//// +++ VOG Кулаков П.Л. 15.04.2021 DEV-397
	//СтрокаТЗ.Реквизит = "ВидСтруктурыПроизводителя";
	//// --- VOG Кулаков П.Л.
	//СтрокаТЗ.Объект = "Дизайн";
	//СтрокаТЗ.ИмяКолонки = "СтруктураОбоиСсылка";
	//СтрокаТЗ.Представление = "СтруктураОбои (Дизайн)";
	//СтрокаТЗ.ПроверятьЗаполнение = Истина;
	//СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение = "ВидСтруктуры"; //1
	// -- VOG Солодов В.В. 08.09.2021 CRM-1193
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "ТипРисункаОбои";
	СтрокаТЗ.Объект = "Дизайн";
	СтрокаТЗ.ИмяКолонки = "ТипРисункаОбоиСсылка";
	СтрокаТЗ.Представление = "ТипРисункаОбои (Дизайн)";
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение = "ТипРисунка"; //1		
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "РазмерРисункаОбои";
	СтрокаТЗ.Объект = "Дизайн";
	СтрокаТЗ.ИмяКолонки = "РазмерРисункаОбоиСсылка";
	СтрокаТЗ.Представление = "РазмерРисункаОбои (Дизайн)";
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение = "РазмерРисунка"; //1		
	
	// ++ VOG Солодов В.В. 08.09.2021 CRM-1193
	// До изменения
	//СтрокаТЗ = ТЗ.Добавить();
	//// +++ VOG Кулаков П.Л. 15.04.2021 DEV-397
	//СтрокаТЗ.Реквизит = "ЭлементРисункаПроизводителя";
	//// --- VOG Кулаков П.Л.
	//СтрокаТЗ.Объект = "Дизайн";
	//СтрокаТЗ.ИмяКолонки = "ЭлементРисункаСсылка";
	//СтрокаТЗ.Представление = "ЭлементРисунка (Дизайн)";
	//СтрокаТЗ.ПроверятьЗаполнение = Истина;
	//СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение = "ЭлементРисунка"; //1
	// -- VOG Солодов В.В. 08.09.2021 CRM-1193
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Реквизит = "ПоверхностьОбои";
	СтрокаТЗ.Объект = "Дизайн";
	СтрокаТЗ.ИмяКолонки = "ПоверхностьОбоиСсылка";
	СтрокаТЗ.Представление = "ПоверхностьОбои (Дизайн)";	
	СтрокаТЗ.ПроверятьЗаполнение = Истина;
	СтрокаТЗ.ИмяКолонкиПроверятьЗаполнение = "Поверхность"; //1			
	
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьСтруктуруОбновляемыхРеквизитов(ТаблицаРеквизитов) Экспорт
	
	ТЗНоменклатура = ТаблицаРеквизитов.Выгрузить();
	ТЗНоменклатура.Очистить();
	ТЗНоменклатурныеГруппы = ТаблицаРеквизитов.Выгрузить();
	ТЗНоменклатурныеГруппы.Очистить();
	ТЗДизайны = ТаблицаРеквизитов.Выгрузить();
	ТЗДизайны.Очистить();
	
	Для каждого Стр из ТаблицаРеквизитов цикл
		Если Стр.Загрузить = Истина тогда
			Если Стр.Объект = "Номенклатура" тогда
				СтрокаТЗ = ТЗНоменклатура.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ,Стр); 				
			ИначеЕсли Стр.Объект = "НоменклатурнаяГруппа" тогда
				СтрокаТЗ = ТЗНоменклатурныеГруппы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ,Стр); 				
			ИначеЕсли Стр.Объект = "Дизайн" тогда
				СтрокаТЗ = ТЗДизайны.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ,Стр); 				
			КонецЕсли;	
		КонецЕсли;			
	КонецЦикла;
	
	Возврат Новый Структура("ТЗНоменклатура,ТЗНоменклатурныеГруппы,ТЗДизайны" ,ТЗНоменклатура,ТЗНоменклатурныеГруппы,ТЗДизайны);
	
КонецФункции