
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.ПредопределеннаяПапка Тогда
		ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущийПользовательРазрешеноАдминистрирование = CRM_УправлениеЭлектроннойПочтой.ТекущийПользовательПолучитьПравоУчетнойЗаписи(Объект.Владелец, "Администрирование");

	Если НЕ ТекущийПользовательРазрешеноАдминистрирование Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Недостаточно прав для работы с папками учетной записи!
							|У текущего пользователя в списке пользователей учетной записи должно быть установлено право ""Администрирование""
							|'"), СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры
