
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ CRM_ЛицензированиеСервер.ПодсистемаCRMИспользуется() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Невозможно открыть форму обмена. Подсистема 1С:CRM не используется!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().ПроверитьЗащиту();
	
	Если НЕ Параметры.Свойство("Организация") Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЭлементОтбора = ДокументСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");	
	НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.Использование  = Истина;
	НовыйЭлементОтбора.ПравоеЗначение = Параметры.Организация;
	
	НовыйЭлементОтбора = ДокументСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Партнер");	
	НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.Использование  = Истина;
	НовыйЭлементОтбора.ПравоеЗначение = Параметры.Контрагент;
	
	НовыйЭлементОтбора = ДокументСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	НовыйЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Договор");	
	НовыйЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.Использование  = Истина;
	НовыйЭлементОтбора.ПравоеЗначение = Параметры.Договор;
	
	ПродажаОплата.Параметры.УстановитьЗначениеПараметра("Ссылка", 	Документы.CRM_СчетНаОплатуПокупателю.ПустаяСсылка());
	ПродажаОтгрузка.Параметры.УстановитьЗначениеПараметра("Ссылка", Документы.CRM_СчетНаОплатуПокупателю.ПустаяСсылка());
	ПродажаТовары.Параметры.УстановитьЗначениеПараметра("Ссылка", 	Документы.CRM_СчетНаОплатуПокупателю.ПустаяСсылка());
	
	//// Заполним список статусов сделок	
	//СтатусСписокВыбора = CRM_ОбщегоНазначенияПовтИсп.СтатусСделокПолучитьСписокВыбора();	

	//Для каждого ЭлементСписка Из СтатусСписокВыбора Цикл
	//	
	//	Элементы.ОтборСтатус.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	//	
	//КонецЦикла;
	//
	//ЭтаФорма.ОтборСтатус = Перечисления.CRM_СтатусыСделок.ПустаяСсылка();		
	
	ОтборОплата   = "Все";
	
	ОтборОтгрузка = "Все";
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Оплата = Настройки.Получить("ОтборОплата");
	
	Если Оплата = "Оплаченные" Тогда
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОтгрузки", 0, Истина, ВидСравненияКомпоновкиДанных.Больше);
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОплата", 0, Истина);
		
	ИначеЕсли Оплата = "Неоплаченные" Тогда
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОтгрузки", 0, Истина, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОплата", 0, Истина, ВидСравненияКомпоновкиДанных.Больше);
		
	КонецЕсли;
	
	Отгрузка = Настройки.Получить("ОтборОтгрузка");
	
	Если Отгрузка = "Отгруженные" Тогда
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОтгрузка", 0, Истина);
		
	ИначеЕсли Отгрузка = "Неотгруженные" Тогда
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОтгрузка", 0, Истина, ВидСравненияКомпоновкиДанных.Больше);
		
	КонецЕсли;
	
	//Статус = Настройки.Получить("ОтборСтатус");
	//
	//// Установить отборы для статуса сделки.
	//Если ЗначениеЗаполнено(Статус) Тогда		
	//	
	//	CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "Статус", Статус, Истина);
	//	
	//КонецЕсли;	
	
КонецПроцедуры

#Область ПроцедурыОбработчикиСобытийОстальныхЭлементовУправленияФормы

&НаКлиенте
Процедура ОбработчикОжиданияДокументСписокПриАктивизацииСтроки() 
	
	ТекущиеДанные = Элементы.ДокументСписок.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ПродажаОплата.Параметры.УстановитьЗначениеПараметра("Ссылка", 	Элементы.ДокументСписок.ТекущаяСтрока);
		ПродажаОтгрузка.Параметры.УстановитьЗначениеПараметра("Ссылка", Элементы.ДокументСписок.ТекущаяСтрока);
		ПродажаТовары.Параметры.УстановитьЗначениеПараметра("Ссылка", 	Элементы.ДокументСписок.ТекущаяСтрока);
	Иначе
		ПродажаОплата.Параметры.УстановитьЗначениеПараметра("Ссылка", 	ПредопределенноеЗначение("Документ.CRM_СчетНаОплатуПокупателю.ПустаяСсылка"));
		ПродажаОтгрузка.Параметры.УстановитьЗначениеПараметра("Ссылка", ПредопределенноеЗначение("Документ.CRM_СчетНаОплатуПокупателю.ПустаяСсылка"));
		ПродажаТовары.Параметры.УстановитьЗначениеПараметра("Ссылка", 	ПредопределенноеЗначение("Документ.CRM_СчетНаОплатуПокупателю.ПустаяСсылка"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументСписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДокументСписокПриАктивизацииСтроки",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОплатаПриИзменении(Элемент)
	
	Если ОтборОплата = "Оплаченные" Тогда
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОплаты", 0, Истина, ВидСравненияКомпоновкиДанных.Больше);
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОплата", 0, Истина);
		
	ИначеЕсли ОтборОплата = "Неоплаченные" Тогда
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОплаты");		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОплата", 0, Истина, ВидСравненияКомпоновкиДанных.Больше);
		
	Иначе
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОплаты");
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОплата");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОплатаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОплаты");
	CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОплата");
	
	ОтборОплата = "Все";	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтгрузкаПриИзменении(Элемент)
	
	Если ОтборОтгрузка = "Отгруженные" Тогда
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОтгрузки", 0, Истина, ВидСравненияКомпоновкиДанных.Больше);		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОтгрузка", 0, Истина);
		
	ИначеЕсли ОтборОтгрузка = "Неотгруженные" Тогда
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОтгрузки");				
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОтгрузка", 0, Истина, ВидСравненияКомпоновкиДанных.Больше);
		
	Иначе
		
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОтгрузки");						
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОтгрузка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтгрузкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОтгрузки");					
	CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(ДокументСписок, "СуммаОстатокОтгрузка");
	
	ОтборОтгрузка = "Все";	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
