////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ УПРАВЛЕНИЯ ДОСТУПОМ - ГРУППЫ ДОСТУПА

// Процедура ОписанияНачальногоЗаполненияПрофилейГруппДоступа возвращает
// массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
//  Пустая структура может быть получена при помощи функции
// УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа().
//
//  Для автоматической подготовки содержимого процедуры следует
// воспользоваться инструментами разработчика для подсистемы
// Управление доступом.
//
Процедура ОписанияНачальногоЗаполненияПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	ОписанияПрофилей = Новый Массив;

#Область Описание_профиля_Менеджер_по_продажам
	// Описание для заполнения профиля "Менеджер по продажам".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.МенеджерПоПродажам.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.МенеджерПоПродажам.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.МенеджерПоПродажам.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	// ++ VOG Солодов В.В. 21.05.2019 task 345
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	// -- VOG Солодов В.В. 21.05.2019
	// ++ VOG Солодов В.В. 02.07.2019 task 440
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	// -- VOG Солодов В.В. 02.07.2019
	// ++ VOG Солодов В.В. 16.07.2019 task 459
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	// -- VOG Солодов В.В. 16.07.2019
	//START Кайдашов 18/07/19 415
	ОписаниеПрофиля.Роли.Добавить("вогДополнительныеПраваНаПросмотрДанныхПоБизнесПроцессам");
	//END Кайдашов
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти     

#Область Описание_профиля_Координатор
	// Описание для заполнения профиля "Координатор".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.Координатор.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.Координатор.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.Координатор.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	// ++ VOG Солодов В.В. 21.05.2019 task 345
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	// -- VOG Солодов В.В. 21.05.2019
	// ++ VOG Солодов В.В. 02.07.2019 task 440
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	// -- VOG Солодов В.В. 02.07.2019
	//START Кайдашов 18/07/19 415
	ОписаниеПрофиля.Роли.Добавить("вогДополнительныеПраваНаПросмотрДанныхПоБизнесПроцессам");
	//END Кайдашов
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_РТН
	// Описание для заполнения профиля "Руководитель товарного направления".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.РуководительТоварногоНаправления.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.РуководительТоварногоНаправления.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.РуководительТоварногоНаправления.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	// ++ VOG Солодов В.В. 21.05.2019 task 345
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	// -- VOG Солодов В.В. 21.05.2019
	// ++ VOG Солодов В.В. 02.07.2019 task 440
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	// -- VOG Солодов В.В. 02.07.2019
	//START Кайдашов 18/07/19 415
	ОписаниеПрофиля.Роли.Добавить("вогДополнительныеПраваНаПросмотрДанныхПоБизнесПроцессам");
	//END Кайдашов
	ОписаниеПрофиля.Роли.Добавить("вогФормированиеПорученийПоЗаполнениюАнкет");	//Кайдашов 24/01/20 CRM-177
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_ГенеральныйДиректор
	// Описание для заполнения профиля "ГенеральныйДиректор".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ГенеральныйДиректор.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ГенеральныйДиректор.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ГенеральныйДиректор.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	// ++ VOG Солодов В.В. 21.05.2019 task 345
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	// -- VOG Солодов В.В. 21.05.2019
	// ++ VOG Солодов В.В. 02.07.2019 task 440
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	// -- VOG Солодов В.В. 02.07.2019
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогФормированиеПорученийПоЗаполнениюАнкет");	//Кайдашов 24/01/20 CRM-177
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_ДиректорПоРазвитию
	// Описание для заполнения профиля "ДиректорПоРазвитию".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ДиректорПоРазвитию.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ДиректорПоРазвитию.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ДиректорПоРазвитию.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	// ++ VOG Солодов В.В. 02.07.2019 task 440
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	// -- VOG Солодов В.В. 02.07.2019
	//START Кайдашов 18/07/19 415
	ОписаниеПрофиля.Роли.Добавить("вогДополнительныеПраваНаПросмотрДанныхПоБизнесПроцессам");
	//END Кайдашов
	ОписаниеПрофиля.Роли.Добавить("вогФормированиеПорученийПоЗаполнениюАнкет");	//Кайдашов 24/01/20 CRM-177
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти


#Область Описание_профиля_Руководитель_отдела_продаж
	// Описание для заполнения профиля "Руководитель отдела продаж".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.РуководительОтделаПродаж.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.РуководительОтделаПродаж.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.РуководительОтделаПродаж.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
		
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	// ++ VOG Солодов В.В. 21.05.2019 task 345
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	// -- VOG Солодов В.В. 21.05.2019
	// ++ VOG Солодов В.В. 02.07.2019 task 440
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	// -- VOG Солодов В.В. 02.07.2019
	//START Кайдашов 18/07/19 415
	ОписаниеПрофиля.Роли.Добавить("вогДополнительныеПраваНаПросмотрДанныхПоБизнесПроцессам");
	//END Кайдашов
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	
	ОписаниеПрофиля.Описание = НСтр("ru = 'Ведение сделок на предприятии, производится планирование, анализирование эффективности сделок''");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Коммерческий_директор
	// Описание для заполнения профиля "Коммерческий директор".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.КоммерческийДиректор.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.КоммерческийДиректор.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.КоммерческийДиректор.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	// Перечень доступных ролей
		
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Набор ролей для работы коммерческого директора. Проводится анализ 
	|и классификация клиентов и номенклатуры, анкетирование, настраиваются
	|правила продаж и происходит управление маркетинговыми мероприятиями'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Бухгалтер
	// Описание для заполнения профиля "Бухгалтер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.Бухгалтер.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.Бухгалтер.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.Бухгалтер.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	// Перечень доступных ролей
	
	// ++ VOG Солодов 26.03.2019
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменений
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	// ++ VOG Солодов В.В. 02.07.2019 task 440
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	// -- VOG Солодов В.В. 02.07.2019
	// ++ VOG Солодов В.В. 24.06.2021 DEV-550
	ОписаниеПрофиля.Роли.Добавить("ДоступКНаправлениюДеятельностиВДоговорах");
	// -- VOG Солодов В.В. 24.06.2021 DEV-550
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	// -- VOG Солодов 26.03.2019
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Набор ролей для работы бухгалтера'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Маркетолог
	// Описание для заполнения профиля "Маркетолог".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.Маркетолог.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.Маркетолог.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.Маркетолог.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	// Перечень доступных ролей
	
	// ++ VOG Солодов В.В. 16.07.2019 task 459
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	// -- VOG Солодов В.В. 16.07.2019
		
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Набор ролей для работы с клиентами, анкетирования, телемаркетинга,
	|рассылки электронной почты.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Управление_маркетингом
	// Описание для заполнения профиля "Управление маркетингом".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.УправлениеМаркетингом.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.УправлениеМаркетингом.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.УправлениеМаркетингом.ИмяПредопределенныхДанных;
	// Перечень доступных ролей
	

		
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Управление маркетингом'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Секретарь
	// Описание для заполнения профиля "Секретарь".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.Секретарь.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.Секретарь.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.Секретарь.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	// Перечень доступных ролей
		
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Набор ролей для работы секретаря'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Импорт_из_файлов
	// Импорт клиентов и номенклатуры из внешних файлов.
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ИмпортИзФайлов.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ИмпортИзФайлов.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ИмпортИзФайлов.ИмяПредопределенныхДанных;
	// Роли
		
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Позволяет использовать обработку загрузки клиентов
	|и номенклатуры (цен номенклатуры) из внешних файлов'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Отправка_SMS
	// Описание для заполнения профиля "ОтправкаSMS".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ОтправкаSMS.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ОтправкаSMS.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ОтправкаSMS.ИмяПредопределенныхДанных;
	// Роли
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Позволяет отправлять SMS-сообщения'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Управление_бизнес_процессами
	// Описание для заполнения профиля "УправлениеБизнесПроцессами".
	// Управление бизнес-процессами.
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.УправлениеБизнесПроцессами.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.УправлениеБизнесПроцессами.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.УправлениеБизнесПроцессами.ИмяПредопределенныхДанных;
	// Роли

	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Используется для настройки механизма бизнес-процессов, а 
	|также анализ выполнения бизнес-процессов, администрирования их'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Управление_проектами
	// Описание для заполнения профиля "УправлениеПроектами".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.УправлениеПроектами.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.УправлениеПроектами.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.УправлениеПроектами.ИмяПредопределенныхДанных;
	// Роли
		
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Управление проектами и анализ'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Настройка_и_редактирование_НСИ
	// Описание для заполнения профиля "НастройкаИредактированиеНСИ".
	// Базовые права и настройка подсистемы CRM.
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.НастройкаИредактированиеНСИ.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.НастройкаИредактированиеНСИ.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.НастройкаИредактированиеНСИ.ИмяПредопределенныхДанных;
	// Роли
		
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Набор ролей для настройки системы'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Обмен_Outlook_Exchange
	// Описание для заполнения профиля "Обмен с MS Outlook и MS Exchange".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ОбменСMSOutlook_MSExchange.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ОбменСMSOutlook_MSExchange.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ОбменСMSOutlook_MSExchange.ИмяПредопределенныхДанных;
	// Роли
	
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Обмен с MS Outlook и MS Exchange'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Внешний_пользователь_для_анкетирования
	// Описание для заполнения профиля "CRM_ВнешнийПользовательДляАнкетирования".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.CRM_ВнешнийПользовательДляАнкетирования.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.CRM_ВнешнийПользовательДляАнкетирования.Наименование;
	ОписаниеПрофиля.Назначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип);
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.CRM_ВнешнийПользовательДляАнкетирования.ИмяПредопределенныхДанных;
	// Роли

	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Набор ролей для пользователей, которые участвуют в анкетировании/опросах посредством внешнего доступа.'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Передача_дел_ответственному
	// Описание для заполнения профиля "ПередачаДелОтветственному".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ПередачаДелОтветственному.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ПередачаДелОтветственному.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ПередачаДелОтветственному.ИмяПредопределенныхДанных;
	// Роли
	
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Позволяет перенаправлять документы, бизнесс-процессы 
	|и задачи новому ответсвенному, игнорируя права доступа'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Создание_общих_шаблонов
	// Описание для заполнения профиля "Создание общих шаблонов документов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.СозданиеОбщихШаблоновДокументов.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.СозданиеОбщихШаблоновДокументов.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.СозданиеОбщихШаблоновДокументов.ИмяПредопределенныхДанных;
	// Перечень доступных ролей
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Создание общих шаблонов документов'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Администрирование_базы_знаний
	// Описание для заполнения профиля "Администрирование базы знаний".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.АдминистрированиеБазыЗнаний.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.АдминистрированиеБазыЗнаний.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.АдминистрированиеБазыЗнаний.ИмяПредопределенныхДанных;
	// Перечень доступных ролей
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Администрирование базы знаний'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);	
#КонецОбласти

#Область Описание_профиля_Интеграция_с_Qlik_Sense
	// Описание для заполнения профиля "Интеграция с Qlik Sense".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ИнтеграцияQlikSense.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ИнтеграцияQlikSense.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ИнтеграцияQlikSense.ИмяПредопределенныхДанных;
	// Перечень доступных ролей

	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Интеграция с сервисом визуализации данных Qlik Sense'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);	
#КонецОбласти

// ++ VOG Солодов В.В.
#Область Описание_профиля_СлужбаБезопасности
	// Описание для заполнения профиля "Служба безопасности".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.СлужбаБезопасности.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.СлужбаБезопасности.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.СлужбаБезопасности.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
		
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	// ++ VOG Солодов В.В. 24.06.2019 task 360
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	// До изменения
	//ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	//ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	//ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	//ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	// -- VOG Солодов В.В. 24.06.2019
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	// ++ VOG Солодов В.В. 22.05.2019 task 311
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	// -- VOG Солодов В.В. 22.05.2019
	//START Кайдашов 18/07/19 415
	ОписаниеПрофиля.Роли.Добавить("вогДополнительныеПраваНаПросмотрДанныхПоБизнесПроцессам");
	//END Кайдашов
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");

	// Служебная роль
	ОписаниеПрофиля.Роли.Добавить("вогСлужбаБезопасности");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_ФинансовыйКонтролер
	// Описание для заполнения профиля "Финансовый контролер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ФинансовыйКонтролер.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ФинансовыйКонтролер.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ФинансовыйКонтролер.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
		
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	// ++ VOG Солодов В.В. 02.07.2019 task 440
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	// -- VOG Солодов В.В. 02.07.2019
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	//START Кайдашов 18/07/19 415
	ОписаниеПрофиля.Роли.Добавить("вогДополнительныеПраваНаПросмотрДанныхПоБизнесПроцессам");
	//END Кайдашов
		
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
// -- VOG Солодов В.В

// ++ VOG Солодов В.В. 30.05.2019 task 344
#Область Описание_профиля_ТехПоддержка
	// Описание для заполнения профиля "Тех. поддержка".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ТехПоддержка.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ТехПоддержка.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ТехПоддержка.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
		
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменение
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("вогТехПоддержка");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
// -- VOG Солодов В.В. 30.05.2019

// ++ VOG Солодов В.В. 24.06.2019 task 360
#Область Описание_профиля_Директор_по_розничным_проектам
	// Описание для заполнения профиля "Директор по розничным проектам".
	ОписаниеПрофиля 				= УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 	
		= Строка(Справочники.ПрофилиГруппДоступа.ДиректорПоРозничнымПроектам.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование 	= Справочники.ПрофилиГруппДоступа.ДиректорПоРозничнымПроектам.Наименование;
	ОписаниеПрофиля.Имя 			= Справочники.ПрофилиГруппДоступа.ДиректорПоРозничнымПроектам.ИмяПредопределенныхДанных;
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Директор_по_безопасности_и_юридическому_сопровождению
	// Описание для заполнения профиля "Директор по безопасности и юридическому сопровождению".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор
		= Строка(Справочники.ПрофилиГруппДоступа.ДиректорПоБезопасностиИЮридическомуСопровождению.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование
		= Справочники.ПрофилиГруппДоступа.ДиректорПоБезопасностиИЮридическомуСопровождению.Наименование;
	ОписаниеПрофиля.Имя
		= Справочники.ПрофилиГруппДоступа.ДиректорПоБезопасностиИЮридическомуСопровождению.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");

	// Служебная роль
	ОписаниеПрофиля.Роли.Добавить("вогСлужбаБезопасности");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Директор_по_персоналу
	// Описание для заполнения профиля "Директор по персоналу".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ДиректорПоПерсоналу.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ДиректорПоПерсоналу.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ДиректорПоПерсоналу.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Руководитель_бизнес_анализа
	// Описание для заполнения профиля "Руководитель бизнес-анализа".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = 
		Строка(Справочники.ПрофилиГруппДоступа.РуководительБизнесАнализа.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.РуководительБизнесАнализа.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.РуководительБизнесАнализа.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Руководитель_отдела_закупок
	// Описание для заполнения профиля "Руководитель отдела закупок".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.РуководительОтделаЗакупок.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.РуководительОтделаЗакупок.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.РуководительОтделаЗакупок.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Главный_бухгалтер_ГК
	// Описание для заполнения профиля "Главный бухгалтер ГК".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = Строка(Справочники.ПрофилиГруппДоступа.ГлавныйБухгалтерГК.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ГлавныйБухгалтерГК.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ГлавныйБухгалтерГК.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Набор ролей для работы главного бухгалтера ГК'");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Руководитель_отдела_фин_контроля
	// Описание для заполнения профиля "Руководитель отдела фин. контроля".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор
		= Строка(Справочники.ПрофилиГруппДоступа.РуководительОтделаФинКонтроля.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.РуководительОтделаФинКонтроля.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.РуководительОтделаФинКонтроля.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
		
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Директор_по_складской_логистике
	// Описание для заполнения профиля "Директор по складской логистике".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.ДиректорПоСкладскойЛогистике.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ДиректорПоСкладскойЛогистике.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ДиректорПоСкладскойЛогистике.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Директор_по_транспортной_логистике
	// Описание для заполнения профиля "Директор по транспортной логистике".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.ДиректорПоТранспортнойЛогистике.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ДиректорПоТранспортнойЛогистике.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ДиректорПоТранспортнойЛогистике.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Директор_по_маркетингу
	// Описание для заполнения профиля "Директор по маркетингу".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.ДиректорПоМаркетингу.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ДиректорПоМаркетингу.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ДиректорПоМаркетингу.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Личный_помощник
	// Описание для заполнения профиля "Личный помощник".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.ЛичныйПомощник.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ЛичныйПомощник.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ЛичныйПомощник.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
// -- VOG Солодов В.В. 24.06.2019

// ++ VOG Солодов В.В. 16.07.2019 task 459
#Область Описание_профиля_Пользователь_CRM
	// Описание для заполнения профиля "Пользователь CRM".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.ПользовательCRM.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ПользовательCRM.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ПользовательCRM.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Отдел_закупок
	// Описание для заполнения профиля "Отдел закупок".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.ОтделЗакупок.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.ОтделЗакупок.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.ОтделЗакупок.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Мерчендайзер
	// Описание для заполнения профиля "Мерчендайзер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.Мерчендайзер.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.Мерчендайзер.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.Мерчендайзер.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Менеджер_по_проектам
	// Описание для заполнения профиля "Менеджер по проектам".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.МенеджерПоПроектам.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.МенеджерПоПроектам.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.МенеджерПоПроектам.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти

#Область Описание_профиля_Юрист
	// Описание для заполнения профиля "Юрист".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор 
		= Строка(Справочники.ПрофилиГруппДоступа.Юрист.УникальныйИдентификатор());
	ОписаниеПрофиля.Наименование  = Справочники.ПрофилиГруппДоступа.Юрист.Наименование;
	ОписаниеПрофиля.Имя 		  = Справочники.ПрофилиГруппДоступа.Юрист.ИмяПредопределенныхДанных;
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Перечень доступных ролей
	
	//Чтение справочников
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификаторов");
	
	//ДобавлниеИзменени
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеАнкет");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКонтактныхЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеТорговыхТочек");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеЮридическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеДокументовФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("вогДобавлениеИзменениеРаспределительныхЦентров");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеТорговыхТочекПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеПартнеровПоУровнюДоступа");
	ОписаниеПрофиля.Роли.Добавить("вогЧтениеЮридическихЛицПоУровнюДоступа");
	
	ОписаниеПрофиля.Роли.Добавить("вогПолныйДоступККлиентскойБазеЧтение"); // VOG Ульянов И.В. 23.03.2020 CRM-194
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВариантыОпросов", "ВначалеВсеЗапрещены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
#КонецОбласти
// -- VOG Солодов В.В. 16.07.2019

КонецПроцедуры // ОписанияНачальногоЗаполненияПрофилейГруппДоступа()

// Служебная фунция
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля)

	// Запуск 1С:Предприятия
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	//ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеТекущегоПользователя");
	
	// Базовые права
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("вогБазовыеПрава");

	//Рабочий стол
	ОписаниеПрофиля.Роли.Добавить("скИспользованиеРабочегоСтола");
	
	//СофтФон
	ОписаниеПрофиля.Роли.Добавить("вогИспользованиеСофтФон");
	
	// Календарные графики
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");

	// Варианты отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");

	//ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	//
	//// Задачи и задания.
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	//ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	//
	//// Заметки и напоминания.
	////ОписаниеПрофиля.Роли.Добавить("ИспользованиеЗаметок");
	////ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииСДокументооборот");
	////ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭЦП");
	//
	//// Печать
	//ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	//
	//// Дополнительные сведения.
	//ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	//
	//// Редактирование реквизитов объектов.
	//ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	//
	//// Использование дополнительных отчетов и обработок.
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	//ОписаниеПрофиля.Роли.Добавить("CRM_ИспользованиеДополнительныхОтчетовИОбработок");
	//
		//
	//// Работа с адресными данными
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	//
	//// Работа с почтой
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВзаимодействий");
	//
	//// Работа с сервисом СПАРК Риски
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	
КонецПроцедуры

// Вспомогательная процедура, вызывается из процедуры СоздатьЭлементыСправочникаГруппыДоступа.
//
// Параметры:
//	ГруппаДоступа	- СправочникСсылка.ГруппыДоступа	- Ссылка на группу доступа.
//
Процедура ДобавитьТекущегоПользователяВГруппуДоступа(Знач ГруппаДоступа)
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	МассивДобавленныхПользователей = Новый Массив();
	Для Каждого СтрокаТаблицы Из ГруппаДоступа.Пользователи Цикл
		Если ТипЗнч(СтрокаТаблицы.Пользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			ПользователиГруппы = CRM_ОбщегоНазначенияСервер.ПолучитьПользователейГруппы(СтрокаТаблицы.Пользователь, Истина);
			Для Каждого ПользовательГруппы Из ПользователиГруппы Цикл
				МассивДобавленныхПользователей.Добавить(ПользовательГруппы);
			КонецЦикла;
		ИначеЕсли ТипЗнч(СтрокаТаблицы.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			МассивДобавленныхПользователей.Добавить(СтрокаТаблицы.Пользователь);
		ИначеЕсли ТипЗнч(СтрокаТаблицы.Пользователь) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
			МассивДобавленныхПользователей.Добавить(СтрокаТаблицы.Пользователь);
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	Если МассивДобавленныхПользователей.Найти(ТекущийПользователь) = Неопределено Тогда
		ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
		НоваяСтрока = ГруппаДоступаОбъект.Пользователи.Добавить();
		НоваяСтрока.Пользователь = ТекущийПользователь;
		// На всякий случай уберем флаг не обновлять роли (если он есть).
		Попытка
			ГруппаДоступаОбъект.ДополнительныеСвойства.Удалить("НеОбновлятьРолиПользователей");
		Исключение
		КонецПопытки;
		ГруппаДоступаОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

// Процедура создает элементы справочника ГруппыДоступа на основании элементов справочника ПрофилиГруппДоступа.
//
Процедура СоздатьЭлементыСправочникаГруппыДоступа() Экспорт
	
	СписокПрофилейГруппДоступа = Новый СписокЗначений();
	// АдминистрированиеИНСИ
	СписокПрофилейГруппДоступа.Добавить("Администратор",							НСтр("ru = 'Администраторы'"));
	СписокПрофилейГруппДоступа.Добавить("НастройкаИредактированиеНСИ",				НСтр("ru = 'Администрирование и НСИ'"));
	// Дополнительные
	СписокПрофилейГруппДоступа.Добавить("ИмпортИзФайлов",							НСтр("ru = 'Импорт из файлов'"));
	СписокПрофилейГруппДоступа.Добавить("ОбменСMSOutlook_MSExchange",				НСтр("ru = 'Обмен с MS Outlook и MS Exchange'"));
	СписокПрофилейГруппДоступа.Добавить("УправлениеБизнесПроцессами",				НСтр("ru = 'Управление бизнес процессами'"));
	СписокПрофилейГруппДоступа.Добавить("УправлениеПроектами",						НСтр("ru = 'Управление проектами'"));
	СписокПрофилейГруппДоступа.Добавить("АдминистрированиеБазыЗнаний",				НСтр("ru = 'Администрирование базы знаний'"));
	СписокПрофилейГруппДоступа.Добавить("ОтправкаSMS",								НСтр("ru = 'Отправка SMS'"));
	СписокПрофилейГруппДоступа.Добавить("ПередачаДелОтветственному",				НСтр("ru = 'Передача дел ответственному'"));
	СписокПрофилейГруппДоступа.Добавить("СозданиеОбщихШаблоновДокументов",			НСтр("ru = 'Создание общих шаблонов документов'"));	
	// Продажи
	СписокПрофилейГруппДоступа.Добавить("Маркетолог",								НСтр("ru = 'Маркетологи'"));
	СписокПрофилейГруппДоступа.Добавить("МенеджерПоПродажам",						НСтр("ru = 'Менеджеры по продажам'"));
	СписокПрофилейГруппДоступа.Добавить("РуководительОтделаПродаж",					НСтр("ru = 'Руководители отдела продаж'"));
	СписокПрофилейГруппДоступа.Добавить("УправлениеМаркетингом",					НСтр("ru = 'Управление маркетингом'"));
	// Прочее
	СписокПрофилейГруппДоступа.Добавить("Секретарь",								НСтр("ru = 'Секретари'"));
	СписокПрофилейГруппДоступа.Добавить("CRM_ВнешнийПользовательДляАнкетирования",	НСтр("ru = 'Внешние пользователи (для анкетирования)'"));
	// Финансы
	СписокПрофилейГруппДоступа.Добавить("Бухгалтер",								НСтр("ru = 'Бухгалтера'"));
	СписокПрофилейГруппДоступа.Добавить("КоммерческийДиректор",						НСтр("ru = 'Коммерческие директоры'"));
	
	Для Каждого ЭлементСписка Из СписокПрофилейГруппДоступа Цикл
		Попытка
			Профиль = Справочники.ПрофилиГруппДоступа[ЭлементСписка.Значение];
		Исключение
			Продолжить;
		КонецПопытки;
		Если ЗначениеЗаполнено(ЭлементСписка.Представление) Тогда
			Наименование = ЭлементСписка.Представление;
		Иначе
			Наименование = Профиль.Наименование;
		КонецЕсли;
		ГруппаСсылка = Справочники.ГруппыДоступа.НайтиПоНаименованию(Наименование, Истина);
		Если ЗначениеЗаполнено(ГруппаСсылка) Тогда
			Если ГруппаСсылка = Справочники.ГруппыДоступа.Администраторы Тогда
				ДобавитьТекущегоПользователяВГруппуДоступа(ГруппаСсылка);
			//ИначеЕсли ГруппаСсылка = Справочники.ГруппыДоступа.CRM_ВнешниеПользователиДляАнкетирования Тогда
			//	ГруппаОбъект = Справочники.ГруппыДоступа.CRM_ВнешниеПользователиДляАнкетирования.ПолучитьОбъект();
			//	ГруппаОбъект.Наименование		= Наименование;
			//	ГруппаОбъект.Профиль			= Профиль;
			//	ГруппаОбъект.Записать();
			//	ДобавитьТекущегоПользователяВГруппуДоступа(ГруппаСсылка);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		ГруппаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
		ГруппаОбъект.Наименование		= Наименование;
		ГруппаОбъект.Профиль			= Профиль;
		ГруппаОбъект.Записать();
		Если ГруппаОбъект.Ссылка = Справочники.ГруппыДоступа.Администраторы Тогда
			ДобавитьТекущегоПользователяВГруппуДоступа(ГруппаОбъект.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
