
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроцессыИКарты = CRM_БизнесПроцессыСервер.ВернутьСпискиДоступныхПроцессовИКарт(Истина);
	
	СписокДоступныхПроцессов.Добавить("Интерес", "Интерес клиента",,БиблиотекаКартинок.Документ);
	
	Для Каждого ЭлементСписка ИЗ ПроцессыИКарты.Карты Цикл
		СписокДоступныхПроцессов.Добавить(ЭлементСписка.Значение, Строка(ЭлементСписка.Значение),,БиблиотекаКартинок.БизнесПроцессОбъект);
		Для Каждого ЭлементСпискаПроцесс ИЗ ПроцессыИКарты.Процессы Цикл
			Если ЭлементСпискаПроцесс.Значение.CRM_КартаМаршрута = ЭлементСписка.Значение Тогда
				СписокДоступныхПроцессов.Добавить(ЭлементСпискаПроцесс.Значение, "   "+Строка(ЭлементСпискаПроцесс.Значение),,БиблиотекаКартинок.Справочник);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ЭлементСписка ИЗ ПроцессыИКарты.Процессы Цикл
		Если СписокДоступныхПроцессов.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда
			СписокДоступныхПроцессов.Добавить(ЭлементСписка.Значение, Строка(ЭлементСписка.Значение),,БиблиотекаКартинок.Справочник);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступныхПроцессовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(СписокДоступныхПроцессов[ВыбраннаяСтрока].Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступныхПроцессовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступныхПроцессовПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступныхПроцессовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СписокДоступныхПроцессов.Количество() = 1 Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, СписокДоступныхПроцессов[0].Значение);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.СписокДоступныхПроцессов.ТекущаяСтрока = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(СписокДоступныхПроцессов[Элементы.СписокДоступныхПроцессов.ТекущаяСтрока].Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
