
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	РазрешитьРедактированиеИспользованияРегламентногоЗадания = Истина;
	РазрешитьРедактированиеНастройкиСКД                      = Истина;
	РазрешитьРедактированиеРасписание                        = Истина;
	РазрешитьРедактированиеСпособФормирования                = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	Если РазрешитьРедактированиеИспользованияРегламентногоЗадания Тогда
		Результат.Добавить("РегламентноеЗаданиеИспользуется");
	КонецЕсли;
	
	Если РазрешитьРедактированиеНастройкиСКД Тогда
		Результат.Добавить("ПредставлениеШаблонаСКД");
	КонецЕсли;
	
	Если РазрешитьРедактированиеРасписание Тогда
		Результат.Добавить("Расписание");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСпособФормирования Тогда
		Результат.Добавить("СпособФормирования");
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти
