
// + Тищенко В.В.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Идентификатор 	= Параметры.Идентификатор;
	ТипОтображения	= Параметры.ТипОтображения;
	Имя				= Параметры.Имя;
	
	Если ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ВходящаяСтруктура 	= ПолучитьИзВременногоХранилища(Параметры.Адрес);
		ТекстОбработчика	= ВходящаяСтруктура.ТекстОбработчика;
		Шаблон				= ВходящаяСтруктура.Шаблон;
	КонецЕсли;
	
	ОтображатьЗаголовокРеквизит = Параметры.ОтображатьЗаголовок;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	ПолучитьТекстОбработчика();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("Имя,ТекстОбработчика,Шаблон,ОтображатьЗаголовок",Имя,ТекстОбработчика,Шаблон,ОтображатьЗаголовокРеквизит));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьТекстОбработчика()
	
	Если ЗначениеЗаполнено(Шаблон) Тогда
		ТекстОбработчика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шаблон,"ПроизвольныйКод",Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// - Тищенко В.В.