
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Вид") Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Строка(Параметры.Отбор.Вид);
			
	КонецЕсли;
	
	// ++ VOG Солодов В.В. 07.04.2020 CRM-545
	Если Не Параметры.Свойство("Отбор")
		Или Не Параметры.Отбор.Свойство("Розничный") Тогда
			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Розничный",
			Ложь,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
	КонецЕсли;
	// -- VOG Солодов В.В. 07.04.2020
	
	// +++ VOG Кулаков П.Л. 28.04.2021 DEV-399
	Если Параметры.Свойство("БрендЗоны") И Параметры.БрендЗоны Тогда
		СписокТорговыхТочек = ПолучитьСписокТорговыхТочексБрендЗонами();
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Ссылка",
			СписокТорговыхТочек,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	// --- VOG Кулаков П.Л.
	
КонецПроцедуры

// +++ VOG Кулаков П.Л. 28.04.2021 DEV-399
&НаСервереБезКонтекста
Функция ПолучитьСписокТорговыхТочексБрендЗонами()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БрендЗона.ТорговаяТочка КАК ТорговаяТочка
		|ИЗ
		|	Справочник.БрендЗона КАК БрендЗона
		|ГДЕ
		|	НЕ БрендЗона.ПометкаУдаления
		|	И БрендЗона.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыБрендЗоны.Закрыта)
		|
		|СГРУППИРОВАТЬ ПО
		|	БрендЗона.ТорговаяТочка";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса.ВыгрузитьКолонку("ТорговаяТочка");
	
КонецФункции // --- VOG Кулаков П.Л.
#КонецОбласти