
////////////////////////////////////////////////////////////////////////////////
// вогГеокодированиеВызовСервера:Служебные процедуры геокодирование Яндекс карты
// Тищенко В.В. 
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

 // Возвращяет яндекс ключ для отображения на
 // карте при клике
 //
 // Возвращаемое значение:
 //   Строка   - Яндекс ключ
 //
Функция ПолучитьЯндексКлючьJava() Экспорт
	 Возврат вогГеокодированиеСерверПовтИсп.ПолучитьКлючЯндексJava();
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти