
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Если ТипЗнч(ПараметрКоманды)= Тип("СправочникСсылка.Партнеры") Тогда
			ПараметрыФормы = Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", Новый Структура("Партнер", ПараметрКоманды), "Основной", Истина);
			форма = ОткрытьФорму("Отчет.CRM_ДебиторскаяЗадолженностьПоСрокамДолга.Форма", ПараметрыФормы,,,ПараметрыВыполненияКоманды.Окно);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Клиент не связан с Партнером базы CRM!'")); 
	КонецЕсли;

КонецПроцедуры
