
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И НЕ Группа Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ШаблонОповещения",ШаблонОповещения);
		ОткрытьФорму("Справочник.CRM_ШаблоныРассылки.ФормаОбъекта",ПараметрыФормы,Элементы.Список);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Список.Отбор.Элементы.Количество() = 1 
		И Список.Отбор.Элементы[0].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ШаблонОповещения") Тогда
		ШаблонОповещения = Список.Отбор.Элементы[0].ПравоеЗначение;
	Иначе
		ШаблонОповещения = Ложь;
	КонецЕсли;
	
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	ЭтотОбъект.Заголовок = ?(ШаблонОповещения,НСтр("ru = 'Шаблоны e-mail рассылки (Для оповещений)'"),НСтр("ru = 'Шаблоны e-mail рассылки (Для рассылок)'"));
	
КонецПроцедуры



