// +++ VOG Кулаков П.Л. 26.07.2021 DEV-782
Функция ПолучитьМассивНоменклатурныхГруппСегмента(Сегмент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	НоменклатурныеГруппыСегмента.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ИЗ
		|	РегистрСведений.НоменклатурныеГруппыСегмента КАК НоменклатурныеГруппыСегмента
		|ГДЕ
		|	НоменклатурныеГруппыСегмента.Сегмент = &Сегмент";
	
	Запрос.УстановитьПараметр("Сегмент", Сегмент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("НоменклатурнаяГруппа");
	
КонецФункции // --- VOG Кулаков П.Л.