

Процедура ОткрытьРасшифровкуПоказателя(Показатель, МассивПользователей = Неопределено, НачалоКонецПериода = Неопределено) Экспорт
	Если МассивПользователей = Неопределено Тогда
		МассивПользователей = CRM_УправлениеЦелевымиПоказателямиСервер.ПолучитьМассивПользователей(Истина);
	КонецЕсли;
	
	Если НачалоКонецПериода = Неопределено Тогда
		ПоказательПериодАнализа = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Показатель, "ПериодАнализа");
		Если ПоказательПериодАнализа = "Месяц" Тогда
			ДатаНачала = НачалоМесяца(ТекущаяДата());
			ДатаОкончания = КонецМесяца(ТекущаяДата());
		ИначеЕсли ПоказательПериодАнализа = "День" Тогда	
			ДатаНачала = НачалоДня(ТекущаяДата());
			ДатаОкончания = КонецДня(ТекущаяДата());
		ИначеЕсли ПоказательПериодАнализа = "Квартал" Тогда	
			ДатаНачала = НачалоКвартала(ТекущаяДата());
			ДатаОкончания = КонецКвартала(ТекущаяДата());
		ИначеЕсли ПоказательПериодАнализа = "Год" Тогда	
			ДатаНачала = НачалоГода(ТекущаяДата());
			ДатаОкончания = КонецГода(ТекущаяДата());	
		КонецЕсли;
	Иначе
		ДатаНачала = НачалоКонецПериода.НачалоПериода;
		ДатаОкончания = НачалоКонецПериода.КонецПериода;
	КонецЕсли;
	
	Если Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.ОбращенияКлиентов") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "Т_СписокКлиентов3");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		Отбор = Новый Структура;
		
		////
		//Отбор.Вставить("ДатаСледующегоДействия", НачалоДня(ТекущаяДата()));
		////
		ПараметрыФормы.Вставить("Отбор", Отбор);
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_КонтрольРуководителя_Интересы.Форма", ПараметрыФормы);
		ОтборДатаСледующегоДействия = Новый ПолеКомпоновкиДанных("ДатаСледующегоДействия"); 
		Для Каждого ЭлементОтбора ИЗ ФормаРасшифровки.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ОтборДатаСледующегоДействия Тогда 
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
			КонецЕсли;	
		КонецЦикла;	
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;
		ФормаРасшифровки.Открыть();
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.КасанияНаОдногоКлиента") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "КасанияНаОдногоКлиента");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
				
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_КонтрольРуководителя_Интересы.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;	
		ФормаРасшифровки.Открыть();
	
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.ЗагрузкаКалендаря") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "МойАвтомотиватор");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_Автомотиватор.Форма", ПараметрыФормы);
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		ПараметрОтветственныйСотрудник = Новый ПараметрКомпоновкиДанных("ОтветственныеСотрудники");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрОтветственныйСотрудник Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;	
		ФормаРасшифровки.Открыть();
	
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.ЗабытыеКлиенты") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "Т_СписокКлиентов1");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_КонтрольРуководителя_Клиенты.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;	
		ФормаРасшифровки.Открыть();
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.КачествоКлиентскойБазы") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "Т_СписокКлиентов1");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_КонтрольРуководителя_Клиенты.Форма", ПараметрыФормы);
			
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		ПараметрВариант = Новый ПараметрКомпоновкиДанных("ВариантРасшифровка");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		ПараметрПроцентЗаполненностиКИКлиенты = Новый ПараметрКомпоновкиДанных("ПроцентЗаполненностиКИКлиенты");
		ПараметрПроцентЗаполненностиПортретКлиенты = Новый ПараметрКомпоновкиДанных("ПроцентЗаполненностиПортретКлиенты");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(Параметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				Если Параметр.Параметр = ПараметрПериод Тогда
					ПериодОтчета = Новый СтандартныйПериод;
					ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
					ПериодОтчета.ДатаНачала = ДатаНачала;
					ПериодОтчета.ДатаОкончания = ДатаОкончания;
					Параметр.Использование = Истина;
					Параметр.Значение = ПериодОтчета;
				ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
					Параметр.Использование = Истина;
					Параметр.Значение = МассивПользователей;
				ИначеЕсли Параметр.Параметр = ПараметрВариант Тогда
					Параметр.Использование = Истина;
					Параметр.Значение = Истина;	
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
			
		ФормаРасшифровки.Открыть();	
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.ТеплыеКлиенты") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "ТеплыеКлиенты");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_КонтрольРуководителя_Интересы.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;
		
		ФормаРасшифровки.Открыть();
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.Взаимодействия") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "ПоВзаимодействиям");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_КонтрольРуководителя_Взаимодействия.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");

		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;
		ФормаРасшифровки.Открыть();
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.ВысланныеКП") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "ПоИнтересам");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_АнализКоммерческихПредложений.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;

				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;
		ФормаРасшифровки.Открыть();		
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.ПроведениеВстреч") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "ПоМенеджерамИПодразделениям");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_АнализМероприятий.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;
		ФормаРасшифровки.Открыть();	
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.ТелефонныеЗвонки") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "ОтчетПоСовершеннымЗвонкам");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.сфпОтчетПоСовершеннымЗвонкам.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		ПараметрДлительность = Новый ПараметрКомпоновкиДанных("ДлительностьЗвонка");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(Параметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				Если Параметр.Параметр = ПараметрПериод Тогда
					ПериодОтчета = Новый СтандартныйПериод;
					ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
					ПериодОтчета.ДатаНачала = ДатаНачала;
					ПериодОтчета.ДатаОкончания = ДатаОкончания;
					Параметр.Использование = Истина;
					Параметр.Значение = ПериодОтчета;
				ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
					Параметр.Использование = Истина;
					Параметр.Значение = МассивПользователей;
				ИначеЕсли Параметр.Параметр = ПараметрДлительность Тогда
					Параметр.Использование = Истина;
					Параметр.Значение = 20;	
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		ФормаРасшифровки.Открыть();
	// +CRM не переносить в объединенные решения
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.Продажи") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "ПоДокументамПродажи");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_АнализПродажПланФакт.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;
		ФормаРасшифровки.Открыть();	
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.СреднийЧек") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "ПоСреднемуЧеку");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_АнализПродажПланФакт.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");

		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;
		ФормаРасшифровки.Открыть();	
	ИначеЕсли Показатель = ПредопределенноеЗначение("Справочник.CRM_ШаблоныКлючевыхПоказателей.ВыставленныеСчета") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КлючВарианта", "ВыставленныеСчета");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		
		
		ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_АнализПродажПланФакт.Форма", ПараметрыФормы);
		ПараметрМенеджеры = Новый ПараметрКомпоновкиДанных("Менеджеры");
		ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
		Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если Параметр.Параметр = ПараметрПериод Тогда
				ПериодОтчета = Новый СтандартныйПериод;
				ПериодОтчета.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
				ПериодОтчета.ДатаНачала = ДатаНачала;
				ПериодОтчета.ДатаОкончания = ДатаОкончания;
				Параметр.Использование = Истина;
				Параметр.Значение = ПериодОтчета;
			ИначеЕсли Параметр.Параметр = ПараметрМенеджеры Тогда
				Параметр.Использование = Истина;
				Параметр.Значение = МассивПользователей;	
			КонецЕсли;	
		КонецЦикла;
		ФормаРасшифровки.Открыть();
		// -CRM не переносить в объединенные решения
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИсточникСКД", Показатель);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыДанных = Новый Структура;
		ПараметрыДанных.Вставить("Показатель", Показатель);
		ПараметрыДанных.Вставить("Менеджер", МассивПользователей[0]);
		ПараметрыДанных.Вставить("Менеджеры", МассивПользователей);
		ПараметрыДанных.Вставить("НачалоПериода", ДатаНачала);
		ПараметрыДанных.Вставить("КонецПериода", ДатаОкончания);
		ПараметрыФормы.Вставить("ПараметрыДанных", ПараметрыДанных);
		ОткрытьФорму("Отчет.CRM_РасшифровкаПроизвольныхПоказателей.Форма", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры	