#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вид цен. 	
	Если ЗначениеЗаполнено(ВидСкидкиНаценки) Тогда
		ПроверяемыеРеквизиты.Добавить("ВидЦен");
	КонецЕсли;
	
КонецПроцедуры

// +CRM
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗначениеНастройки = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнойВидЦенПродажи");
	Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		ВидЦен = ЗначениеНастройки;
	Иначе
		ВидЦен = Справочники.ВидыЦен.Оптовая;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидДоговора) Тогда
		ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
	КонецЕсли;
	
КонецПроцедуры
// -CRM

//+вог
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	вогБессрочный = Не ЗначениеЗаполнено(вогДатаОкончанияДоговора);
	РасчетыВУсловныхЕдиницах = НЕ ВалютаРасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
	
	// ++ VOG Солодов В.В. 10.09.2019 task 636
	Если Не ЗначениеЗаполнено(ДатаДоговора) Тогда
		ДатаДоговора = ТекущаяДата();
	КонецЕсли;
	// -- VOG Солодов В.В. 10.09.2019
	
	// ++ VOG Солодов В.В. 02.12.2019 
	Если Не ЗначениеЗаполнено(вогИдентификаторОбои) Тогда
		вогИдентификаторОбои = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(вогИдентификаторПлитка) Тогда
		вогИдентификаторПлитка = Новый УникальныйИдентификатор;
	КонецЕсли;
	// -- VOG Солодов В.В. 02.12.2019
	
//START Кайдашов 20/02/20
	Если вогВерсия=0 тогда
		вогВерсия = Константы.ВогВерсияПечатнойФормыДоговора.Получить();
	КонецЕсли;
	
	
КонецПроцедуры
//-вог

#КонецЕсли
