&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОткрытаяФорма = Неопределено;
	ВсеОкна = ПолучитьОкна();
	Для Каждого тОкно Из ВсеОкна Цикл
		Для Каждого тСодержимое Из тОкно.Содержимое Цикл
			Если СтрНайти(тСодержимое.ИмяФормы, "CRM_БыстроеОсвоение") > 0 И тСодержимое.КлючУникальности = "ПоказателиУправленияПродажами" Тогда
				ОткрытаяФорма = тСодержимое.ЭтотОбъект;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ОткрытаяФорма <> Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОткрытаяФорма = Неопределено Тогда
		ПараметрыФормы = Новый Структура("Макет","ПоказателиУправленияПродажами");
		ОткрытьФорму("Обработка.CRM_БыстроеОсвоение.Форма",ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
		ОткрытаяФорма.Активизировать();
	КонецЕсли;
КонецПроцедуры
