
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВводПлановПродажПлан.Ссылка КАК Ссылка,
	               |	ВводПлановПродажПлан.НомерСтроки КАК НомерСтроки,
	               |	ВводПлановПродажПлан.Подразделение КАК Подразделение,
	               |	ВводПлановПродажПлан.Период КАК Период,
	               |	ВводПлановПродажПлан.ТорговаяТочка КАК ТРТ,
	               |	ВводПлановПродажПлан.Бренд КАК Бренд,
	               |	ВводПлановПродажПлан.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	ВводПлановПродажПлан.Количество КАК Количество,
	               |	ВводПлановПродажПлан.Сумма КАК Сумма,
	               |	ВводПлановПродажПлан.НДС КАК НДС,
	               |	ВводПлановПродажПлан.Ссылка.Сценарий КАК СценарийПланирования,
	               |	ВводПлановПродажПлан.Ссылка.Версия КАК ВерсияСценария,
	               |	ВводПлановПродажПлан.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	ВводПлановПродажПлан.Партнер КАК Партнер,
	               |	ВводПлановПродажПлан.Менеджер КАК Менеджер,
	               |	ВводПлановПродажПлан.КатегорияПартнера КАК КатегорияПартнера,
	               |	ВводПлановПродажПлан.КоличествоSKUНаПолках053 КАК КоличествоSKUНаПолках053,
	               |	ВводПлановПродажПлан.КоличествоSKUНаПолках106 КАК КоличествоSKUНаПолках106,
	               |	ВводПлановПродажПлан.НаличиеРулоновНаПолу КАК НаличиеРулоновНаПолу,
	               |	ВводПлановПродажПлан.КоличествоНашихSKU053 КАК КоличествоНашихSKU053,
	               |	ВводПлановПродажПлан.КоличествоНашихSKU106 КАК КоличествоНашихSKU106,
	               |	ВводПлановПродажПлан.КоличествоПланшет КАК КоличествоПланшет,
	               |	ВводПлановПродажПлан.КоличествоШтучный КАК КоличествоШтучный,
	               |	ВводПлановПродажПлан.Доля КАК Доля,
	               |	ВводПлановПродажПлан.ДоляВОГ053 КАК ДоляВОГ053,
	               |	ВводПлановПродажПлан.ДоляВОГ106 КАК ДоляВОГ106,
	               |	ВводПлановПродажПлан.ЦельПоЭкспозиции КАК ЦельПоЭкспозиции,
	               |	ВводПлановПродажПлан.ЦельПрироста КАК ЦельПрироста,
	               |	ВводПлановПродажПлан.ЦельСледГод КАК ЦельСледГод,
	               |	ВводПлановПродажПлан.Координатор КАК Координатор,
	               |	ВводПлановПродажПлан.ОборотСПолки053 КАК ОборотСПолки053,
	               |	ВводПлановПродажПлан.ОборотСПолки106 КАК ОборотСПолки106,
	               |	ВводПлановПродажПлан.КорректировкаПлана КАК КорректировкаПлана
	               |ИЗ
	               |	Документ.ВводПлановПродаж.План КАК ВводПлановПродажПлан
	               |ГДЕ
	               |	ВводПлановПродажПлан.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	тзДанныеДокумента = Запрос.Выполнить().Выгрузить();
	Движения.ПланыПродаж.Очистить();
	Движения.ПланыПродаж.Загрузить(тзДанныеДокумента);
	Движения.ПланыПродаж.Записывать = Истина;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Ответственный) тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// +++ VOG Кулаков П.Л. 21.05.2021 DEV-563
	ЕстьДокументыОтменаПлана = ПроверитьНаличиеДокументаОтменаПлана();
	Если ЕстьДокументыОтменаПлана Тогда
		Отказ = Истина;
		Сообщить("Данный документ был отменен");
	КонецЕсли;
	// --- VOG Кулаков П.Л.
	
КонецПроцедуры

// +++ VOG Кулаков П.Л. 21.05.2021 DEV-563
Функция ПроверитьНаличиеДокументаОтменаПлана()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогОтменаПлана.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.вогОтменаПлана КАК вогОтменаПлана
		|ГДЕ
		|	вогОтменаПлана.ОтменяемыйДокумент = &ОтменяемыйДокумент
		|	И вогОтменаПлана.Проведен";
	
	Запрос.УстановитьПараметр("ОтменяемыйДокумент", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции // --- VOG Кулаков П.Л.
