
////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции для обработки ТекущиеДела.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик ПриНажатии полей html в форме текущие дела.
//
// Параметры:
//   Форма - УправляемаяФорма - форма Текущие дела.
//
Процедура HTMLПриНажатии(Форма, Элемент, ДанныеСобытия, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Обработчик ОбработкаРасшифровки диаграмм в форме текущие дела.
//
// Параметры:
//   Форма - УправляемаяФорма - форма Текущие дела.
//
Процедура ДиаграммаОбработкаРасшифровки(Форма, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Расшифровка) Тогда
		
		ИндексВиджета = Прав(Элемент.Имя, 3);
		ТекущийВиджет = Форма["Виджет" + ИндексВиджета];
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму настройки виджета формы.
//
// Параметры:
//   Форма - УправляемаяФорма - форма Текущие дела.
//   ИндексВиджета - Строка - индекс настраиваемого виджета в форме.
//
Процедура НастроитьВиджетФормы(Форма, ИндексВиджета) Экспорт
	
	//ОписаниеОповещения = Новый ОписаниеОповещения(
	//	"ЗавершениеНастройкиВиджетаФормы", ЭтотОбъект, ИндексВиджета);
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ИндексВиджета", ИндексВиджета);
	//
	// ОткрытьФорму("Справочник.CRM_ВиджетыКлючевыхПоказателей.ФормаВыбора",
	//	ПараметрыФормы, Форма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Завершение процедуры НастроитьВиджетФормы.
//
Процедура ЗавершениеНастройкиВиджетаФормы(Виджет, ДопПараметры) Экспорт
	
	//Если Виджет = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Оповестить("ОбновитьВиджеты", Виджет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик нажатия на область меню в виджете.
//
// Параметры:
//   Виджет - СправочникСсылка.Виджеты - ссылка на виджет.
//   Форма - УправляемаяФорма - форма Текущие дела.
//   Элемент - ЭлементФормы - html поле на форме Текущие дела.
//   ИндексВиджета - Строка - индекс виджета на форме Текущие дела.
//
Процедура ОбработатьНажатиеНаОбластьМеню(Виджет, Форма, Элемент, ИндексВиджета) Экспорт
	
	КомандыВМенюВиджета = Новый СписокЗначений;
	
	КомандыВМенюВиджета.Добавить(
		"НастройкаВиджета", НСтр("ru = 'Настроить виджет...'"), , Форма.КэшКартинок.ШестерёнкаПлоская);
	
	ПараметрыОП = Новый Структура;
	ПараметрыОП.Вставить("Форма", Форма);
	ПараметрыОП.Вставить("ИндексВиджета", ИндексВиджета);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработатьНажатиеНаОбластьМеню_Завершение", ЭтотОбъект, ПараметрыОП);
	
	Форма.ПоказатьВыборИзМеню(ОписаниеОповещения, КомандыВМенюВиджета, Элемент);
	
КонецПроцедуры

// Завершение процедуры ОбработатьНажатиеНаОбластьМеню.
//
Процедура ОбработатьНажатиеНаОбластьМеню_Завершение(ВыбраннаяКоманда, Параметры) Экспорт
	
	Если ВыбраннаяКоманда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ВыбраннаяКоманда.Значение;
	
	Если Команда = "НастройкаВиджета" Тогда
		НастроитьВиджетФормы(Параметры.Форма, Параметры.ИндексВиджета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти