
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	МассивОрганизаций = ПолучитьДоступныеОрганизацимПользователя();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		"Организация",
		МассивОрганизаций,
		ВидСравненияКомпоновкиДанных.ВИерархии,
		"По доступным организациям",
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,
		Новый УникальныйИдентификатор());
	
КонецПроцедуры

Функция ПолучитьДоступныеОрганизацимПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДоступныеОрганизации.Организация КАК Организация
		|ИЗ
		|	Справочник.Пользователи.вогОрганизации КАК ДоступныеОрганизации
		|ГДЕ
		|	ДоступныеОрганизации.Ссылка = &ТекущийПользователь";
	
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Организация");
	
КонецФункции