
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УстанавливаемыеПараметры = Новый Соответствие;
	УстанавливаемыеПараметры.Вставить("РольМенеджер", Справочники.РолиИсполнителей.ПолучитьСсылку(Новый УникальныйИдентификатор("2403e82e-cad9-11e8-a684-005056bc3fe8")));
	УстанавливаемыеПараметры.Вставить("Сегмент", 	  Справочники.вогСегментыКоллекцийПлитки.ПолучитьСсылку(Новый УникальныйИдентификатор("2131aefb-d7f1-11eb-b39e-005056bc3fe8")));	
	
	КомпоновкаДанныхКлиентСервер.УстановитьКоллекциюПараметров(КомпоновщикНастроек, УстанавливаемыеПараметры);
	
КонецПроцедуры
