
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// ++ VOG Солодов В.В. 05.03.2020 CRM-376
#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти
// -- VOG Солодов В.В. 05.03.2020

Функция ПолучитьПериодПродаж(Знач ДатаОтчета) Экспорт
	
	ПериодПродаж = Новый СтандартныйПериод;
	
	Если Не ЗначениеЗаполнено(ДатаОтчета) Тогда
		ДатаОтчета 		= ТекущаяДата();
	КонецЕсли;
	
	КоличествоПрошедшихСекунд = ПолучитьКоличествоПрошедшихСекунд(ДатаОтчета);
	
	Если КоличествоПрошедшихСекунд > 0 Тогда
		
		ПериодПродаж.ДатаНачала 	= НачалоМесяца(ДатаОтчета);
		ПериодПродаж.ДатаОкончания 	= НачалоМесяца(ДатаОтчета) + КоличествоПрошедшихСекунд - 1;
		
	Иначе
		
		ПериодПродаж.ДатаНачала 	= Дата(1,1,1);
		ПериодПродаж.ДатаОкончания 	= Дата(1,1,1);
		
		Возврат ПериодПродаж;
		
	КонецЕсли;
	
	Возврат ПериодПродаж;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКоличествоПрошедшихСекунд(ДатаОтчета)
	
	Если Месяц(ДатаОтчета) = Месяц(НачалоНедели(ДатаОтчета) - 1) Тогда
		ДатаОкончания = НачалоНедели(ДатаОтчета) - 1;
	Иначе
		ДатаОкончания = НачалоМесяца(ДатаОтчета);
	КонецЕсли;
	
	Если НачалоДня(ДатаОкончания) = НачалоМесяца(ДатаОтчета) Тогда
		КоличествоПрошедшихСекунд = 0;
	Иначе
		КоличествоПрошедшихСекунд = ДатаОкончания - НачалоМесяца(ДатаОтчета) + 1;
	КонецЕсли;
	
	Возврат КоличествоПрошедшихСекунд;
	
КонецФункции

#КонецОбласти

#КонецЕсли