#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Функция ПолучитьФизЛицо(КонтактноеЛицо) Экспорт
	Если	ТипЗнч(КонтактноеЛицо) <> Тип("СправочникСсылка.КонтактныеЛицаПартнеров")
		ИЛИ	Не ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		//
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.CRM_СвязиФизЛицСКонтактнымиЛицамиПартнеров
	|ГДЕ
	|	КонтактноеЛицо = &КонтактноеЛицо
	|");
	Запрос.УстановитьПараметр("КонтактноеЛицо", КонтактноеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ФизЛицо;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьКонтактныеЛица(ФизЛицо) Экспорт
	Если	ТипЗнч(ФизЛицо) <> Тип("СправочникСсылка.Партнеры")
		ИЛИ	Не ЗначениеЗаполнено(ФизЛицо) Тогда
		//
		Возврат Новый Массив();
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КонтактноеЛицо КАК КонтактноеЛицо
	|ИЗ
	|	РегистрСведений.CRM_СвязиФизЛицСКонтактнымиЛицамиПартнеров
	|ГДЕ
	|	ФизЛицо = &ФизЛицо
	|");
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо");
КонецФункции

Процедура ЗаписатьФизЛицо(КонтактноеЛицо, ФизЛицо) Экспорт
	Если	ТипЗнч(КонтактноеЛицо) <> Тип("СправочникСсылка.КонтактныеЛицаПартнеров")
		ИЛИ	ТипЗнч(ФизЛицо) <> Тип("СправочникСсылка.Партнеры") Тогда
		//
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КонтактноеЛицо) Или Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.CRM_СвязиФизЛицСКонтактнымиЛицамиПартнеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КонтактноеЛицо = КонтактноеЛицо;
	МенеджерЗаписи.ФизЛицо = ФизЛицо;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецЕсли