#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ И НЕ ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(НаборСвойствХарактеристики) Тогда
			ОбъектНабора = Справочники.НаборыДополнительныхРеквизитовИСведений.СоздатьЭлемент();
		Иначе
			ОбъектНабора = НаборСвойствХарактеристики.ПолучитьОбъект();
			ЗаблокироватьДанныеДляРедактирования(ОбъектНабора.Ссылка);
		КонецЕсли;

		ОбъектНабора.Наименование    = Наименование;
		ОбъектНабора.Родитель        = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ХарактеристикиНоменклатуры;
		ОбъектНабора.ПометкаУдаления = ПометкаУдаления;
		ОбъектНабора.Записать();
		НаборСвойствХарактеристики = ОбъектНабора.Ссылка;
		
	КонецЕсли;	
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриКопировании.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	НаборСвойствХарактеристики = Неопределено;
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#КонецЕсли