//++ VOG Иванов С.А. 29.10.2019 ID заявки: 000000775
Процедура СоздатьЗаписьПодписантаКонтактногоЛица(СтруктураЗаписи) Экспорт
	
	НаборЗаписей = РегистрыСведений.вогКонтактныеЛицаПодписанты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КонтактноеЛицо.Установить(СтруктураЗаписи.КонтактноеЛицо);
	НаборЗаписей.Отбор.ЮридическоеЛицо.Установить(СтруктураЗаписи.ОбъектСвязи);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() Тогда
		Возврат;
	КонецЕсли;
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период                  = ?(СтруктураЗаписи.Свойство("Период"), СтруктураЗаписи.Период, ТекущаяДатаСеанса());
	НоваяЗапись.КонтактноеЛицо          = СтруктураЗаписи.КонтактноеЛицо; 
	НоваяЗапись.ЮридическоеЛицо         = СтруктураЗаписи.ОбъектСвязи; 
	НоваяЗапись.Основание               = ?(СтруктураЗаписи.Свойство("Основание"), СтруктураЗаписи.Основание, Перечисления.ВариантыОснованийПодписанта.ПустаяСсылка()); 
	НоваяЗапись.Номер                   = ?(СтруктураЗаписи.Свойство("Номер"), СтруктураЗаписи.Номер, "");
	НоваяЗапись.ДатаДокумента        = ?(СтруктураЗаписи.Свойство("ДатаДокумента"), СтруктураЗаписи.ДатаДокумента, Дата('00010101'));
	НоваяЗапись.ПериодДействияС         = ?(СтруктураЗаписи.Свойство("ПериодДействияС"), СтруктураЗаписи.ПериодДействияС, Дата('00010101'));
	НоваяЗапись.ПериодДействияПо        = ?(СтруктураЗаписи.Свойство("ПериодДействияПо"), СтруктураЗаписи.ПериодДействияПо, Дата('00010101'));
	
	НаборЗаписей.Записать();
КонецПроцедуры
//-- VOG Иванов С.А. 29.10.2019 ID заявки: 000000775