
&НаКлиенте
Процедура ПоказыватьПредставлениеКнопка(Команда)
	
	ПоказыватьПредставление = НЕ ПоказыватьПредставление;
	
	УстановитьВидимостьДоступность();
	
	Если ПоказыватьПредставление Тогда
		
		ПодключитьОбработчикОжидания("УстановитьПредставлениеПоСтроке", 0.2, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредставлениеПоСтроке()
	
	Данные = Элементы.Список.ТекущаяСтрока;
	
	Представление = ПолучитьТабличныйДокументПредставления(Данные)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТабличныйДокументПредставления(График)
	
	Возврат Справочники.вогГрафикиРаботы.ПолучитьПредставлениеПоГрафику(График);

КонецФункции // ПолучитьТабличныйДокументПредставления()

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ФормаПоказыватьПредставлениеКнопка.Пометка = ПоказыватьПредставление;
	Элементы.Представление.Видимость = ПоказыватьПредставление;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьПредставлениеПоСтроке", 0.2, Истина);
	
КонецПроцедуры
