////////////////////////////////////////////////////////////////////////////////
// Менеджер защиты: Система лицензирования отраслевых и специализированных решений.
// Переопределение процедур и функций
// Область выполнения: Сервер
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Для переопределения результатов функции УстановкаПараметровСеанса
// менеджера защиты СЛК.
//
// Параметры:
//	УстановленныеПараметры - Массив имен установленных параметров сеанса
//  ИменаПараметровСеанса - Массив, Неопределено - в массиве имена параметров 
//							сеанса для инициализации.
//                 
Процедура ПереопределитьПараметрыСеанса(УстановленныеПараметры, Знач ИменаПараметровСеанса) Экспорт
	
	// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
	// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
	// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры.
	
	Если ИменаПараметровСеанса = Неопределено Тогда
		// Раздел установки параметров сеанса при начале сеанса (ИменаПараметровСеанса = Неопределено)
		// Выполняется установка параметров сеанса, которые можно инициализировать 
		// при начале работы системы.
		
	КонецЕсли;
	
	// +CRM
	Если ИменаПараметровСеанса.Найти("слкМенеджерЗащиты") <> Неопределено Тогда
		
		СтрокаСерииМодульCRM = CRM_ЛицензированиеСервер.ПолучитьСтрокуСерииКлючейМодульCRM(1);
		
		Если ПараметрыСеанса.слкМенеджерЗащиты = "" Тогда
			ПараметрыСеанса.слкМенеджерЗащиты = СтрокаСерииМодульCRM;
		Иначе
			ПараметрыСеанса.слкМенеджерЗащиты = ПараметрыСеанса.слкМенеджерЗащиты + ";"+СтрокаСерииМодульCRM;
		КонецЕсли;
		Если УстановленныеПараметры.Найти(слкМенеджерЗащиты) = Неопределено Тогда
			УстановленныеПараметры.Добавить("слкМенеджерЗащиты");
		КонецЕсли;
		
	КонецЕсли;
	// -CRM
	
КонецПроцедуры

// Переопределение параметров серий ключей защиты, определенных в конфигураци
// В зависимости от параметра Активные - возвращаются параметры или всех серий или
// доступные по установленным пользователю сеанса ролям
//
// Параметры:
//  СерииКлючейКонфигурации - Соответствие - Соответствие параметров подключения 
//											сериям ключей защиты
//  Активные - Булево - толлько доступные по установленным пользователю сеанса ролям
//
Процедура ПереопределитьСерииКлючейКонфигурации(СерииКлючейКонфигурации, Знач Активные = Истина)	Экспорт

	// Переопределение серий ключей конфигураци
	
	// +CRM
	ТекущийВариантПоставки = CRM_ЛицензированиеСервер.ПолучитьВариантПоставкиПользователя();
	Если ТекущийВариантПоставки = Перечисления.CRM_ВариантыПоставки.СТАРТ Тогда
		СерииКлючейКонфигурации.Удалить("52BA");
		СерииКлючейКонфигурации.Удалить("32D6");
	ИначеЕсли ТекущийВариантПоставки = Перечисления.CRM_ВариантыПоставки.ПРОФ Тогда
		СерииКлючейКонфигурации.Удалить("6ACE");
		СерииКлючейКонфигурации.Удалить("52BA");
	ИначеЕсли ТекущийВариантПоставки = Перечисления.CRM_ВариантыПоставки.КОРП Тогда
		СерииКлючейКонфигурации.Удалить("6ACE");
		СерииКлючейКонфигурации.Удалить("32D6");
	КонецЕсли;
	// -CRM

КонецПроцедуры // ПолучитьСерииКлючейКонфигурации()

// Переопределение параметров подключения серии ключей защиты.
// В зависимости от параметра Активные - возвращаются параметры или всех серий или
// доступные по установленным пользователю сеанса ролям
//
// Параметры:
//	Серия - Строка, Неопределено - Уникальная серия ключей защиты СЛК. Если серия не указана,
//					возращается пустая структура настроек менеджера серии защиты.
//  ПараметрыПодключения  - Структура - Структура параметров подключения.
//							Соответствует структуре, возвращаемой функцией 
//							слкМенеджерЗащитыСервер.СтруктураПараметровПодключенияСерииКлючейЗащиты().
//
Процедура ПереопределитьПараметрыПодключенияСерииКлючейЗащиты(ПараметрыПодключения, Знач Серия)	Экспорт
	
	// Переопределение параметров подключения серии ключей защиты
	
	

КонецПроцедуры // ПереопределитьПараметрыПодключенияСерииКлючейЗащиты()

#КонецОбласти
