//++ VOG Иванов С.А. 29.10.2019 ID заявки: 000000775
&НаКлиенте
Процедура УстановитьВидимостьИДоступность()
	Элементы.Основание.Доступность        = ?(ПодписантДоговора, Истина, Ложь);
	Элементы.Номер.Доступность            = ?(Запись.Основание = ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Доверенности")
																ИЛИ Запись.Основание = ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Приказа"), Истина, Ложь);
	Элементы.ДатаДоверенности.Доступность = ?(Запись.Основание = ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Доверенности")
																ИЛИ Запись.Основание = ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Приказа"), Истина, Ложь);
	Элементы.ПериодДействияС.Доступность  = ?(Запись.Основание = ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Доверенности")
																ИЛИ Запись.Основание = ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Приказа"), Истина, Ложь);
	Элементы.ПериодДействияПо.Доступность = ?(Запись.Основание = ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Доверенности")
																ИЛИ Запись.Основание = ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Приказа"), Истина, Ложь);
	
КонецПРоцедуры

&НаКлиенте
Процедура ЮридическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Запись.КонтактноеЛицо) Тогда
		Возврат;
	КонецЕсли;
	ОкончаниеВыбораЮрЛица = Новый ОписаниеОповещения("ОкончаниеВыбораЮрЛица", ЭтаФорма);
	фиксНастройки = Новый НастройкиКомпоновкиДанных;
	
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	эОтбор.ПравоеЗначение = ПолучитьСписокСвязанныхЮрЛиц();
	эОтбор.Использование = Истина;
	ПараметрыОткрытия = Новый Структура;    
	ПараметрыОткрытия.Вставить("ФиксированныеНастройки", фиксНастройки);
	ОткрытьФорму("Справочник.вогЮридическиеЛица.ФормаВыбора", ПараметрыОткрытия,,,,,ОкончаниеВыбораЮрЛица);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСвязанныхЮрЛиц()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	вогСвязиКонтактныхЛицСрезПоследних.ОбъектСвязи КАК ЮрЛицо
	               |ИЗ
	               |	РегистрСведений.вогСвязиКонтактныхЛиц.СрезПоследних(
	               |			,
	               |			КонтактноеЛицо = &КонтактноеЛицо
	               |				И ТИПЗНАЧЕНИЯ(ОбъектСвязи) = ТИП(Справочник.вогЮридическиеЛица)) КАК вогСвязиКонтактныхЛицСрезПоследних";
	Запрос.УстановитьПараметр("КонтактноеЛицо", Запись.КонтактноеЛицо);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЮрЛицо");	
	
КонецФункции

&НаКлиенте 
Процедура ОкончаниеВыбораЮрЛица(Результат, Параметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Запись.ЮридическоеЛицо = Результат;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	Если Запись.Основание <> ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Доверенности") 
		И Запись.Основание <> ПредопределенноеЗначение("Перечисление.ВариантыОснованийПодписанта.Приказа") Тогда
		Запись.Номер = "";
		Запись.ДатаДокумента = Дата('00010101');
		Запись.ПериодДействияС = Дата('00010101');
		Запись.ПериодДействияПо = Дата('00010101');
	КонецЕсли;
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодписантДоговора = ЯвляетсяПодписантом(); 
КонецПроцедуры

&НаСервере
Функция ЯвляетсяПодписантом()
	
	Если НЕ ЗначениеЗаполнено(Запись.КонтактноеЛицо) ИЛИ не ЗначениеЗаполнено(Запись.ЮридическоеЛицо) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ИСТИНА КАК Подписант
		|ИЗ
		|	РегистрСведений.вогРолиКонтактныхЛиц КАК вогРолиКонтактныхЛиц
		|ГДЕ
		|	(ВЫРАЗИТЬ(вогРолиКонтактныхЛиц.ОбъектСвязи КАК Справочник.вогЮридическиеЛица)) = &ОбъектСвязи
		|			И вогРолиКонтактныхЛиц.КонтактноеЛицо = &КонтактноеЛицо
		|			И вогРолиКонтактныхЛиц.CRM_РольКонтактногоЛица = ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПодписантДоговора)
		|";
	Запрос.УстановитьПараметр("ОбъектСвязи", Запись.ЮридическоеЛицо);
	Запрос.УстановитьПараметр("КонтактноеЛицо", Запись.КонтактноеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ИСТИНА;
	Иначе
		Возврат ЛОЖЬ;
	КонецЕсли;
	
КонецФункции
//-- VOG Иванов С.А. 29.10.2019 ID заявки: 000000775