&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УникальныйИдентификаторВладельца = Параметры.УникальныйИдентификатор;
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.АдресСхемы));
	Если ЭтоАдресВременногоХранилища(Параметры.АдресНастроек) Тогда
		Настройки = ПолучитьИзВременногоХранилища(Параметры.АдресНастроек);
		Если Настройки <> Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	Закрыть(ПолучитьАдресХранилища());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьАдресХранилища()
	
	ЗначениеСохранения = Неопределено;
	
	ЕстьОтметка = Ложь;
	
	Для Каждого стр Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл 
		
		Если стр.Использование Тогда
			ЕстьОтметка = Истина;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОтметка Тогда
		ЗначениеСохранения = КомпоновщикНастроек.ПолучитьНастройки();
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ЗначениеСохранения, УникальныйИдентификаторВладельца);	
	
КонецФункции // ПолучитьАдресХранилища()

#КонецОбласти
