Функция ПолучитьСтруктуруВыполеннойЗадачи(БизнесПроцесс, ТочкаМаршрута) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БизнесПроцесс"	, БизнесПроцесс);
	Запрос.УстановитьПараметр("ТочкаМаршрута"	, ТочкаМаршрута);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	               |	ЗадачаИсполнителя.ДатаИсполнения КАК ДатаИсполнения,
	               |	ЗадачаИсполнителя.РольИсполнителя КАК РольИсполнителя,
	               |	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
	               |	ЗадачаИсполнителя.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации
	               |ИЗ
	               |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |ГДЕ
	               |	ЗадачаИсполнителя.БизнесПроцесс = &БизнесПроцесс
	               |	И ЗадачаИсполнителя.CRM_ТочкаМаршрута = &ТочкаМаршрута
	               |	И ЗадачаИсполнителя.Выполнена
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИсполнения УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Исполнитель, РольИсполнителя, ОсновнойОбъектАдресации", Выборка.Исполнитель, Выборка.РольИсполнителя, ?(ЗначениеЗаполнено(Выборка.ОсновнойОбъектАдресации), Выборка.ОсновнойОбъектАдресации, Неопределено) );		
	КонецЕсли;
	
КонецФункции
