
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
	// Очистим данные рассчитанных значений, 
	// т.к. структура рассчитанных хранимых данных зависит от настроек
	Если Не ДополнительныеСвойства.Свойство("НеОчищатьОбъектыУровня") Тогда
		НаборЗаписей = РегистрыСведений.вогОбъектыУровнейДоступа.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УровеньДоступа.Установить(Ссылка);
		НаборЗаписей.Записать();
		
		вогУправлениеДоступом.СформироватьУровеньДоступа(Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	РегламентноеЗаданиеGUID = "";
КонецПроцедуры

#КонецОбласти

#КонецЕсли