
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначенияЗаполнения") 
	  И (ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")) 
	  И Параметры.ЗначенияЗаполнения.Свойство("ВидДела") Тогда
		Объект.ВидДела = Параметры.ЗначенияЗаполнения.ВидДела;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()


&НаКлиенте
Процедура НастроитьФорму()
	
	Если Объект.вогИспользоватьКлиенты тогда
		Элементы.вогВариантЗаполненияДанныхКлиенты.Доступность = Истина;
	Иначе
		Элементы.вогВариантЗаполненияДанныхКлиенты.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.вогИспользоватьТорговыеТочки тогда
		Элементы.вогВариантЗаполненияДанныхТорговыеТочки.Доступность = Истина;
	Иначе
		Элементы.вогВариантЗаполненияДанныхТорговыеТочки.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.вогИспользоватьПовестка тогда
		Элементы.Содержание.Доступность = Ложь;
		Элементы.Результат.Доступность = Ложь;
	Иначе
		Элементы.Содержание.Доступность = Истина;
		Элементы.Результат.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентыПриИзменении(Элемент)
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура вогИспользоватьТорговыеТочкиПриИзменении(Элемент)
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовесткаПриИзменении(Элемент)
	
	НастроитьФорму();
	
КонецПроцедуры

#КонецОбласти
