// Методы, вызывающие защищенный модуль

// Функция возвращает структур с исходящей точкой.
//
Функция ПолучитьИсходящуюТочку(ТочкаМаршрута, Версия, Вариант = 0) Экспорт
	Возврат вогCRM_БизнесПроцессыОбщегоНазначения.ПолучитьИсходящуюТочку(ТочкаМаршрута, Версия, Вариант);
КонецФункции

// Функция возвращает массив структур с точками маршрута, являющимися следующими относительно переданной точки маршрута.
//
// Параметры:
//	БизнесПроцесс			- ссылка на текущий бизнес-процесс.
//	НачальнаяТочка			- ссылка на точку маршрута, от которой начали следующие точки.
//	ТекущаяТочка			- ссылка на текущую точку маршрута.
//	Маршрут					- таблица значений с маршрутом бизнес-процесса.
//	ВариантВыполнения		- число, вариант выполнения для точек условия или выбора варианта.
//	ТочкаВеткиРазделения	- Структура с первой точкой ветки разделения.
//
// Возвращаемое значение:
//	Результат				- массив структур с исходящими точками маршрута.
//
Функция ПолучитьСледующиеТочкиМаршрута(БизнесПроцесс, НачальнаяТочка, ТекущаяТочка = Неопределено, Маршрут = Неопределено, ВариантВыполнения = 0, ТочкаВеткиРазделения = Неопределено, ИспользоватьОбработчикиТочек = Ложь) Экспорт
	Возврат вогCRM_БизнесПроцессыОбщегоНазначения.ПолучитьСледующиеТочкиМаршрута(БизнесПроцесс, НачальнаяТочка, ТекущаяТочка, Маршрут, ВариантВыполнения, ТочкаВеткиРазделения, ИспользоватьОбработчикиТочек);
КонецФункции

// Функция возвращает массив структур с исходящими точками.
//
Функция ПолучитьИсходящиеТочки(ТочкаМаршрута, Версия) Экспорт
	Возврат вогCRM_БизнесПроцессыОбщегоНазначения.ПолучитьИсходящиеТочки(ТочкаМаршрута, Версия);
КонецФункции

// Функция возвращает список значений с точками старта бизнес-процесса.
//
Функция ПолучитьВариантыСтарта(КартаМаршрута) Экспорт
	Возврат вогCRM_БизнесПроцессыОбщегоНазначения.ПолучитьВариантыСтарта(КартаМаршрута);
КонецФункции

// Процедура устанвливает пометку удаления для точек, у которых нет ни входящих,
// ни исходящих точек, иными словами - не участвуют ни в одной версии карт маршрута.
//
// Параметры:
//	КартаМаршрута	- СправочникСсылка	- Карта маршрута.
//
Процедура УстановитьПометкуУдаленияНеАктуальныхТочек(КартаМаршрута) Экспорт
	вогCRM_БизнесПроцессыОбщегоНазначения.УстановитьПометкуУдаленияНеАктуальныхТочек(КартаМаршрута);
КонецПроцедуры

// Процедура формирует точки маршрута.
//
// Параметры:
//	ТабТочекМаршрута    - ТаблицаЗначений	- Таблица точек маршрута.
//	КартаМаршрута		- СправочникСсылка	- Карта маршрута.
//	НомерНовойВерсии	- Число				- Номер новой версии.
//
Процедура СформироватьТочкиМаршрута(ТабТочекМаршрута, КартаМаршрута, НомерНовойВерсии) Экспорт
	вогCRM_БизнесПроцессыОбщегоНазначения.СформироватьТочкиМаршрута(ТабТочекМаршрута, КартаМаршрута, НомерНовойВерсии);
КонецПроцедуры

// Функция возвращает массив структур с входящими точками.
//
Функция ПолучитьВходящиеТочки(ТочкаМаршрута, Версия) Экспорт
	Возврат вогCRM_БизнесПроцессыОбщегоНазначения.ПолучитьВходящиеТочки(ТочкаМаршрута, Версия);
КонецФункции

// Функция возвращает точку слияния для точки разделения.
//
Функция ПолучитьТочкуСлияния(ТочкаМаршрута, Знач НомерВерсии, ТаблицаПройденныхТочек = Неопределено) Экспорт
	Возврат вогCRM_БизнесПроцессыОбщегоНазначения.ПолучитьТочкуСлияния(ТочкаМаршрута, НомерВерсии, ТаблицаПройденныхТочек);
КонецФункции

// Функция читает графическую схему дерева точек.
//
// Параметры:
//	СхемаМаршрута	- Файл	- Схема маршрута.
//
// Возвращаемое значение:
//	Структура	- Структура графической схемы.
//
Функция ПрочитатьГрафическуюСхемуСформироватьДеревоТочек(СхемаМаршрута, ПутьКВременномуФайлу)Экспорт
	Возврат вогCRM_БизнесПроцессыОбщегоНазначения.ПрочитатьГрафическуюСхемуСформироватьДеревоТочек(СхемаМаршрута, ПутьКВременномуФайлу);
КонецФункции

// Процедура устанавливает признак "Не актуальна для точек, которые не задействованы в текущей версии".
//
//
// Параметры:
//	КартаМаршрута		- СправочникСсылка	- Карта маршрута.
//	КартаМаршрутаВерсия	- Число				- Номер версии карты маршрута.
//
Процедура УстановитьАктуальностьТочекОтносительноПоследнейВерсии(КартаМаршрута, КартаМаршрутаВерсия) Экспорт
	вогCRM_БизнесПроцессыОбщегоНазначения.УстановитьАктуальностьТочекОтносительноПоследнейВерсии(КартаМаршрута, КартаМаршрутаВерсия);
КонецПроцедуры

// Функция возвращает максимальное значение даты из колонки срок в ТЧ "Исполнители" бизнес-процесса или сделки.
//
Функция ПолучитьМаксимальнуюДатуИзКолонкиСрокБизнесПроцесса(Исполнители) Экспорт
	Возврат вогCRM_БизнесПроцессыОбщегоНазначения.ПолучитьМаксимальнуюДатуИзКолонкиСрокБизнесПроцесса(Исполнители);
КонецФункции

// Процедура очищает входящие и исходящие точки.
//
// Параметры:
//	КартаМаршрута		- СправочникСсылка	- Карта маршрута.
//	НомерНовойВерсии	- Число				- Номер новой версии.
//
Процедура ОчиститьВходящиеИсходящиеТочки(КартаМаршрута,НомерНовойВерсии) Экспорт
	вогCRM_БизнесПроцессыОбщегоНазначения.ОчиститьВходящиеИсходящиеТочки(КартаМаршрута,НомерНовойВерсии);
КонецПроцедуры

// Процедура прописывает какой ветке принадлит точка маршрута и какой точкой слияния оканчивается ветка.
//
Процедура УстановитьПринадлежностьТочекВеткамРазделения(КартаМаршрута, КартаМаршрутаВерсия) Экспорт
	вогCRM_БизнесПроцессыОбщегоНазначения.УстановитьПринадлежностьТочекВеткамРазделения(КартаМаршрута, КартаМаршрутаВерсия);
КонецПроцедуры

// Процедура читает маршрут бизнес-процесса.
//
Процедура ПрочитатьМаршрутБизнесПроцесса(БизнесПроцесс, Маршрут = Неопределено) Экспорт
	вогCRM_БизнесПроцессыОбщегоНазначения.ПрочитатьМаршрутБизнесПроцесса(БизнесПроцесс, Маршрут);
КонецПроцедуры

// Процедура проверяет наличие точек разделения и прописывает связь в ТЧ точки.
//
Процедура УстановитьСвязьТочекРазделенияСоСлияниями(КартаМаршрута, КартаМаршрутаВерсия) Экспорт
	вогCRM_БизнесПроцессыОбщегоНазначения.УстановитьСвязьТочекРазделенияСоСлияниями(КартаМаршрута, КартаМаршрутаВерсия);
КонецПроцедуры

// Процедура корректирует маршруты процессов.
//
// Параметры:
//	КартаМаршрута	- СправочникСсылка	- Карта маршрута.
//
Процедура СкорректироватьМаршрутыПроцессов(КартаМаршрута) Экспорт
	вогCRM_БизнесПроцессыОбщегоНазначения.СкорректироватьМаршрутыПроцессов(КартаМаршрута);
КонецПроцедуры
