
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка = Документы.ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.ПустаяСсылка() тогда
		
		// ++ VOG Солодов В.В. 05.03.2021 DEV-218
		Если Параметры.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал Тогда
			
			Объект.СценарийПланирования = Параметры.СценарийПланирования;
			Объект.ПериодПланирования 	= ДобавитьМесяц(НачалоКвартала(ТекущаяДата()), 3);
			
		// ++ VOG Солодов В.В. 13.10.2021 CRM-1254
		// До изменения
		//ИначеЕсли Не РольДоступна("ПолныеПрава") Тогда
		//	
		//	ТекстСообщения = НСтр("ru = 'Запрещено создавать годовое планирование.'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		// -- VOG Солодов В.В. 13.10.2021 CRM-1254
		
		Иначе // -- VOG Солодов В.В. 05.03.2021 DEV-218
			
			// ++ VOG Солодов В.В. 14.10.2021 CRM-1246
			Объект.ПериодПланирования = вогОбщегоНазначенияКлиентСервер.ПолучитьГодПланирования(Истина);
			// До изменения
			//Объект.ПериодПланирования = Дата(Константы.ГодПланированияПлитка.Получить(),1,1);
			// -- VOG Солодов В.В. 14.10.2021 CRM-1246
			Объект.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаГод;
			
		КонецЕсли;
		
		Объект.Автор = Пользователи.ТекущийПользователь();
		
		//+++ Терпогосян Д.Б. [06.08.2021 17:26:29] № DEV-743
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(	ТекущийПользователь, "Подразделение", Истина);
		Объект.Подразделение  = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(	РеквизитыПользователя.Подразделение);
		//--- Терпогосян Д.Б. [06.08.2021 17:26:35] № DEV-743 

	КонецЕсли;
	
	// ++ VOG Солодов В.В. 14.10.2021 CRM-1253
	Если Объект.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаГод Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ПериодПланирования",
			"Доступность",
			Ложь);
		
	КонецЕсли;
	// -- VOG Солодов В.В. 14.10.2021 CRM-1253
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Автор) тогда
		ТекущийОбъект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ВерсияСценария) тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	вогВерсииСценариевПланирования.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вогВерсииСценариевПланирования КАК вогВерсииСценариевПланирования
		|ГДЕ
		|	вогВерсииСценариевПланирования.Владелец = &Владелец
		|	И вогВерсииСценариевПланирования.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Владелец",ТекущийОбъект.СценарийПланирования);
		Запрос.УстановитьПараметр("Наименование","Основная");
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ТекущийОбъект.ВерсияСценария = Выборка.Ссылка;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ПериодПланирования) тогда
		// ++ VOG Солодов В.В. 14.10.2021 CRM-1246
		ТекущийОбъект.ПериодПланирования = вогОбщегоНазначенияКлиентСервер.ПолучитьГодПланирования(Истина);
		// До изменения
		//ТекущийОбъект.ПериодПланирования = Дата(Константы.ГодПланированияПлитка.Получить(),1,1);
		// -- VOG Солодов В.В. 14.10.2021 CRM-1246
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеПланированияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Копирование тогда
		Элементы.ДанныеПланирования.ТекущиеДанные.УИД="";	
	Конецесли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//+++ Терпогосян Д.Б. [06.08.2021 16:52:01] № DEV-743
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//--- Терпогосян Д.Б. [06.08.2021 16:52:07] № DEV-743 
КонецПроцедуры
