#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Получает контакты для документов взаимодействий согласно списку 
//   участников маркетингового мероприятия
//
// Параметры:
//  Ссылка  - СправочникСсылка.МаргетинговыеМероприятие - мероприятие по которому получаются контакты
//
// Возвращаемое значение:
//   Массив   - массив, содержащий контакты
//
Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Результат = Новый Массив;
	Возврат Результат;
	
КонецФункции

#КонецЕсли