#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	
	
// Процедура создает предопределенные элементы справочника.
//
// Параметры:
//	Нет.
Процедура СоздатьЭлементыСправочникаПоУмолчанию() Экспорт
	Родитель	= Справочники.CRM_ВоронкиПродаж.Интересы;
	Выборка		= Справочники.CRM_СостоянияИнтересов.Выбрать(, , , "Код Возр");
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = Справочники.CRM_СостоянияИнтересов.ИнтересПотерян Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементСправочника	= Справочники.CRM_ВоронкиПродаж.НайтиПоНаименованию(Выборка.Наименование);
		Если ЗначениеЗаполнено(ЭлементСправочника) Тогда
			ВоронкаОбъект	= ЭлементСправочника.ПолучитьОбъект();
		Иначе	
			ВоронкаОбъект				= Справочники.CRM_ВоронкиПродаж.СоздатьЭлемент();
			ВоронкаОбъект.Родитель		= Родитель;
			ВоронкаОбъект.Наименование	= Выборка.Наименование;
			НовыйЭтап					= ВоронкаОбъект.Состав.Добавить();
			НовыйЭтап.КартаМаршрута		= НСтр("ru = 'Состояние интереса'");
			НовыйЭтап.ТочкаМаршрута		= Выборка.Ссылка;
		КонецЕсли;
		ВоронкаОбъект.РеквизитДопУпорядочивания	= Выборка.РеквизитДопУпорядочивания;
		ВоронкаОбъект.Оценка					= Выборка.ВероятностьСделки;
		ВоронкаОбъект.ВидЭтапа					= Перечисления.CRM_ВидыЭтаповВоронкиПродаж.ПоСостояниямИнтересов;
		Попытка
			ВоронкаОбъект.Записать();
		Исключение
		КонецПопытки;	
	КонецЦикла;
КонецПроцедуры // СоздатьЭлементыСправочникаПоУмолчанию()

/////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МЕХАНИЗМА ПЕЧАТИ

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, 
	КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Ложь;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПроверкаВоронокПродаж") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПроверкаВоронокПродаж", "Проверка воронок продаж",
			ПечатьЭтаповВоронки(МассивОбъектов, ОбъектыПечати), ОбъектыПечати,
			"Справочник.CRM_ВоронкиПродаж.ПроверкаВоронокПродаж");
	КонецЕсли;
		
КонецПроцедуры

// Процедура печати документа.
//
Функция ПечатьЭтаповВоронки(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	CRM_ТочкиМаршрутов.Владелец КАК КартаМаршрута,
					|	CRM_ТочкиМаршрутов.Ссылка КАК ТочкаМаршрута,
					|	CRM_ТочкиМаршрутов.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
					|	CRM_ТочкиМаршрутов.Вид КАК Вид
					|ПОМЕСТИТЬ
					|	ТочкиМаршрута
					|ИЗ
					|	Справочник.CRM_ТочкиМаршрутов КАК CRM_ТочкиМаршрутов
					|;
					|	
					|ВЫБРАТЬ
					|	CRM_ВоронкиПродажСостав.Ссылка КАК Ссылка,
					|	CRM_ВоронкиПродажСостав.КартаМаршрута КАК КартаМаршрута,
					|	CRM_ВоронкиПродажСостав.ТочкаМаршрута КАК ТочкаМаршрута
					|ПОМЕСТИТЬ
					|	ВоронкиПродажСостав
					|ИЗ
					|	Справочник.CRM_ВоронкиПродаж.Состав КАК CRM_ВоронкиПродажСостав
					|;
					|	
					|ВЫБРАТЬ
					|	
					|	ТочкиМаршрута.КартаМаршрута КАК КартаМаршрута,
					|	ТочкиМаршрута.ТочкаМаршрута КАК ТочкаМаршрута,
					|	ЕСТЬNULL(CRM_ВоронкиПродажСостав.Ссылка, ЗНАЧЕНИЕ(Справочник.CRM_ВоронкиПродаж.ПустаяСсылка)) КАК ВоронкаПродаж,
					|	ТочкиМаршрута.Вид
					|ИЗ
					|		ТочкиМаршрута
					|		ПОЛНОЕ СОЕДИНЕНИЕ ВоронкиПродажСостав КАК CRM_ВоронкиПродажСостав
					|		ПО ТочкиМаршрута.КартаМаршрута = CRM_ВоронкиПродажСостав.КартаМаршрута
					|			И ТочкиМаршрута.ТочкаМаршрута = CRM_ВоронкиПродажСостав.ТочкаМаршрута
					|ГДЕ
					|	(ТочкиМаршрута.ТочкаМаршрута.Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыТочекМаршрута.Действие)
					|			ИЛИ ТочкиМаршрута.ТочкаМаршрута.Вид = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыТочекМаршрута.Старт))
					|
					|УПОРЯДОЧИТЬ ПО
					|	ТочкиМаршрута.КартаМаршрута.Наименование,
					|	ТочкиМаршрута.РеквизитДопУпорядочивания";
	ТаблицаСостава = Запрос.Выполнить().Выгрузить();
	
 	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВоронкаПродаж";
	Макет = ПолучитьМакет("ПроверкаВоронокПродаж");
	// Шапка
	Секция = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(Секция);
	
	ТекущаяКарта = Неопределено;
	ТекущаяТочка = Неопределено;
	Секция		 = Неопределено;
	Для Каждого СтрокаТаблицы Из ТаблицаСостава Цикл
		Если НЕ (ТекущаяКарта = СтрокаТаблицы.КартаМаршрута) Тогда
			ТекущаяКарта = СтрокаТаблицы.КартаМаршрута;
			Секция = Макет.ПолучитьОбласть("Карта");
			Секция.Параметры.КартаМаршрута	= ТекущаяКарта;
			ТабДокумент.Вывести(Секция);
			Секция = Неопределено;
		КонецЕсли;
		Если ТекущаяТочка = СтрокаТаблицы.ТочкаМаршрута Тогда
			Секция.Параметры.ВоронкаПродаж = Секция.Параметры.ВоронкаПродаж + ", " + Строка(СтрокаТаблицы.ВоронкаПродаж);
		Иначе	
			ТекущаяТочка = СтрокаТаблицы.ТочкаМаршрута;
			Секция = Макет.ПолучитьОбласть("Точка");
			Секция.Параметры.ТочкаМаршрута	= ТекущаяТочка;
			ТабДокумент.Вывести(Секция);
			Секция = Макет.ПолучитьОбласть("Воронка");
			Если ЗначениеЗаполнено(СтрокаТаблицы.ВоронкаПродаж) Тогда
				Секция.Параметры.ВоронкаПродаж	= Строка(СтрокаТаблицы.ВоронкаПродаж);
			Иначе	
				Секция.Области.Воронка.ЦветФона = WebЦвета.Розовый;
			КонецЕсли;	
		    ТабДокумент.Присоединить(Секция);
		КонецЕсли;
	КонецЦикла;
	
	ОбъектыПечати.Добавить(МассивОбъектов[0].Ссылка, "Справочник_1");
	НомерСтрокиОкончание = ТабДокумент.ВысотаТаблицы;
	ТабДокумент.Область(1, , НомерСтрокиОкончание, ).Имя = "Справочник_1";
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;

КонецФункции

#КонецЕсли

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("ЗначениеКопирования") Тогда
			Если ТипЗнч(Параметры.ЗначениеКопирования) = Тип("СправочникСсылка.CRM_ВоронкиПродаж") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования.Родитель) Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ФормаЭлементаСостав";
			КонецЕсли;
				
		ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") Тогда
			Если ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") И Параметры.ЗначенияЗаполнения.Свойство("Родитель") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Родитель) Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ФормаЭлементаСостав";
			КонецЕсли;
			
		ИначеЕсли Параметры.Свойство("Ключ") Тогда
			Если Параметры.Ключ.Предопределенный Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ФормаЭлемента";
			ИначеЕсли ТипЗнч(Параметры.Ключ) = Тип("СправочникСсылка.CRM_ВоронкиПродаж") И ЗначениеЗаполнено(Параметры.Ключ.Родитель) Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ФормаЭлементаСостав";
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

