// +++ VOG Кулаков П.Л. 26.03.2021
Функция ПолучитьПодразделениеТорговойТочки(ТорговаяТочка, НаправлениеДеятельности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияТорговыхТочек.ТорговаяТочка КАК ТорговаяТочка,
		|	ПодразделенияТорговыхТочек.Направление КАК Направление,
		|	ПодразделенияТорговыхТочек.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.ПодразделенияТорговыхТочек КАК ПодразделенияТорговыхТочек
		|ГДЕ
		|	ПодразделенияТорговыхТочек.ТорговаяТочка = &ТорговаяТочка
		|	И ПодразделенияТорговыхТочек.Направление = &Направление
		|	И (ПодразделенияТорговыхТочек.ЕстьБрендМенеджер
		|				И НЕ ПодразделенияТорговыхТочек.БрендМенеджер
		|			ИЛИ НЕ ПодразделенияТорговыхТочек.ЕстьБрендМенеджер
		|				И НЕ ПодразделенияТорговыхТочек.БрендМенеджер)";
	
	Запрос.УстановитьПараметр("Направление", НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ТорговаяТочка", ТорговаяТочка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Подразделение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // --- VOG Кулаков П.Л.