
&НаКлиенте
Процедура Заполнить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнениеЗавершение",ЭтаФорма);
	
	ОткрытьФорму("Документ.ВводПлановПродаж.Форма.ФормаЗагрузкиДанные",,,,,,Оповещение);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнениеЗавершение(Параметр,ДопПараметр) экспорт
	
	ЗагрузитьНаСервере(Параметр);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(АдресХ)
	
	Попытка
		ТЗ = ПолучитьИзВременногоХранилища(АдресХ);
		УдалитьИзВременногоХранилища(АдресХ);
	Исключение
		Возврат;
	КонецПопытки;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	вогДизайныНоменклатуры.Бренд КАК Бренд,
	               |	вогДизайныНоменклатуры.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	               |ИЗ
	               |	Справочник.вогДизайныНоменклатуры КАК вогДизайныНоменклатуры";
	тзБрендНоменклатурнаяГруппа = Запрос.Выполнить().Выгрузить();
	
	Объект.План.Очистить();
	Для каждого Строка из ТЗ цикл
		Для СчетчикМесяца = 1 по 12 цикл
			СтрокаПлана = Объект.План.Добавить();	
			ЗаполнитьЗначенияСвойств(Строкаплана,Строка);	
			СтрокаПлана.Подразделение = Строка.Филиал;
			СтрокаПлана.ТорговаяТочка = Строка.ТТ;
			СтрокаПлана.Количество = Строка["Количество"+СчетчикМесяца];	
			СтрокаПлана.Сумма = Строка["Сумма"+СчетчикМесяца];	
			СтрокаПлана.НДС = Строка["НДС"+СчетчикМесяца];	
			СтрокаПлана.Период = ДобавитьМесяц(Строка.началоПериода,СчетчикМесяца-1);	
			Если НЕ ЗначениеЗаполнено(СтрокаПлана.Бренд) и ЗначениеЗаполнено(СтрокаПлана.НоменклатурнаяГруппа) тогда
				СтрокаТЗ = тзБрендНоменклатурнаяГруппа.Найти(СтрокаПлана.НоменклатурнаяГруппа);
				Если СтрокаТЗ<>Неопределено тогда
					СтрокаПлана.Бренд = СтрокаТЗ.Бренд;	
				КонецЕсли;
			КонецЕсли;
			Если Строка.ДанныеЗаОдинПериод тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры