
&НаКлиенте
Процедура МесяцРостаЦеныНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора,ЗапрашиватьРежимВыбораПериодаУВладельца","Месяц",Ложь);
	ОткрытьФорму("ОбщаяФорма.вогВыборПериода"
			,ПараметрыФормы
			,ЭтаФорма
			,
			,
			,
			, Новый ОписаниеОповещения("МесяцРостаЦеныНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРостаЦеныНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Запись.МесяцРостаЦены = Результат;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура МесяцРостаЦеныПриИзменении(Элемент)
	
	Запись.МесяцРостаЦены = НачалоМесяца(Запись.МесяцРостаЦены);
	
КонецПроцедуры

