
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Если СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Город
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.НаселенныйПункт
		               |	КОНЕЦ КАК Город,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.КоличествоПолок КАК КоличествоПолок1,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Оборот КАК ОборотСПолки1,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.КоличествоПолок * ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Оборот * (3 - ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.МесяцДостиженияЦели + МЕСЯЦ(ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ПериодПланирования)) КАК План1,
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.УИД
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка
		               |	КОНЕЦ КАК ТорговаяТочка,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.Дата КАК Период,
		               // +++ VOG Кулаков П.Л. 13.04.2021 DEV-383
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Менеджер КАК Автор,
					   // --- VOG Кулаков П.Л.
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.СценарийПланирования КАК Сценарий,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ВерсияСценария КАК Версия,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ПериодПланирования КАК ПериодПланирования,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.МесяцДостиженияЦели КАК Месяц,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ВидТТ КАК ВидПотенциальнойТорговойТочки,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Комментарий КАК Комментарий,
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка ССЫЛКА Справочник.вогТорговыеТочки
		               |				И ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка <> ЗНАЧЕНИЕ(Справочник.вогТорговыеТочки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.Партнер
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Клиент
		               |	КОНЕЦ КАК Клиент
		               |ИЗ
		               |	Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамОбои.ДанныеПланирования КАК ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования
		               |ГДЕ
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Город
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.НаселенныйПункт
		               |	КОНЕЦ КАК Город,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.КоличествоПолок КАК КоличествоПолок1,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Оборот КАК ОборотСПолки1,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.КоличествоПолок * ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Оборот * (13 - ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.МесяцДостиженияЦели) КАК План1,
		               |	ВЫБОР
		               |		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
		               |			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.УИД
		               |		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка
		               |	КОНЕЦ КАК ТорговаяТочка,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.Дата КАК Период,
					   // +++ VOG Кулаков П.Л. 13.04.2021 DEV-383
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Менеджер КАК Автор,
					   // --- VOG Кулаков П.Л.
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.СценарийПланирования КАК Сценарий,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ВерсияСценария КАК Версия,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ПериодПланирования КАК ПериодПланирования,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.МесяцДостиженияЦели КАК Месяц,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ВидТТ КАК ВидПотенциальнойТорговойТочки,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Комментарий КАК Комментарий,
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Клиент КАК Клиент
		               |ИЗ
		               |	Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамОбои.ДанныеПланирования КАК ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования
		               |ГДЕ
		               |	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка = &Ссылка";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Движения.ДанныеПланированияПродажОбои.Загрузить(Запрос.Выполнить().Выгрузить());
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Запись из Движения.ДанныеПланированияПродажОбои цикл
		
		// +++ VOG Кулаков П.Л. 13.04.2021 DEV-383
		Если Запись.Автор = Справочники.Пользователи.ПустаяСсылка() Тогда
			Запись.Автор = Автор;
		КонецЕсли;
		// --- VOG Кулаков П.Л.
		
		// +++ VOG Кулаков П.Л. 26.03.2021
		Запись.Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Запись.Автор.Подразделение);
		
		Если ЗначениеЗаполнено(Запись.ТорговаяТочка) Тогда
			ПодразделениеТорговойТочки = РегистрыСведений.ПодразделенияТорговыхТочек.ПолучитьПодразделениеТорговойТочки(Запись.ТорговаяТочка,Справочники.НаправленияДеятельности.Обои);
			Если ПодразделениеТорговойТочки <> Неопределено Тогда
				МенеджерТорговойТочки = РегистрыСведений.вогМенеджерыОбъектов.ПолучитьМенеджераТорговойТочки(Запись.ТорговаяТочка,ПодразделениеТорговойТочки,Справочники.НаправленияДеятельности.Обои);
				Если МенеджерТорговойТочки <> Неопределено Тогда
					Запись.Автор = МенеджерТорговойТочки;
					Запись.Подразделение = ПодразделениеТорговойТочки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// --- VOG Кулаков П.Л.
		
	КонецЦикла;
	
	Движения.ДанныеПланированияПродажОбои.Записывать=Истина;
	
	// +++ VOG Кулаков П.Л. 19.03.2021
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Обои) КАК НаправлениеДеятельности,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.СценарийПланирования КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
	|			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Город
	|		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.НаселенныйПункт
	|	КОНЕЦ КАК Регион,
	|	ВЫБОР
	|		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.вогТорговыеточки.)
	|			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.УИД
	|		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка
	|	КОНЕЦ КАК ТорговаяТочка,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ВидТТ КАК ВидПотенциальнойТТ,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка ССЫЛКА Справочник.вогТорговыеТочки
	|				И ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка <> ЗНАЧЕНИЕ(Справочник.вогТорговыеТочки.)
	|			ТОГДА ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.ТорговаяТочка.Партнер
	|		ИНАЧЕ ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Клиент
	|	КОНЕЦ КАК Клиент,
	// +++ VOG Кулаков П.Л. 09.06.2021 DEV-605
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ВерсияСценария КАК ВерсияСценария,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка.ПериодПланирования КАК ПериодПланирования
	// --- VOG Кулаков П.Л.
	|ИЗ
	|	Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамОбои.ДанныеПланирования КАК ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования
	|ГДЕ
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамОбоиДанныеПланирования.Ссылка = &Ссылка";
	
	Движения.КомментарииКПланированиюПродажПлитка.Загрузить(Запрос.Выполнить().Выгрузить());
	// +++ VOG Кулаков П.Л. 09.06.2021 DEV-605
	Для Каждого Запись из Движения.КомментарииКПланированиюПродажПлитка цикл
		Запись.Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Автор.Подразделение);
		
		Если ЗначениеЗаполнено(Запись.ТорговаяТочка) Тогда
			ПодразделениеТорговойТочки = РегистрыСведений.ПодразделенияТорговыхТочек.ПолучитьПодразделениеТорговойТочки(Запись.ТорговаяТочка,Справочники.НаправленияДеятельности.Обои);
			Если ПодразделениеТорговойТочки <> Неопределено Тогда
				МенеджерТорговойТочки = РегистрыСведений.вогМенеджерыОбъектов.ПолучитьМенеджераТорговойТочки(Запись.ТорговаяТочка,ПодразделениеТорговойТочки,Справочники.НаправленияДеятельности.Обои);
				Если МенеджерТорговойТочки <> Неопределено Тогда
					Запись.Подразделение = ПодразделениеТорговойТочки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// --- VOG Кулаков П.Л.
	Движения.КомментарииКПланированиюПродажПлитка.Записывать = Истина;
	
	// --- VOG Кулаков П.Л.
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка из ДанныеПланирования цикл
		Если Строка.УИД="" тогда
			Строка.УИД = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	
	Для каждого Строка из ДанныеПланирования цикл
		
		Если строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.Магазин_Палитра_ваших_стен или строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.Магазин_Палитра_Плюс или
			строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.Новый_магазин_клиента_без_бренд_зоны тогда
			Если НЕ ЗначениеЗаполнено(Строка.Город) тогда
				Отказ = Истина;
				Сообщить("В строке " + Строка.НомерСтроки + " не указан город");
			КонецЕсли;
		КонецЕсли;
		Если строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.НоваяБрендЗонаВСуществующейТТ и Не ЗначениеЗаполнено(Строка.ТорговаяТочка) тогда
			Отказ = Истина;
			Сообщить("В строке " + Строка.НомерСтроки + " не указана торговая точка");
		КонецЕсли;
		Если строка.ВидТТ = Перечисления.ВидыПотенциальнойТорговойТочки.Новый_магазин_клиента_без_бренд_зоны и Не ЗначениеЗаполнено(Строка.Клиент) тогда
			Отказ = Истина;
			Сообщить("В строке " + Строка.НомерСтроки + " не указан клиент");
		КонецЕсли;
		
		Если СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал тогда
			Если Строка.МесяцДостиженияЦели > (Месяц(ПериодПланирования)+2) тогда
				Отказ = Истина;
				Сообщить("В строке " + Строка.НомерСтроки + " выбран не верный месяц");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Для каждого Строка из ДанныеПланирования цикл
		Строка.УИД = "";	
	КонецЦикла;
	
КонецПроцедуры
