#Область ПрограммныйИнтерфейс

Функция ИнтернетПочтаПолучитьСообщенияССервера(Соединение, ПараметрыЗагрузки, АвтоматическиУдалятьСообщенияПриВыбореССервера, ЗаголовкиИдентификаторы, НаборСообщенийДляУдаления) Экспорт
	
	Если ПараметрыЗагрузки.Свойство("УведомленияОтGoogle") Тогда
		НаборПисем = Соединение.Выбрать(АвтоматическиУдалятьСообщенияПриВыбореССервера, ЗаголовкиИдентификаторы);
		Для Каждого ЭлементНабора Из НаборПисем Цикл
			Если ЭлементНабора.Отправитель.Адрес = "noreply@pushservice.rarus.ru" Тогда
				НаборСообщенийДляУдаления.Добавить(ЭлементНабора.Идентификатор[0]);
			КонецЕсли;
		КонецЦикла;
	Иначе
		НаборПисем = Соединение.Выбрать(АвтоматическиУдалятьСообщенияПриВыбореССервера, ЗаголовкиИдентификаторы);
	КонецЕсли;
	Возврат НаборПисем;
	
КонецФункции

#КонецОбласти
