#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// ++ VOG Солодов В.В. 13.09.2019 
	Если Не Отказ И ТипЗнч(Владелец) = Тип("СправочникСсылка.вогЮридическиеЛица") Тогда
			
		ОписаниеСтатуса = вогОбщегоНазначения.ПолучитьОписаниеСтатусаСогласованияОбъекта(Владелец);
		
		Если ОписаниеСтатуса.Статус = Перечисления.вогСтатусыСогласования.Согласован Тогда
			вогИнтеграцияСУчетнойСистемой.ЗарегистрироватьДанныеКОтправкеВУчетнуюСистему(Владелец, Ложь, Ложь, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	// -- VOG Солодов В.В. 13.09.2019

КонецПроцедуры	

#КонецОбласти

#КонецЕсли

