
////////////////////////////////////////////////////////////////////////////////
#Область ПЕРЕМЕННЫЕ_ОДУЛЯ

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ЭКСПОРТНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.УникальныйИдентификатор) ИЛИ ЗначениеЗаполнено(ЭтаФорма.Параметры.ЗначениеКопирования.УникальныйИдентификатор) Тогда
		Запись.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;

	ЗаполнитьСписокВыбораИсточника();
	
	ЗаполнитьАдресаКартинокКоманд();
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ДЕЙСТВИЯ_КОМАНДНЫХ_ПАНЕЛЕЙ_ФОРМЫ

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Описание = Новый ОписаниеОповещения("ОписаниеОповещенияВыборКартинкиИзСписка", ЭтотОбъект);
	
	СписокКартинок = ПолучитьСписокВыбораКартинок();
	
	Если ЗначениеЗаполнено(Запись.ИмяКартинки) Тогда
		ТекЭлемент = СписокКартинок.НайтиПоЗначению(Запись.ИмяКартинки);
	КонецЕсли;
	
	ПоказатьВыборИзСписка(Описание, СписокКартинок, , ТекЭлемент);
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ОБРАБОТЧИКИ_СОБЫТИЙ_ТАБЛИЧНОГО_ПОЛЯ__

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ОПЕРАТОРЫ_ОСНОВНОЙ_ПРОГРАММЫ

Процедура ЗаполнитьСписокВыбораИсточника() 
	
	Элементы.Источник.СписокВыбора.Добавить(Неопределено, "Не указано");
	
	Для Каждого стр из Метаданные.ОпределяемыеТипы.вогИсточникДополнительныхКомандФормы.Тип.Типы() Цикл 
		
		МассивТек = Новый Массив;
		МассивТек.Добавить(стр);
		
		Описание = Новый ОписаниеТипов(МассивТек);
		
		ПустаяСсылка = Описание.ПривестиЗначение(Неопределено);
		
		Элементы.Источник.СписокВыбора.Добавить(ПустаяСсылка, СокрЛП(стр));
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыОткрытия = Новый Структура("ТекстОбработки, Заголовок", Запись.Обработчик, "Обработчик команды "+""""+Строка(Запись.ИмяКоманды)+"""");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикВыборЗавершение", ЭтотОбъект, Элемент);
	
	ОткрытьФорму("Справочник.CRM_ТочкиМаршрутов.Форма.ФормаРедактированияТекста", ПараметрыФормыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
				

КонецПроцедуры

#Область Оповещения

&НаКлиенте
Процедура ОбработчикВыборЗавершение(Результат, Элемент) Экспорт
	
	Если Не Результат = Неопределено Тогда
		Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Результат.Свойство("Обработчик", Запись.Обработчик);
		Иначе 
			Запись.Обработчик = Результат;
		КонецЕсли;		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // КомандыВопросаВыборЗавершение()

&НаКлиенте
Процедура ОписаниеОповещенияВыборКартинкиИзСписка(Значение, Доп) Экспорт 
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись.ИмяКартинки = Значение.Значение;
	
	ЗаполнитьАдресКартинки();
	
	Модифицированность = Истина;
	
КонецПроцедуры // ОписаниеОтветаНаВопросГиперссылки()

Процедура ЗаполнитьАдресаКартинокКоманд()
	
	ЗаполнитьАдресКартинки();
	
КонецПроцедуры

Процедура ЗаполнитьАдресКартинки()

	Если ЗначениеЗаполнено(Запись.ИмяКартинки) Тогда
		Картинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок[Запись.ИмяКартинки], ЭтаФорма.УникальныйИдентификатор);
	Иначе 
		Картинка = "Нет";
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокВыбораКартинок()
	
	Возврат вогУправлениеОпросамиСервер.ПолучитьСписокВыбораКартинок();
	
КонецФункции

#КонецОбласти

#КонецОбласти