#Область ПрограммныйИнтерфейс

Функция ВсеМенеджерыЛогическихХранилищ() Экспорт
	
	Возврат ПередачаДанныхПовтИсп.МенеджерыЛогическихХранилищ();
	
КонецФункции

Функция ВсеМенеджерыФизическихХранилищ() Экспорт
	
	Возврат ПередачаДанныхПовтИсп.МенеджерыФизическихХранилищ();
	
КонецФункции

Функция Получить(ПараметрыДоступа, Идентификатор) Экспорт
	
	Возврат ПередачаДанныхСлужебный.Получить(ПараметрыДоступа, Идентификатор);
	
КонецФункции

Функция Отправить(ПараметрыДоступа, Данные, Знач ИмяФайла) Экспорт
	
	Возврат ПередачаДанныхСлужебный.Отправить(ПараметрыДоступа, Данные, ИмяФайла);
	
КонецФункции

#КонецОбласти