
// Процедура формирует представление.
//
// Параметры:
//	Нет.
//
&НаКлиенте
Процедура СформироватьПредставление()
	Элементы.Представление.Заголовок = "+" + Объект.CRM_КодСтраны + " (" + Объект.CRM_КодГорода + ")";	
КонецПроцедуры	// СформироватьПредставление()

// Процедура-обработчик события "ПриИзменении" поля ввода "CRM_КодСтраны".
//
&НаКлиенте
Процедура CRM_КодСтраныПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.CRM_КодСтраны) Тогда Возврат; КонецЕсли;
	СформироватьПредставление();
КонецПроцедуры // CRM_КодСтраныПриИзменении()

// Процедура-обработчик события "ПриИзменении" поля ввода "CRM_КодГорода".
//
&НаКлиенте
Процедура CRM_КодГородаПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры // CRM_КодГородаПриИзменении()

// Процедура-обработчик события "ПриСозданииНаСервере"
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.CRM_КодСтраны = "7";
		Объект.CRM_Платежеспособность = Перечисления.CRM_Платежеспособность.Средняя;
	КонецЕсли;
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура-обработчик события "ПриОткрытии"
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьПредставление();
КонецПроцедуры // ПриОткрытии()

