
&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЭтаФорма.ТолькоПросмотр = Объект.Предопределенный;
	
	//Элементы.Наименование.ТолькоПросмотр = Истина;
	КоманднаяПанель.ТолькоПросмотр = Истина;
	//Элементы.ВероятностьСделки.ТолькоПросмотр = Истина;
	Элементы.Завершено.ТолькоПросмотр  = Истина;
	ЕстьПолныеПрава = Пользователи.РолиДоступны("ПолныеПрава");
	Элементы.УказаниеОжидаемойВыручки.ТолькоПросмотр = НЕ ЕстьПолныеПрава;
	Элементы.ВидДела.ТолькоПросмотр = Не ЕстьПолныеПрава;
	
КонецПроцедуры // ПриСозданииНаСервере()
