
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьОтчетWebService(ПараметрыВыполнения,РезультатВыполненеия) Экспорт
	
	ОтчетОбъект 		= Отчеты.вогКарточкаРасчетовСКлиентом.Создать();
	ЗаполнитьЗначенияСвойств(ОтчетОбъект,ПараметрыВыполнения.ПараметрыОтчета);
	
	ПараметрыОтчета  	= Новый Структура;
	ПараметрыОтчета.Вставить("ПериодОтчета", ПараметрыВыполнения.ПараметрыОтчета.ПериодОтчета);
	
	ПараметрыВыполнения.ДокументРезультат.Очистить();
	
	Результат 			= Новый Структура("ТабличныйДокумент,Расшифровка,Успех,ТекстОшибки");
	
	Попытка
		вогИнтеграцияСУчетнойСистемой.СформироватьВнешнийОтчет(ОтчетОбъект,ПараметрыОтчета
														,ПараметрыВыполнения.ДокументРезультат,ПараметрыВыполнения.ДанныеРасшифровки,Истина);
		Результат.ТабличныйДокумент = ПараметрыВыполнения.ДокументРезультат;
		Результат.Расшифровка 		= ПараметрыВыполнения.ДанныеРасшифровки;
		Результат.Успех				= Истина;
	Исключение
		Результат.ТекстОшибки 		= ОписаниеОшибки();
		Результат.Успех 			= Ложь;
	КонецПопытки;
	
	ПоместитьВоВременноеХранилище(Результат,РезультатВыполненеия);
	
															
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли
