#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыОтчета  = Новый Структура;
	ПараметрыОтчета.Вставить("ПериодОтчета", ПериодОтчета);
	
	вогИнтеграцияСУчетнойСистемой.СформироватьВнешнийОтчет(
		ЭтотОбъект,
		ПараметрыОтчета,
		ДокументРезультат, 
		ДанныеРасшифровки, 
		СтандартнаяОбработка
	);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли