
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//Связи
	Если ДополнительныеСвойства.Свойство("ТорговыеТочкиСвязи") Тогда
		вогУправлениеСвязями.УстановитьСвязиОбъекта(ДополнительныеСвойства.ТорговыеТочкиСвязи, Ссылка);
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ЮрЛицоСвязи") Тогда
		вогУправлениеСвязями.УстановитьСвязьОбъекта(ДополнительныеСвойства.ЮрЛицоСвязи, Ссылка);
	КонецЕсли;
	
	//Кайдашов CRM-1027 23/11/2020
	МЗ = РегистрыСведений.ОбъектыСИзмененнымМесторасположением.СоздатьМенеджерЗаписи();
	МЗ.Объект = Ссылка;
	МЗ.Записать();
	
	
КонецПроцедуры
