
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидОтображения");
	РеквзитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, СтруктураРеквизитов);
	
	Если РеквзитыВладельца.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ДополнительныйРеквизит Тогда
		ПроверяемыеРеквизиты.Добавить("ДополнительныйРеквизит");
	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	//Очистим значения данных СКД
	РеквзитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "СпособФормирования,ВидОтображения");
	Если РеквзитыВладельца.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную Тогда
		СхемаКомпоновкиДанных = Неопределено;
		ХранилищеНастроекКомпоновкиДанных = Неопределено; 	
	
	КонецЕсли;	
	
	Если Не РеквзитыВладельца.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ДополнительныйРеквизит Тогда
		ДополнительныйРеквизит = Неопределено;
	
	КонецЕсли;	
	
	// ++ VOG Солодов В.В. 18.07.2019 task 425
	// Обновим элементы справочника НаборыДополнительныхРеквизитовИСведений
	ИмяВладельца 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Наименование");
	НачалоНаименования 	= ИмяВладельца + "_";
	вогУправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭтотОбъект, "Справочник_CRM_ЗначенияКлассификаторов",, НачалоНаименования);
	// -- VOG Солодов В.В. 18.07.2019
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИнициализироватьСправочник();
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьСправочник()

	Ответственный = Пользователи.ТекущийПользователь();	

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли