
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивТиповОтношений = Новый Массив();
	МассивТиповОтношений.Добавить(Справочники.CRM_ТипыОтношений.Поставщик);
	НовыеЗначения 		= Новый ФиксированныйМассив(МассивТиповОтношений);
	НовыйПараметр 		= Новый ПараметрВыбора("Отбор.ТипОтношений", НовыеЗначения);
	МассивПараметров 	= Новый Массив();
	МассивПараметров.Добавить(НовыйПараметр);
	НовыеПараметры 		= Новый ФиксированныйМассив(МассивПараметров);

	Элементы.Производитель.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

#КонецОбласти