
&НаКлиенте
Процедура Обои(Команда)
	
	ОбновитьЦветКоманд(Команда.Имя);
	Элементы.ГруппаСпискиНоменклатуры.ТекущаяСтраница = Элементы.Обои;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦветКоманд(ИмяКоманды)
	
	// +++ VOG Кулаков П.Л. 13.10.2020 CRM-969
	//Убираем изменение цвета гиперссылок на нажатие кнопок
	Для каждого ЭлемКоманды Из Элементы.КомандыПанель.ПодчиненныеЭлементы Цикл
		Если ИмяКоманды = ЭлемКоманды.ИмяКоманды Тогда
			ЭлемКоманды.Пометка = Истина;
			//ЭлемКоманды.ЦветТекста 		= Новый Цвет(128,0,128);
			//ЭлемКоманды.Шрифт 			= Новый Шрифт(,10,Ложь,,Истина);
		Иначе
			ЭлемКоманды.Пометка = Ложь;
			//ЭлемКоманды.ЦветТекста	 	= Новый Цвет(28,85,174);
			//ЭлемКоманды.Шрифт		 		= Новый Шрифт(,10,Ложь,,Ложь);
		КонецЕсли;
	КонецЦикла;
	// --- VOG Кулаков П.Л.
	
КонецПроцедуры	

&НаСервере
Процедура ПлиткаНаСервере()
	
	Элементы.ГруппаСпискиНоменклатуры.ТекущаяСтраница = Элементы.Плитка;
	
КонецПроцедуры

&НаКлиенте
Процедура Плитка(Команда)
	ПлиткаНаСервере();
	ОбновитьЦветКоманд(Команда.Имя);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	НаправлениеДеятельности_у_ТекущегоПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь,"CRM_НаправлениеДеятельности");
	Если ЗначениеЗаполнено(НаправлениеДеятельности_у_ТекущегоПользователя) тогда
		Элементы.КомандыПанель.Видимость = ЛожЬ;
		Если НаправлениеДеятельности_у_ТекущегоПользователя = Справочники.НаправленияДеятельности.Плитка тогда
			Элементы.ГруппаСпискиНоменклатуры.ТекущаяСтраница = Элементы.Плитка;
		ИначеЕсли НаправлениеДеятельности_у_ТекущегоПользователя = Справочники.НаправленияДеятельности.Обои тогда
			Элементы.ГруппаСпискиНоменклатуры.ТекущаяСтраница = Элементы.Обои;
		КонецЕсли;
		
	КонецЕсли;
	
	//+Рабочий стол
	скРабочийСтолСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ);
	//-Рабочий стол
	
	// +++ VOG Кулаков П.Л. 07.09.2020 Виджеты
	Если Параметры.Свойство("НаправлениеДеятельности") Тогда
		Если Параметры.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Плитка Тогда
			Элементы.ГруппаСпискиНоменклатуры.ТекущаяСтраница = Элементы.Плитка;
		ИначеЕсли Параметры.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Обои Тогда
			Элементы.ГруппаСпискиНоменклатуры.ТекущаяСтраница = Элементы.Обои;
		КонецЕсли;
	КонецЕсли;
	// --- VOG Кулаков П.Л.
	
	ПолучитьСписокНастроекДинамическогоСпискаНаСервере(); //VOG Ульянов И.В. CRM-905

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЦветКоманд("Плитка");	
	
КонецПроцедуры




#Область Подключаемый_РабочийСтол
	
&НаКлиенте
Процедура Подключаемый_скТумблерРабочегоСтолаПриИзменении(Элемент)
	скРабочийСтолКлиент.ТумблерРабочегоСтолаПриИзменении(ЭтаФорма, Элемент);
КонецПроцедуры // Подключаемый_скТумблерРабочегоСтолаПриИзменении()

&НаКлиенте
Процедура Подключаемый_ОбработкаГипперссылкиДействийНажатие(Элемент)
	скРабочийСтолКлиент.ОбработкаГипперссылкиДействийНажатие(ЭтаФорма, Элемент);	
КонецПроцедуры // Подключаемый_ИндикаторНапоминанийНажатие()

&НаКлиенте
Процедура Подключаемый_ОбновитьТаблицуНапоминаний(МассивНапоминаний = Неопределено) Экспорт
	скРабочийСтолКлиент.ОбновитьТаблицуНапоминаний(ЭтаФорма, МассивНапоминаний);
КонецПроцедуры // Подключаемый_ОбновитьТаблицуНапоминаний()

&НаКлиенте
Процедура Подключаемый_НапоминанияСкрытьНажатие(Элемент)
	скРабочийСтолКлиент.СкрытьНапоминания(ЭтаФорма);	
КонецПроцедуры // Подключаемый_НапоминанияСкрытьНажатие()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLНапоминанийПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	скРабочийСтолКлиент.ПолеHTMLНапоминанийПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLНапоминанийПриНажатии()

&НаКлиенте
Процедура Подключаемый_КомандаНапоминанийПрекратитьВсе(Команда)
	скРабочийСтолКлиент.КомандаНапоминанийПрекратитьВсе(ЭтаФорма, Команда);
КонецПроцедуры // Подключаемый_КомандаНапоминанийПрекратитьВсе()

&НаКлиенте
Процедура Подключаемый_КомандаНапоминанийПеренестиВсе(Команда)
	скРабочийСтолКлиент.КомандаНапоминанийПеренестиВсе(ЭтаФорма, Команда);
КонецПроцедуры // Подключаемый_КомандаНапоминанийПрекратитьВсе()

&НаКлиенте
Процедура Подключаемый_ЗаметкиСкрытьНажатие(Элемент)
	скРабочийСтолКлиент.СкрытьЗаметки(ЭтаФорма);	
КонецПроцедуры // Подключаемый_ЗаметкиСкрытьНажатие()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLЗаметокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	скРабочийСтолКлиент.ПолеHTMLЗаметокПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLЗаметокПриНажатии()

&НаКлиенте
Процедура Подключаемый_КомандаЗаметкиВсе(Команда)
	скРабочийСтолКлиент.КомандаЗаметкиВсе(ЭтаФорма, Команда);
КонецПроцедуры // Подключаемый_КомандаЗаметкиВсе()

&НаКлиенте
Процедура Подключаемый_КомандаЗаметкиДобавить(Команда)
	скРабочийСтолКлиент.КомандаЗаметкиДобавить(ЭтаФорма, Команда);
КонецПроцедуры // Подключаемый_КомандаЗаметкиДобавить()

&НаКлиенте
Процедура Подключаемый_ИсторияРаботыСкрытьНажатие(Элемент)
	скРабочийСтолКлиент.СкрытьИсториюРаботы(ЭтаФорма);	
КонецПроцедуры // Подключаемый_ИсторияРаботыСкрытьНажатие()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLИсторииРаботыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	скРабочийСтолКлиент.ПолеHTMLИсторииРаботыПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLИсторииРаботыПриНажатии()

&НаСервере
Функция ПолучитьСписокНастроекДинамическогоСпискаНаСервере() //VOG Ульянов И.В. CRM-905
	
	УдалитьКнопкиИзФормы();
	ИдентификаторыКомандНастроек.Очистить();
	
	ДобавитьКомандуНаФорму(Новый Структура("Представление", "Основной"));
	
	СписокНастроек = ХранилищеПользовательскихНастроекДинамическихСписков.ПолучитьСписок("Обработка.вогУправлениеКлассификацией.Форма.ФормаНоменклатура.СписокПлитка");	
	
	Для Каждого ТекНастройка Из СписокНастроек Цикл 
        ДобавитьКомандуНаФорму(ТекНастройка);
        НоваяСтрока = ИдентификаторыКомандНастроек.Добавить();
        НоваяСтрока.Команда = ТекНастройка.Представление;
        НоваяСтрока.Идентификатор = ТекНастройка.Значение;
	КонецЦикла;
	
	ОбновитьФлажки();
	
КонецФункции

&НаСервере
Процедура УдалитьКнопкиИзФормы() //VOG Ульянов И.В. CRM-905
	
    КомандыКУдалению = Новый Массив;
    ЭлементыКУдалению = Новый Массив;
	
    Для Каждого ТекКоманда Из Команды Цикл 
        Если Лев(ТекКоманда.Имя, 16) = "КомандаНастройка" Тогда 
            КомандыКУдалению.Добавить(ТекКоманда);
        КонецЕсли;
	КонецЦикла;
	
    Для Каждого ТекЭлемент Из Элементы Цикл 
        Если Лев(ТекЭлемент.Имя, 16) = "КомандаНастройка" И ТипЗнч(ТекЭлемент) = Тип("КнопкаФормы") Тогда 
            ЭлементыКУдалению.Добавить(ТекЭлемент);
        КонецЕсли;
	КонецЦикла;
	
    Для Каждого ТекКоманда Из КомандыКУдалению Цикл 
        Команды.Удалить(ТекКоманда);
	КонецЦикла;
	
    Для Каждого ТекЭлемент Из ЭлементыКУдалению Цикл 
        Элементы.Удалить(ТекЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомандуНаФорму(ТекНастройка) //VOG Ульянов И.В. CRM-905
	
	Если ТипЗнч(ТекНастройка) = Тип("Структура") Тогда 
        ИмяКоманды = "КомандаНастройкаСбросНастроек";
    Иначе 
        ИмяКоманды = "КомандаНастройка" + Формат(ТекНастройка.ПолучитьИдентификатор(), "ЧГ=");
	КонецЕсли;
	
    Команда = Команды.Добавить(ИмяКоманды);
    Команда.Заголовок = ТекНастройка.Представление;
    Команда.Действие = "КомандаПрименениеНастройкиПользователя";
    НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.СписокПлиткаГруппаВарианты);
    НовыйЭлемент.ИмяКоманды = ИмяКоманды;
    НовыйЭлемент.Заголовок = ТекНастройка.Представление;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПрименениеНастройкиПользователя(Команда) //VOG Ульянов И.В. CRM-905 	
	
	Если Команда.Имя = "КомандаНастройкаСбросНастроек" Тогда 
		
        ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокПлитка);
		
		Для Каждого ТекНастройка Из СписокПлитка.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл 			
			Если ТипЗнч(ТекНастройка) = Тип("ОтборКомпоновкиДанных") Тогда 
			    ТекНастройка.Элементы.Очистить();
			КонецЕсли;
		КонецЦикла;
		
		СписокПлитка.КомпоновщикНастроек.ЗагрузитьНастройки(СписокПлитка.КомпоновщикНастроек.Настройки);
		СписокПлитка.КлючТекущихПользовательскихНастроек = "";
		
    Иначе 
        ПрименитьНастройкуСервер(Команда.Имя);
	КонецЕсли;		
	
	ОбновитьФлажки();	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПользовательскиеНастройкиСервер() //VOG Ульянов И.В. CRM-905
	
	
	й = 1;
	//СписокПлитка.КомпоновщикНастроек.ЗагрузитьНастройки(СписокПлитка.Схема)
	
КонецПроцедуры


&НаСервере
Процедура ПрименитьНастройкуСервер(ИмяКоманды) //VOG Ульянов И.В. CRM-905
    
    Команда = Команды.Найти(ИмяКоманды);    
	
    НайденныеСтроки = ИдентификаторыКомандНастроек.НайтиСтроки(Новый Структура("Команда", Команда.Заголовок));
	Если НайденныеСтроки.Количество() Тогда  
		
        ВыборкаНастройки = ХранилищеПользовательскихНастроекДинамическихСписков.Выбрать(Новый Структура("КлючОбъекта, КлючНастроек, Пользователь", "Обработка.вогУправлениеКлассификацией.Форма.ФормаНоменклатура.СписокПлитка", НайденныеСтроки[0].Идентификатор, ПараметрыСеанса.ТекущийПользователь));
		
		Попытка
            ВыборкаНастройки.Следующий();
        Исключение
            Сообщить(ОписаниеОшибки());
            Возврат;
		КонецПопытки;
		
        СписокПлитка.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ВыборкаНастройки.Настройки);
		СписокПлитка.КлючТекущихПользовательскихНастроек = НайденныеСтроки[0].Идентификатор;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьФлажки() //VOG Ульянов И.В. CRM-905
	
    Для Каждого ТекКоманда Из Команды Цикл 
        Если Лев(ТекКоманда.Имя, 16) = "КомандаНастройка" Тогда 
            ТекКоманда.Картинка = Новый Картинка;
        КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФлажки() //VOG Ульянов И.В. CRM-905
	
	КлючНастроек = СписокПлитка.КлючТекущихПользовательскихНастроек;
	
	МассивПоиска = ИдентификаторыКомандНастроек.НайтиСтроки(Новый Структура("Идентификатор", КлючНастроек));
	
	ЗаголовокКоманды = "Основной";
	
	Если МассивПоиска.Количество() > 0 тогда
		ЗаголовокКоманды = МассивПоиска[0].Команда;
	КонецЕсли;		
	
    Для Каждого ТекКоманда Из Команды Цикл 
		Если Лев(ТекКоманда.Имя, 16) = "КомандаНастройка" Тогда 
			Если ТекКоманда.Заголовок = ЗаголовокКоманды тогда
				ТекКоманда.Картинка = БиблиотекаКартинок.Пометка;
				Элементы.СписокПлиткаГруппаПодменю.Заголовок = ЗаголовокКоманды;				
			Иначе	
            	ТекКоманда.Картинка = Новый Картинка;
			КонецЕсли;	
        КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СписокПлиткаПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка) //VOG Ульянов И.В. CRM-905
	
	ПолучитьСписокНастроекДинамическогоСпискаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СписокПлиткаПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки) //VOG Ульянов И.В. CRM-905
	
	ПолучитьСписокНастроекДинамическогоСпискаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СписокПлиткаПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки) //VOG Ульянов И.В. CRM-905
	
	ПолучитьСписокНастроекДинамическогоСпискаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортНоменклатурыПалитра(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаНоменклатурыПалитра.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеНоменклатурыПалитра(Команда) // VOG Ульянов И.В. CRM-1030
	ОткрытьФорму("Обработка.ОбновлениеНоменклатурыПалитра.Форма.Форма");
КонецПроцедуры

#КонецОбласти
//-Рабочий стол

