#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	// ++ VOG Солодов В.В. 14.10.2019 task 747
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		Справочники.вогКоммерческиеСоглашения.СформироватьНомерКоммерческогоСоглашения(ЭтотОбъект);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	// -- VOG Солодов В.В. 14.10.2019
//START Кайдашов 20/02/20	
	Если вогВерсия=0 тогда
		вогВерсия = Константы.ВогВерсияПечатнойФормыКС.Получить();
	КонецЕсли;
	Если вогВерсияПриложения1=0 тогда
		вогВерсияПриложения1 = Константы.ВогВерсияПечатнойФормыПриложения1.Получить();
	КонецЕсли;
	Если вогВерсияПриложения2=0 тогда
		вогВерсияПриложения2 = Константы.ВогВерсияПечатнойФормыПриложения2.Получить();
	КонецЕсли;
	Если вогВерсияПриложения3=0 тогда
		вогВерсияПриложения3 = Константы.ВогВерсияПечатнойФормыПриложения3.Получить();
	КонецЕсли;
	Если вогВерсияПриложения4=0 тогда
		вогВерсияПриложения4 = Константы.ВогВерсияПечатнойФормыПриложения4.Получить();
	КонецЕсли;
	Если вогВерсияПриложения5=0 тогда
		вогВерсияПриложения5 = Константы.ВогВерсияПечатнойФормыПриложения5.Получить();
	КонецЕсли;
	Если вогВерсияПриложения6=0 тогда
		вогВерсияПриложения6 = Константы.ВогВерсияПечатнойФормыПриложения6.Получить();
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
