#Область ОбработчикиФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьКартинкуПоИмени();
	
	ЗаполнитьМетаданные();
	
	УстановитьВидимостьДоступность();
	
	вогУправлениеОпросамиСервер.ЗаполнитьДанныеУсловийВопросовПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКартинкаНажатие(Элемент)
	
	Описание = Новый ОписаниеОповещения("ОписаниеОповещенияВыборКартинкиИзСписка", ЭтотОбъект);
	
	СписокКартинок = ПолучитьСписокВыбораКартинок();
	
	ТекЭлемент = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.ИмяКартинкиВБиблиотеке) Тогда
		ТекЭлемент = СписокКартинок.НайтиПоЗначению(Объект.ИмяКартинкиВБиблиотеке);
	КонецЕсли;
	
	ПоказатьВыборИзСписка(Описание, СписокКартинок, , ТекЭлемент);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	вогУправлениеОпросамиСервер.ЗаполнитьДанныеУсловийВопросовПриЧтении(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	вогУправлениеОпросамиСервер.ЗаполнитьДанныеУсловийВопросовПередЗаписью(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьУсловия(Команда)
	
	вогУправлениеОпросамиКлиентСервер.ОткрытьФормуНастройкиУсловийЗависимости(ЭтаФорма, Объект.Владелец);
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура ПоГоризонталиПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьКартинкуПоИмени()
	
	Если ЗначениеЗаполнено(Объект.ИмяКартинкиВБиблиотеке) Тогда
		Элементы.ДекорацияКартинка.Картинка = БиблиотекаКартинок[Объект.ИмяКартинкиВБиблиотеке];
	Иначе 
		Элементы.ДекорацияКартинка.Картинка = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьМетаданные()
	
	Элементы.Цвет.СписокВыбора.Очистить();
	Элементы.Цвет.СписокВыбора.Добавить("");
	
	Цвета = "Аквамарин 
	|АкварельноСиний 
	|АнтикБелый 
	|Бежевый 
	|Белоснежный 
	|Белый 
	|Бирюзовый 
	|БледноБирюзовый 
	|БледноЗеленый 
	|БледноЗолотистый 
	|БледноКрасноФиолетовый 
	|БледноЛиловый 
	|БледноМиндальный 
	|БледноСиреневый 
	|Васильковый 
	|ВесеннеЗеленый 
	|Голубой 
	|ГолубойСКраснымОттенком 
	|ГолубойСоСтальнымОттенком 
	|ГрифельноСерый 
	|ГрифельноСиний 
	|Древесный 
	|ДымчатоБелый 
	|ЖелтоЗеленый 
	|Желтый 
	|ЗамшаСветлый 
	|ЗеленаяЛужайка 
	|ЗеленоватоЖелтый 
	|ЗеленоватоЛимонный 
	|ЗеленоЖелтый 
	|Зеленый 
	|ЗеленыйЛес 
	|Золотистый 
	|Золотой 
	|Индиго 
	|Киноварь 
	|Кирпичный 
	|КожаноКоричневый 
	|Коралловый 
	|Коричневый 
	|КоролевскиГолубой 
	|КрасноФиолетовый 
	|Красный 
	|Кремовый 
	|Лазурный 
	|ЛимонноЗеленый 
	|Лимонный 
	|Лосось 
	|ЛососьСветлый 
	|ЛососьТемный 
	|Льняной 
	|Малиновый 
	|МятныйКрем 
	|НавахоБелый 
	|НасыщенноНебесноГолубой 
	|НасыщенноРозовый 
	|НебесноГолубой 
	|НейтральноАквамариновый 
	|НейтральноБирюзовый 
	|НейтральноВесеннеЗеленый 
	|НейтральноГрифельноСиний 
	|НейтральноЗеленый 
	|НейтральноКоричневый 
	|НейтральноПурпурный 
	|НейтральноСерый 
	|НейтральноСиний 
	|НейтральноФиолетовоКрасный 
	|Оливковый 
	|ОранжевоКрасный 
	|Оранжевый 
	|Орхидея 
	|ОрхидеяНейтральный 
	|ОрхидеяТемный 
	|Охра 
	|Перламутровый 
	|Персиковый 
	|ПесочноКоричневый 
	|ПолночноСиний 
	|ПризрачноБелый 
	|Пурпурный 
	|Пшеничный 
	|РозовоКоричневый 
	|Розовый 
	|Роса 
	|РыжеватоКоричневый 
	|СветлоГрифельноСерый 
	|СветлоГрифельноСиний 
	|СветлоЖелтый 
	|СветлоЖелтыйЗолотистый 
	|СветлоЗеленый 
	|СветлоЗолотистый 
	|СветлоКоралловый 
	|СветлоКоричневый 
	|СветлоНебесноГолубой 
	|СветлоРозовый 
	|СветлоСерый 
	|СеребристоСерый 
	|Серебряный 
	|СероСиний 
	|Серый 
	|СинеСерый 
	|СинеФиолетовый 
	|Синий 
	|СинийСоСтальнымОттенком 
	|СинийСПороховымОттенком 
	|Сливовый 
	|СлоноваяКость 
	|СтароеКружево 
	|ТемноБирюзовый 
	|ТемноБордовый 
	|ТемноГрифельноСерый 
	|ТемноГрифельноСиний 
	|ТемноЗеленый 
	|ТемноЗолотистый 
	|ТемноКрасный 
	|ТемноОливковоЗеленый 
	|ТемноОранжевый 
	|ТемноСерый 
	|ТемноСиний 
	|ТемноФиолетовый 
	|ТеплоРозовый 
	|Томатный 
	|ТопленоеМолоко 
	|ТусклоОливковый 
	|ТусклоРозовый 
	|ТусклоСерый 
	|Ультрамарин 
	|Фиолетовый 
	|Фуксин 
	|ФуксинТемный 
	|Фуксия 
	|Хаки 
	|ХакиТемный 
	|ЦветМорскойВолны 
	|ЦветМорскойВолныНейтральный 
	|ЦветМорскойВолныСветлый 
	|ЦветМорскойВолныТемный 
	|ЦветокБелый 
	|Циан 
	|ЦианАкварельный 
	|ЦианНейтральный 
	|ЦианСветлый 
	|ЦианТемный 
	|Черный 
	|ШелковыйОттенок 
	|Шоколадный"; 
	
	Для Каждого стр из СтрРазделить(Цвета, Символы.ПС) Цикл 
		
		Элементы.Цвет.СписокВыбора.Добавить(СокрЛП(стр));
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияВыборКартинкиИзСписка(Значение, Доп) Экспорт 
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИмяКартинкиВБиблиотеке = Значение.Значение;
	
	УстановитьКартинкуПоИмени();
	
	Модифицированность = Истина;
	
КонецПроцедуры // ОписаниеОтветаНаВопросГиперссылки()

Функция ПолучитьСписокВыбораКартинок()
	
	Возврат вогУправлениеОпросамиСервер.ПолучитьСписокВыбораКартинок();
	
КонецФункции

Процедура УстановитьВидимостьДоступность()
	
	Если Объект.РежимВыделенияГруппы = 1 Тогда
		Элементы.ГруппаГоризонтальные.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ИначеЕсли Объект.РежимВыделенияГруппы = 2 Тогда
		Элементы.ГруппаГоризонтальные.Отображение 			= ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ИначеЕсли Объект.РежимВыделенияГруппы = 3 Тогда
		Элементы.ГруппаГоризонтальные.Отображение 			= ОтображениеОбычнойГруппы.СильноеВыделение;
	Иначе 
		Элементы.ГруппаГоризонтальные.Отображение 			= ОтображениеОбычнойГруппы.ОбычноеВыделение;
	КонецЕсли;
	
	Если Объект.ПоГоризонтали Тогда
		Элементы.ГруппаГоризонтальные.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	Иначе 
		Элементы.ГруппаГоризонтальные.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	Если Объект.Жирный ИЛИ Объект.Наклонный ИЛИ Объект.Подчеркнутый Тогда 
		
		Элементы.ГруппаГоризонтальные.ШрифтЗаголовка = Новый Шрифт(,,Объект.Жирный, Объект.Наклонный, Объект.Подчеркнутый);
		
	Иначе 
		
		Элементы.ГруппаГоризонтальные.ШрифтЗаголовка = Новый Шрифт();
		
	КонецЕсли;
	
	Элементы.ГруппаГоризонтальные.ОтображатьЗаголовок = НЕ Объект.СкрытьЗаголовок;

КонецПроцедуры


#КонецОбласти	
