&НаСервере
Процедура ЗаполнитьПредопределенныеПоказателиНаСервере()
	Справочники.CRM_ШаблоныКлючевыхПоказателей.ЗаполнитьПредопределенныеПоказатели();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтвета(Знач Результат, Знач Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПредопределенныеПоказателиНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПредопределенныеПоказатели(Команда)
	ПараметрыОповещения = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтвета", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопрос(Оповещение, "Текущие настройки будут заменены стандартными.
	|Продолжить ?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокПередНачаломДобавленияНаСервере()
	Если НЕ CRM_ЛицензированиеСервер.ВариантПоставкиКОРП() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Функция доступна только для ""КОРП"" поставки конфигурации!'");
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = СписокПередНачаломДобавленияНаСервере();
КонецПроцедуры
