
Функция ЗапросPUT(Запрос)
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("ID");
	
	//СтрокаЗапросаТело = Запрос.ПолучитьТелоКакСтроку();
	//
	//ЧтениеJS = Новый ЧтениеJSON;
	//	
	//ЧтениеJS.УстановитьСтроку(СтрокаЗапросаТело);
	//	
	//JSЗапросХЗ = СериализаторXDTO.ПрочитатьJSON(ЧтениеJS);
		
	Ответ = Новый HTTPСервисОтвет(200);
	
	Возврат Ответ;
КонецФункции

Функция SendMessagePOST(Запрос)
	
	СтруктураЗапроса =  Новый Структура(); 
	
	IDНастройки 	= Запрос.ПараметрыURL.Получить("ID");
	
	СтруктураЗапроса.Вставить("ИдентификаторНастройки",Новый УникальныйИдентификатор(IDНастройки));
	
	СтруктураЗапроса.Вставить("ИмяОчереди",Запрос.ПараметрыURL.Получить("QueueName"));
	
	// ++ VOG Солодов В.В. 07.10.2021 
	Идентификатор = Запрос.Заголовки.Получить("DocumentID");
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		СтруктураЗапроса.Вставить("Идентификатор", Идентификатор);
	КонецЕсли;
	
	ОтключитьОбработку = Запрос.Заголовки.Получить("DisableRealTimeProcessing");
	
	Если ЗначениеЗаполнено(ОтключитьОбработку) Тогда
		СтруктураЗапроса.Вставить("ОтключитьОбработку", Истина);
	КонецЕсли;
	// -- VOG Солодов В.В. 07.10.2021 
	
	Тело = Запрос.ПолучитьТелоКакСтроку();
	
	Если Не ПустаяСтрока(Тело) Тогда 
		СтруктураЗапроса.Вставить("Сообщение",Тело);
		РегистрыСведений.desОчередьВходящихСообщений.ЗарегистрироватьЗапрос(СтруктураЗапроса);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции
