// Процедура - Выполнить включение выключение временного доступа
//
// Параметры:
//  ДокументДоступа		 - 	 - Сам документ
//  ВключитьВыключить	 - 	Булево - Признак действия, включаем или выключаем
//
Процедура ВыполнитьВключениеВыключениеВременногоДоступа(ДокументДоступа, ВключитьВыключить) Экспорт
	
	Если ВключитьВыключить = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДоступа = ДокументДоступа.ПолучитьОбъект();
	
	Если ВключитьВыключить Тогда
		ОбъектДоступа.ВыполнитьВключение();
	Иначе 
		ОбъектДоступа.ВыполнитьВыключение()
	КонецЕсли;
	
	ОбъектДоступа.Записать();
	
КонецПроцедуры
