
// + Тищенко В.В.

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ДействуетПо < ДействуетС И ЗначениеЗаполнено(ДействуетПо) Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата По меньше даты С", ЭтотОбъект,, "ДействуетПо", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.вогДелегированиеРолиИсполнителя.Записывать = Истина;
	
	Для каждого Стр Из ДоступныеРолиИсполнителя Цикл
		
		Наборзаписей 					= Движения.вогДелегированиеРолиИсполнителя.Добавить();
		Наборзаписей.Период 			= ТекущаяДата();
		Наборзаписей.ВладелецРоли 		= ВладелецРоли;
		Наборзаписей.Ответсвенный 		= Ответственный;
		Наборзаписей.РольИсполнителя	= Стр.РольИсполнителя;
		Наборзаписей.ДатаНачала 		= ДействуетС;
		Наборзаписей.ДатаОкончания 		= ДействуетПо;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

// - Тищенко В.В.



