
#Область ПрограммныйИнтерфейс

Функция ОбработчикиСобытийВопроса(Вопрос) Экспорт

	СоответствиеОбработчиков = Новый Соответствие;
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОбработчикиСобытий.Событие КАК Событие,
	|	ОбработчикиСобытий.Обработчик КАК Обработчик
	|ИЗ
	|	Справочник.вогВопросы.ОбработчикиСобытий КАК ОбработчикиСобытий
	|ГДЕ
	|	ОбработчикиСобытий.Ссылка = &Вопрос
	|");

	Запрос.УстановитьПараметр("Вопрос", Вопрос);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеОбработчиков.Вставить(Выборка.Событие, Выборка.Обработчик);
		
	КонецЦикла;
	
	Возврат СоответствиеОбработчиков;
	
КонецФункции // ОбработчикиСобытийВопроса()

#КонецОбласти
