
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
//START Кайдашов 12/07/19
	ПараметрыФормы = Новый Структура("ОтборРасшифровка, СформироватьПриОткрытии", ПолучитьПараметрыОтчета(ПараметрКоманды), Истина);
//	ПараметрыФормы = Новый Структура("ОтборРасшифровка, СформироватьПриОткрытии, СкрытьОтборы", ПолучитьПараметрыОтчета(ПараметрКоманды), Истина);
	ОткрытьФорму("Отчет.вогСтруктураЗадолженностиКлиента.Форма",
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОтчета(Ссылка)

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Партнеры") Тогда
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("ГруппаДляХолдинга", Ссылка);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.вогЮридическиеЛица") Тогда	
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("ГруппаДляХолдинга", "Партнер");
		СтруктураРеквизитов.Вставить("Контрагент"		, "Ссылка");
		
		ПараметрыОтчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтруктураРеквизитов);
		
	КонецЕсли;
	
	ПараметрыОтчета.Вставить("Период", ТекущаяДатаСеанса());

	Возврат ПараметрыОтчета;
	
КонецФункции // ПолучитьПараметрыОтчета()