
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтотОбъект.Параметры.СтруктураСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	СтруктураВыбора = Новый Структура();
	СтруктураВыбора.Вставить("Задача", Задача);
	СтруктураВыбора.Вставить("Приоритет", Приоритет);
	СтруктураВыбора.Вставить("ОжидаемыйРезультат", ОжидаемыйРезультат);
	СтруктураВыбора.Вставить("ВремяНачала", ВремяНачала);
	СтруктураВыбора.Вставить("ВремяОкончания", ВремяОкончания);
	СтруктураВыбора.Вставить("Продолжительность", Продолжительность);
	СтруктураВыбора.Вставить("Комментарий", Комментарий);	
	
	ОповеститьОВыборе(СтруктураВыбора);	
	
КонецПроцедуры


