
&НаКлиенте
Процедура ОК(Команда)
	
	ИсходящиеДанные = Новый Структура("Обработчик,ШаблонОбработчика",ТекстовыйДокумент.ПолучитьТекст(),ШаблонОбработчика);
	Закрыть(ИсходящиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекстОбработки") Тогда
		ТекстовыйДокумент.УстановитьТекст(Параметры.ТекстОбработки);
	КонецЕсли;	
	
	Если Параметры.Свойство("ШаблонОбработчика") Тогда
		ШаблонОбработчика = Параметры.ШаблонОбработчика;
	КонецЕсли;
	
	// ++ Харченко Д.И. №  - 07.09.2018 / 
	
	Если ЗначениеЗаполнено(Параметры.ИмяМакетаСправки) Тогда
		
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
		СправочнаяИнформация = Вычислить(Параметры.ИмяМакетаСправки + ".ПолучитьТекст()");
		
	КонецЕсли;
	
	// -- Харченко Д.И. №  - 07.09.2018
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОбработчикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекстовыйДокумент.УстановитьТекст(вогОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение,"ТекстОбработчика",Истина));
КонецПроцедуры

 
