
&НаСервере
Процедура ЗаполнитьВалютуИЦену()
	Если ЗначениеЗаполнено(Запись.ДоговорКонтрагента) Тогда
		ВалютаРасчетовКурсКратность 	= РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Запись.Дата, Новый Структура("Валюта", Запись.ДоговорКонтрагента.ВалютаРасчетов));
		Запись.ВалютаДокумента			= Запись.ДоговорКонтрагента.ВалютаРасчетов;
		Запись.КурсВзаиморасчетов		= ВалютаРасчетовКурсКратность.Курс;
		Запись.КратностьВзаиморасчетов	= ВалютаРасчетовКурсКратность.Кратность;
	Иначе
		Запись.ВалютаДокумента			= Справочники.Валюты.ПустаяСсылка();	
		Запись.КурсВзаиморасчетов		= 1;
		Запись.КратностьВзаиморасчетов	= 1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект = РеквизитФормыВЗначение("Запись");
	Если Объект.Выбран() Тогда Возврат; КонецЕсли;
	Запись.Дата = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	Пользователь = Пользователи.ТекущийПользователь();
	Запись.Организация = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнаяОрганизация");
	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = CRM_ОбщегоНазначенияСервер.ПолучитьПредопределеннуюОрганизацию();
	КонецЕсли;
	Запись.ВидыДвиженийПриходРасход = Перечисления.CRM_ВидыДвиженийПриходРасход.Приход;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ЗаполнитьВалютуИЦену();
КонецПроцедуры
