#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура УстановитьХолдингПартнера(Партнер, Холдинг) Экспорт
	Если Не ЗначениеЗаполнено(Партнер) Или ТипЗнч(Партнер) <> Тип("СправочникСсылка.Партнеры") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Холдинг) Тогда
		МенеджерЗаписи = РегистрыСведений.CRM_ХолдингиПартнеров.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Партнер = Партнер;
		МенеджерЗаписи.Холдинг = Холдинг;
		МенеджерЗаписи.Записать();
	Иначе
		НаборЗаписей = РегистрыСведений.CRM_ХолдингиПартнеров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Партнер.Установить(Партнер);
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецЕсли