
#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы

// +CRM
Перем ГлФормаНапоминанийCRM Экспорт;		 // Форма списка текущих напоминаний.
// +СофтФон
Перем сфпПанельУправления Экспорт;			 // Компонента для управления СофтФоном
Перем сфпObjCLON Экспорт;					 // COM-объект компоненты CLON.
Перем сфпСтруктураЗвонков Экспорт;			 // Структура активных звонков.
Перем сфпДанныеЗаполнения Экспорт;			 // Структура данных для заполнения телефонного звонка.
Перем сфпСоответствиеЛинийИСтатусов Экспорт; // Соответствие, хранящее номера внутр. телефонов и статусов (состояний по ним)
// -СофтФон
// -CRM

//+вог
//+Рабочий стол
Перем ск_глСтекФормРабочегоСтола Экспорт;
Перем ск_глТекущийИдентификатор Экспорт;
//-Рабочий стол
//-вог

// +++ VOG Кулаков П.Л. 30.12.2020 DEV-48
Перем вог_глСтекФормНачальнойСтраницы Экспорт;
Перем вог_глТекущийИдентификаторНачальнойСтраницы Экспорт;
// --- VOG Кулаков П.Л.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// ИнтернетПоддержкаПользователей
	ИнтернетПоддержкаПользователейКлиент.ПередНачаломРаботыСистемы();
	// Конец ИнтернетПоддержкаПользователей
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	// Начало вог Настройка полей отображения содержания
	вогОбщегоНазначенияВызовСервера.ИнициализацияМакета();
	вогОбщегоНазначенияВызовСервера.НастройкиПолейОтображенияСодержания();
	// Конец вог Настройка полей отображения содержания
    //START Кайдашов 09/07/19 429	
	//Подключим универсальный обработчик кнопок в сообщениях системы взаимодействий
	Попытка
		Обработчик = Новый ОписаниеОповещения("ОбработчикДействийСообщений", вогСистемаВзаимодействийКлиент);
		СистемаВзаимодействия.ПодключитьОбработчикДействияСообщения(Обработчик);
		//Обработчик = Новый ОписаниеОповещения("ОбработчикФормированияКоманд", вогСистемаВзаимодействийКлиент);
		//СистемаВзаимодействия.ПодключитьОбработчикФормированияКоманд(Обработчик);
		//Обработчик = Новый ОписаниеОповещения("ОбработчикПослеОтправкиСообщения", вогСистемаВзаимодействийКлиент);
		//СистемаВзаимодействия.ПодключитьОбработчикПослеОтправкиСообщения(Обработчик);
	Исключение
	КонецПопытки;
	//END Кайдашов
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	// +CRM
	сфпСофтФонПроКлиент.сфпВнешнееСобытияСофтфона(Источник, Событие, Данные);
	// -CRM
КонецПроцедуры

#КонецОбласти
