#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	// ТехнологияСервиса
	ТехнологияСервиса.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
	// Конец ТехнологияСервиса
	
	//<слкСистемаЛицензированияОРСР
	слкМенеджерЗащитыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	//>слкСистемаЛицензированияОРСР
	
	// +CRM не переносить в объединенные решения
	Если ИменаПараметровСеанса <> Неопределено Тогда
		// Заполним доступные пользователю уровни доступа.
		CRM_УправлениеДоступомУровниДоступа.УстановкаПараметровСеанса(ИменаПараметровСеанса);
		
	КонецЕсли;
	// -CRM не переносить в объединенные решения
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли