// +CRM не переносить в объединенные решения  ВЕСЬ МОДУЛЬ
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//+вог
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//Организация по умолчанию
	ЗначениеНастройки = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
	Если вогОрганизации.Количество() = 0
	  И ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		вогОрганизации.Добавить().Организация = ЗначениеНастройки;	
		
	КонецЕсли;	
	
КонецПроцедуры
//-вог

// Процедура - обработчик события ПриЗаписи.
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	//Кайдашов CRM-1027 23/11/2020
	МЗ = РегистрыСведений.ОбъектыСИзмененнымМесторасположением.СоздатьМенеджерЗаписи();
	МЗ.Объект = Ссылка;
	МЗ.Записать();
	
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
		
		ОсновнойМенеджер = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
		ДатаРегистрации  = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
		
	КонецЕсли;	
	
	//+вог
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ТипОтношений") Тогда
			вогТипыОтношений.Добавить().ТипОтношений = ДанныеЗаполнения.ТипОтношений;	
		
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	//-вог
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
// -CRM не переносить в объединенные решения  ВЕСЬ МОДУЛЬ
