

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура УстановитьОтборПоДоступнымПодразделениям()
	//ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	//ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ПравоеЗначение = СписокДоступныхПодразделений;
	
//START Кайдашов 23/08/19 590	
	СписокДоступныхПодразделений = CRM_УправлениеДоступомКПользователям.ПолучитьСписокДоступныхПодразделений();
	
	Если Параметры.Свойство("СДополнительными") И Параметры.СДополнительными Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		Для каждого Стр из ТекущийПользователь.вогПодразделенияДляПорученийДоп цикл	
			СписокДоступныхПодразделений.Добавить(Стр.Подразделение);	
		КонецЦикла;
	КонецЕсли;
	
	ЭлОф = Список.УсловноеОформление.Элементы.Добавить();
	ЭлОф.Использование = Истина;
	НовыйЭлементОтбора = ЭлОф.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	НовыйЭлементОтбора.ПравоеЗначение = СписокДоступныхПодразделений;
	НовыйЭлементОтбора.Использование = истина;
	ЭлОф.Оформление.УстановитьЗначениеПараметра("ЦветТекста",WebЦвета.СветлоСерый);
	ОформляемоеПоле = ЭлОф.Поля.Элементы.Добавить();
	ОформляемоеПоле.Использование = Истина;
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Наименование");
//END Кайдашов

	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТолькоДоступные") И Параметры.ТолькоДоступные Тогда
		УстановитьОтборПоДоступнымПодразделениям();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
//START Кайдашов 23/08/19 590	
	Если СписокДоступныхПодразделений.Количество()>0 и СписокДоступныхПодразделений.НайтиПоЗначению(Значение)=Неопределено тогда
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
//END Кайдашов	
	
КонецПроцедуры


#КонецОбласти
