
// Процедура для вывода активных напоминаний.
//
// Параметры:
//	Нет.
//
Процедура ВывестиАктивныеНапоминания() Экспорт
	МассивНапоминаний = CRM_НапоминанияСервер.ПолучитьНапоминания();
	//START Кайдашов 09/09/19 596	
	Для каждого Напоминание из МассивНапоминаний цикл
		Если ТипЗнч(Напоминание.Предмет)<>Тип("Строка") тогда
			ПоказатьОповещениеПользователя(Напоминание.Содержание,ПолучитьНавигационнуюСсылку(Напоминание.Предмет),,,СтатусОповещенияПользователя.Важное,Напоминание.Предмет.УникальныйИдентификатор());	
		// +++ VOG Кулаков П.Л. 21.10.2020 CRM-986
		Иначе
			ПоказатьОповещениеПользователя(Напоминание.Содержание,,,,СтатусОповещенияПользователя.Важное);	
		// --- VOG Кулаков П.Л.
		КонецЕсли;	
	КонецЦикла;
	
	////+вог
	////+Рабочий стол
	//ПараметрыРаботыКлиентаПриЗапуске = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();
	//Если ПараметрыРаботыКлиентаПриЗапуске.ЗапускатьРабочийСтолМенеджера Тогда
	//	Если ск_глСтекФормРабочегоСтола <> Неопределено Тогда
	//		ТекущаяФорма = ск_глСтекФормРабочегоСтола.Получить(ск_глТекущийИдентификатор);
	//		Если ТекущаяФорма <> Неопределено Тогда
	//			ТекущаяФорма.Подключаемый_ОбновитьТаблицуНапоминаний(МассивНапоминаний);
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	////-Рабочий стол
	////-вог
	//Если ГлФормаНапоминанийCRM = Неопределено Тогда
	//	ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
	//КонецЕсли;
	//Если (МассивНапоминаний.Количество() = 0) И НЕ ГлФормаНапоминанийCRM.Открыта() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//СтруктураНовыхНапоминаний = Новый Структура("ПрочиеНапоминания");
	//СтруктураНовыхНапоминаний.Вставить("МассивНапоминаний", МассивНапоминаний);
	//
	//ГлФормаНапоминанийCRM.ОбновитьТаблицуНапоминаний(СтруктураНовыхНапоминаний);
//END Кайдашов 596 	
КонецПроцедуры // ВывестиАктивныеНапоминания()



// Обработчик события "ПриНачалеРаботыСистемы".
//
// Параметры:
//	Нет.
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	ВывестиАктивныеНапоминания();
	
	// Получим период обновления напоминаний из настроек параметров учета.
	ПериодОбновления = CRM_НапоминанияСервер.ПолучитьПериодОбновленияНапоминаний();
	
	ПодключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминания", ПериодОбновления);
	
	ПодключитьОбработчикОповещенияВходящиеПисьма(Истина);
	
КонецПроцедуры // ПриНачалеРаботыСистемы()

// Функция формирования ключа записи по строке.
//
// Параметры:
//	Строка	- Строка	- Строка с ключом записи.
//
// Возвращаемое значение:
//	Структура	- Ключ записи
//
Функция СформироватьКлючЗаписиПоСтроке(Строка) Экспорт
	Ключ = Новый Структура();
	Ключ.Вставить("Пользователь",	Строка.Пользователь);
	Ключ.Вставить("Предмет",		Строка.Предмет);
	Если ТипЗнч(Строка.Предмет) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты") И ЗначениеЗаполнено(Строка.ВидОповещения) Тогда
		Ключ.Вставить("Содержание",		Строка.Содержание);
	Иначе	
		Ключ.Вставить("ДатаНачала",		Строка.ДатаНачала);
		Ключ.Вставить("ДатаОповещения",	Строка.ДатаОповещения);
	КонецЕсли;
	Возврат Ключ;
КонецФункции // СформироватьКлючЗаписиПоСтроке()

// Процедура для вывода активных напоминаний.
//
// Параметры:
//	Нет.
//
Процедура ВывестиАктивныеНапоминанияОВходящихПисьмах() Экспорт
 	МассивНапоминаний = CRM_НапоминанияСервер.ПолучитьНапоминания(Истина);
	Если ГлФормаНапоминанийCRM = Неопределено Тогда
		ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
	КонецЕсли;
	Если (МассивНапоминаний.Количество() = 0) И НЕ ГлФормаНапоминанийCRM.Открыта() Тогда
		Возврат;
	КонецЕсли;
	СтруктураНовыхНапоминаний = Новый Структура("НапоминанияОВходящихПисьмах");
	СтруктураНовыхНапоминаний.Вставить("МассивНапоминаний", МассивНапоминаний);
	ГлФормаНапоминанийCRM.ОбновитьТаблицуНапоминаний(СтруктураНовыхНапоминаний);
КонецПроцедуры // ВывестиАктивныеНапоминания()

//  подключает обработчик оповещения о входящих письмах.
//
Процедура ПодключитьОбработчикОповещенияВходящиеПисьма(ЗапуститьСразу = Ложь) Экспорт
	
	// Получим период обновления напоминаний из настроек параметров учета.
	ВходящиеПисьмаПериодОбновления = CRM_НапоминанияСервер.ПолучитьПериодОбновленияНапоминанийОВходящихПисьмах();
	
	Если ВходящиеПисьмаПериодОбновления > 0 Тогда
		
		Если ЗапуститьСразу Тогда
		
			ВывестиАктивныеНапоминанияОВходящихПисьмах();	
		
		КонецЕсли;		
		
		ПодключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминанияОВходящихПисьмах", ВходящиеПисьмаПериодОбновления);
		
	КонецЕсли;	
	
КонецПроцедуры// ПодключитьОбработчикОжиданияВходящиеПисьма()
	

//  Подключает обработчик оповещения о входящих письмах.
//
Процедура ОтключитьОбработчикОповещенияВходящиеПисьма() Экспорт
	
	ОтключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминанияОВходящихПисьмах");
		
КонецПроцедуры// ПодключитьОбработчикОжиданияВходящиеПисьма()
