
// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РасчетыВУсловныхЕдиницах")
		И Параметры.РасчетыВУсловныхЕдиницах Тогда
		
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список,"Владелец",Параметры.Владелец);
		
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список,"ВалютаДенежныхСредств",Параметры.СписокВалют,Истина,ВидСравненияКомпоновкиДанных.ВСписке);
		
	КонецЕсли;
	
КонецПроцедуры
