Функция ПолучитьКлючЯндекс() Экспорт
	Возврат Константы.вогКлючДоступаЯндекс.Получить();
КонецФункции

Функция ПолучитьКлючDaDaTa() Экспорт
	Возврат Константы.вогКлючAPIDaData.Получить();
КонецФункции

Функция ПолучитьСекретныйКлючDaDaTa() Экспорт
	Возврат Константы.вогСекретныйКлючAPIDaData.Получить();
КонецФункции

Функция ОпределитьТочностьСоответсвия(ОпределеннаяТочность) Экспорт
	
	Если  ОпределеннаяТочность  = "exact" Тогда
		
		Возврат "Точное соответствие"; 
		
	ИначеЕсли ОпределеннаяТочность  = "number" Тогда 
		
		Возврат "Совпал номер дома, но не совпало строение или корпус";
		
	ИначеЕсли ОпределеннаяТочность  = "near" Тогда
		
		Возврат "Найден дом с номером, близким к запрошенному";
		
	ИначеЕсли ОпределеннаяТочность  = "range" Тогда
		
		Возврат "Ответ содержит приблизительные координаты запрашиваемого дома";
		
	ИначеЕсли ОпределеннаяТочность  = "street" Тогда
		
		Возврат "Найдена только улица";
		
	ИначеЕсли ОпределеннаяТочность  = "other" Тогда
		
		Возврат "Улица не найдена, но найден, например, посёлок, район и т. п.";
		
	Иначе	
		
		Возврат "";
		
	КонецЕсли; 

КонецФункции // ()
 
Функция ПолучитьТаблицуПолигонов_ВсеРынки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогРынкиПолигоны.Объект.Наименование КАК Наименование,
		|	вогРынкиПолигоны.Объект КАК Объект,
		|	вогРынкиПолигоны.НомерПолигона КАК НомерПолигона,
		|	вогРынкиПолигоны.Широта КАК Широта,
		|	вогРынкиПолигоны.Долгота КАК Долгота,
		|	вогРынкиПолигоны.Контур КАК Контур
		|ИЗ
		|	РегистрСведений.вогПолигоныОбъектов КАК вогРынкиПолигоны
		|ГДЕ
		|	НЕ вогРынкиПолигоны.Объект.ПометкаУдаления
		|	И вогРынкиПолигоны.Объект ССЫЛКА Справочник.вогРынки";
	
	ТаблицаПолигонов = Запрос.Выполнить().Выгрузить();

	Возврат вогГеокодированиеСервер.ПолучитьСоответствиеПолигонов(ТаблицаПолигонов);

КонецФункции

// ++ Тищенко В.В. 14.01.2019
// Возвращяет яндекс ключ для отображения на карте при клике
Функция ПолучитьКлючЯндексJava() Экспорт
	Возврат Константы.вогКлючДоступаЯндекcJavaAPI.Получить();
КонецФункции // -- Тищенко В.В. 
