&НаКлиенте
Процедура КомандаДобавить(Команда)
	
	ИтоговыйТекст = ТекстПоручения+ "
	|
	|Добавлено "+ТекущаяДата()+", "+СокрЛП(ПользователиКлиентСервер.ТекущийПользователь()) + " 
	|"+ ПолеДляВводаТекста;
	
	Если ИзменитьОписаниеБизнесПроцесса(БизнесПроцесс, ИтоговыйТекст) тогда
		Закрыть(ИтоговыйТекст);
	Иначе
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстПоручения = Параметры.Описание;
	БизнесПроцесс = Параметры.БизнесПроцесс;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьОписаниеБизнесПроцесса(БизнесПроцесс, ТекстОписания)
	
	Попытка
		
		БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
		БизнесПроцессОбъект.ОбменДанными.Загрузка = Истина;
		БизнесПроцессОбъект.Описание = ТекстОписания;
		БизнесПроцессОбъект.Записать();
		
		Возврат Истина;
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;	
	
КонецФункции