#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт // ++ Тищенко В.В.
	
	//Настройки.РазрешеноИзменятьВарианты 					= Ложь;
	//Настройки.РазрешеноИзменятьСтруктуру 					= Ложь;
	//Настройки.ФормироватьСразу								= Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере 		= Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик 	= Истина;
	
КонецПроцедуры // -- Тищенко В.В.

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//	Форма - УправляемаяФорма - Форма отчета.
//	Отказ - Передается из параметров обработчика "как есть".
//	СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//	"УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
		
	ЭтаФорма.УстановитьТекущийВариант(ПолучитьПредопределенныйВариант());
	
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Подробнее - см. ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт // ++ Тищенко В.В.
	
	НовыеНастройкиКД.ДополнительныеСвойства.Вставить("КлючТекущегоВарианта", ПолучитьПредопределенныйВариант());
	
КонецПроцедуры // -- Тищенко В.В.

Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт // ++ Тищенко В.В.
	
	Если ТипЗнч(Контекст) = Тип("УправляемаяФорма") Тогда
		Если НовыеНастройкиКД <> Неопределено И Контекст.КлючТекущегоВарианта <> НовыеНастройкиКД.ДополнительныеСвойства.КлючТекущегоВарианта Тогда
			Контекст.НастройкиОтчета.РазрешеноВыбиратьВарианты = Ложь;
			ВариантыНастроек = ПолучитьМакет("Макет").ВариантыНастроек;
			Для каждого Стр Из ВариантыНастроек Цикл
				Если Стр.Имя = НовыеНастройкиКД.ДополнительныеСвойства.КлючТекущегоВарианта Тогда
					Контекст.КлючТекущегоВарианта = НовыеНастройкиКД.ДополнительныеСвойства.КлючТекущегоВарианта;
					НовыеНастройкиКД = Стр.Настройки;
					НовыеНастройкиКД.ДополнительныеСвойства.Вставить("КлючТекущегоВарианта",Контекст.КлючТекущегоВарианта);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // -- Тищенко В.В.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) // ++ Тищенко В.В.
	
	//СтандартнаяОбработка 	= Ложь;
	//ДокументРезультат.Очистить();
	//
	//Логотип = ПолучитьМакет("Логотип").ПолучитьОбласть("Логотип");
	//ДокументРезультат.Вывести(Логотип);
	//ДокументРезультат.Области.Логотип.ШиринаКолонки = 0.8;
	//
	//КомпоновщикМакета 		= Новый КомпоновщикМакетаКомпоновкиДанных;
	//
	//СхемаКомпоновкиДанных 	= ПолучитьМакет("Макет");
	//МакетКомпоновки 		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
	//
	//ПроцессорКомпоновки 	= Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	//
	//ПроцессорВывода 		= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//
	//ПроцессорВывода.НачатьВывод();
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	//ПроцессорВывода.ЗакончитьВывод();

	
КонецПроцедуры // -- Тищенко В.В.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Функция НастроитьПараметрыОтчетаПоВариантуОтчета() // ++ Тищенко В.В.
	
	Возврат ПолучитьПредопределенныйВариант();
		
КонецФункции

Функция ПолучитьПредопределенныйВариант() // ++ Тищенко В.В.
	
	Если ПараметрыСеанса.вогПодчиненныеСотрудники.Количество() > 1 ИЛИ Пользователи.ЭтоПолноправныйПользователь(Пользователи.ТекущийПользователь()) Тогда	
		Вариант = "СпискокБППоПодразделениям";
	Иначе	
		Вариант = "СписокБППользователя"
	КонецЕсли;
	
	Возврат Вариант;
	
КонецФункции // -- Тищенко В.В.

#КонецОбласти

#КонецЕсли