#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура создает элементы справочника по умолчанию.
//
// Параметры:
//	Нет.
//
Процедура СоздатьЭлементыСправочникаПоУмолчанию() Экспорт
	
	// Элемент "КОРП рынок"
	Элемент = Справочники.CRM_СегментыРынка.НайтиПоНаименованию("КОРП рынок", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_СегментыРынка.СоздатьЭлемент();
		НовыйЭлемент.Наименование	= НСтр("ru='КОРП рынок'");
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "Государство"
	Элемент = Справочники.CRM_СегментыРынка.НайтиПоНаименованию("Государство", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_СегментыРынка.СоздатьЭлемент();
		НовыйЭлемент.Наименование	= НСтр("ru='Государство'");
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "Партнер"
	Элемент = Справочники.CRM_СегментыРынка.НайтиПоНаименованию("Партнер", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_СегментыРынка.СоздатьЭлемент();
		НовыйЭлемент.Наименование	= НСтр("ru='Партнер'");
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "SMB"
	Элемент = Справочники.CRM_СегментыРынка.НайтиПоНаименованию("SMB", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_СегментыРынка.СоздатьЭлемент();
		НовыйЭлемент.Наименование	= НСтр("ru='SMB'");
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры // СоздатьЭлементыСправочникаПоУмолчанию()

#КонецЕсли

