
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектСсылка = Неопределено;
	Если Параметры.Отбор.Свойство("Объект", ОбъектСсылка) Тогда
		СписокПринадлежность = Новый СписокЗначений;
		СписокПринадлежность.Добавить(ОбщегоНазначения.ИмяТаблицыПоСсылке(ОбъектСсылка));
		
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Принадлежность.ИмяТаблиц", СписокПринадлежность));
		Элементы.Классификатор.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлассификаторПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"ЗначениеКлассификатора.Владелец", Классификатор,,, ЗначениеЗаполнено(Классификатор));
	
КонецПроцедуры

#КонецОбласти
