#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
// Работа с макетами офисных документов.

// Функция формирует печатную форму документа.
//
Функция СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати, НомерВарианта = Неопределено)
	
	Возврат Новый ТабличныйДокумент;	
	
КонецФункции

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
// ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
// МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
// ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
// КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
// ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КоммерческоеПредложение") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "КоммерческоеПредложение", НСтр("ru = 'Коммерческое предложение'"), СформироватьПечатнуюФорму(МассивОбъектов, ОбъектыПечати, Неопределено));
	КонецЕсли;
	
КонецПроцедуры // Печать()

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецЕсли