
#Область ПрограммныйИнтерфейс

Функция ИспользоватьРедактированиеПрисоединенныхФайловПоВидам(Объект) Экспорт
	
	МассивРазрешенныхОбъектов = Новый Массив;
	
	//Справочники
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.Партнеры"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.КонтактныеЛицаПартнеров"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.вогТорговыеТочки"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.вогЮридическиеЛица"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.вогКоллекцииНоменклатуры"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.вогРаспределительныеЦентры"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.вогПротоколыМероприятий"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.вогСтенды"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.вогНоменклатурныеПозиции"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.вогДизайныНоменклатуры"));
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов")); //+ VOG Иванов С.А. 15.11.2019 ID заявки: 000000892
	МассивРазрешенныхОбъектов.Добавить(Тип("СправочникСсылка.вогТорговоеОборудование")); //+++ VOG Ульянов И.В. 17.12.2019 CRM-53
	
	//Документы
	МассивРазрешенныхОбъектов.Добавить(Тип("ДокументСсылка.вогПротоколРазногласий"));
	МассивРазрешенныхОбъектов.Добавить(Тип("ДокументСсылка.вогАнкета"));
	МассивРазрешенныхОбъектов.Добавить(Тип("ДокументСсылка.CRM_Мероприятие"));
	
	// Задачи
	МассивРазрешенныхОбъектов.Добавить(Тип("ЗадачаСсылка.ЗадачаИсполнителя")); // ++ VOG Солодов В.В. 13.04.2020
	
	Возврат Не МассивРазрешенныхОбъектов.Найти(ТипЗнч(Объект)) = Неопределено;	
	
КонецФункции // ИспользоватьРедактированиеПрисоединенныхФайловПоВидам()

#КонецОбласти

