
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CRM_КартыМаршрутов") Тогда
		Ключ = "КартаМаршрута";
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.скНастройкиЗапускаБизнесПроцессовОбъектов") Тогда
		Ключ = "Настройка";
		
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить(Ключ, ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.скНастройкиЗапускаБизнесПроцессов.ФормаСписка", 
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры
