
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		 ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		 
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЗначениеЗаполнено(Рынок) Тогда
		ПроверяемыеРеквизиты.Добавить("МестоположениеНаРынке");		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаРегистрации = Неопределено;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// ++ VOG Солодов В.В. 18.06.2019 task 408
	Наименование = СокрЛП(Наименование);
	// -- VOG Солодов В.В. 18.06.2019
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ДатаРегистрации) Тогда
		ДатаРегистрации = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// ++ VOG Солодов В.В. 07.10.2019 task 604
	//Если Не Отказ И Не ЗначениеЗаполнено(НаселенныйПункт) Тогда
	//	Попытка
	//		Справочники.вогНаселенныеПункты.ЗаполнитьНаселенныйПунктВОбъектеПоВидуКонтактнойИнформации(
	//			ЭтотОбъект,
	//			Справочники.ВидыКонтактнойИнформации.Месторасположение);
	//	Исключение
	//		
	//	КонецПопытки;
	//КонецЕсли;
	// -- VOG Солодов В.В. 07.10.2019
	Если ЗначениеЗаполнено(НаселенныйПункт) тогда
		Если НаселенныйПункт.ТипАдреса = "НаселенныйПункт" тогда
			
			Если НаселенныйПункт.Родитель.ТипАдреса = "ГородскойОкруг" тогда
				НаселенныйПунктРайон = НаселенныйПункт.Родитель;	
				НаселенныйПунктРегион = НаселенныйПунктРайон.Родитель;
			Иначе
				НаселенныйПунктРайон = Справочники.вогНаселенныеПункты.ПустаяСсылка();	
				НаселенныйПунктРегион = НаселенныйПункт.Родитель;
			КонецЕсли;			
			
		ИначеЕсли НаселенныйПункт.ТипАдреса = "ГородскойОкруг" тогда
			НаселенныйПунктРайон = НаселенныйПункт;	
			НаселенныйПунктРегион = НаселенныйПункт.Родитель;
		ИначеЕсли НаселенныйПункт.ТипАдреса = "Регион" тогда
			НаселенныйПунктРайон = НаселенныйПункт;	
			НаселенныйПунктРегион = НаселенныйПункт;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//Связи
	Если ДополнительныеСвойства.Свойство("ЮрЛицоСвязи") Тогда
		вогУправлениеСвязями.УстановитьСвязьОбъекта(ДополнительныеСвойства.ЮрЛицоСвязи, Ссылка);
	КонецЕсли;
	//Если ЗначениеЗаполнено(НаселенныйПункт) тогда
	//	
	//	Если НаселенныйПункт.ТипАдреса = "НаселенныйПункт" тогда
	//		НаселенныйПунктРайон = НаселенныйПункт.Родитель;	
	//		НаселенныйПунктРегион = НаселенныйПунктРайон.Родитель;
	//	ИначеЕсли НаселенныйПункт.ТипАдреса = "ГородскойОкруг" тогда
	//		НаселенныйПунктРайон = НаселенныйПункт;	
	//		НаселенныйПунктРегион = НаселенныйПункт.Родитель;
	//	ИначеЕсли НаселенныйПункт.ТипАдреса = "Регион" тогда
	//		НаселенныйПунктРайон = НаселенныйПункт;	
	//		НаселенныйПунктРегион = НаселенныйПункт;
	//	КонецЕсли;
		
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//|	Выбор когда вогНаселенныеПункты.Родитель = ""ГородскойОкруг"" ТОГДА ИНАЧЕ КАК Район,
		//|	вогНаселенныеПункты.Родитель.Родитель КАК Регион
		//|ИЗ
		//|	Справочник.вогНаселенныеПункты КАК вогНаселенныеПункты
		//|ГДЕ
		//|	вогНаселенныеПункты.Ссылка = &НаселенныйПункт";
		//Запрос.УстановитьПараметр("НаселенныйПункт",НаселенныйПункт);
		//Выборка = Запрос.Выполнить().Выбрать();
		//Если Выборка.Следующий()тогда
		//	РайонДляЗаполнения = ;
		//	
		//	Если НаселенныйПункт.ТипАдреса = ""
		//	
		//	Если Выборка.Район <> НаселенныйПунктРайон тогда
		//		НаселенныйПунктРайон = Выборка.Район;	
		//	КонецЕсли;
		//	Если Выборка.Регион <> НаселенныйПунктРегион тогда
		//		НаселенныйПунктРегион = Выборка.Регион;
		//	КонецЕсли;
		//КонецЕсли;
	//КонецЕсли;
	
	//Кайдашов CRM-1027 23/11/2020
	МЗ = РегистрыСведений.ОбъектыСИзмененнымМесторасположением.СоздатьМенеджерЗаписи();
	МЗ.Объект = Ссылка;
	МЗ.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#КонецЕсли
