
&НаКлиенте
Процедура ДекорацияПримерЦветаНажатие(Элемент)
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриВыбореЦвета(Результат,Параметры) Экспорт

	Цвет = Результат;
	Элементы.КнопкаПримерЦвета.ЦветФона = Цвет;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЦвета(Команда)
	длгВыбораЦвета = Новый ДиалогВыбораЦвета;
	описаниеоповещения = Новый ОписаниеОповещения("ПриВыбореЦвета",ЭтаФорма);
	длгВыбораЦвета.Показать(описаниеоповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Цвет = ТекОбъект.Цвет.Получить();
	Элементы.КнопкаПримерЦвета.ЦветФона = Цвет;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(Цвет);
	
КонецПроцедуры
