
///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПортПоУмолчаниюПриИзменении(Элемент)
	Если ПортПоУмолчанию Тогда
		Объект.Порт = 0;
		Элементы.Порт.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Порт.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Порт = 0 Тогда
		ПортПоУмолчанию = Истина;
		Элементы.Порт.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если ПустаяСтрока(Объект.ПутьКWEBСервису) Тогда
		Объект.ПутьКWEBСервису = "/ews/exchange.asmx";
	КонецЕсли;	
КонецПроцедуры

