
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Макет, Заголовок", "НастройкаПравПользователейУчетныхЗаписейСинхронизацииGoogle", НСтр("ru = 'Настройка прав пользователей, учетных записей электронной почты, синхронизации с Google'"));
	ОткрытьФорму("Обработка.CRM_БыстроеОсвоение.Форма",ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
