
&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	НаправлениеДеятельности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "CRM_НаправлениеДеятельности");
	Если ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		ПолеНаправлениеДеятельности = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Найти("НаправлениеДеятельности");
		Сообщить(ПолеНаправлениеДеятельности);
		//ПолеНаправлениеДеятельности = Новый ПолеКомпоновкиДанных("НаправлениеДеятельности");
		Идентификатор = "";
		Для каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			
			Если ЭлементОтбора.ЛевоеЗначение = ПолеНаправлениеДеятельности.Поле Тогда 
				
				Идентификатор = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла; 
		Для каждого ЭлементПользовательскихНастроек Из Настройки.Элементы Цикл
			
			Если ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = Идентификатор Тогда 
				
				ЭлементПользовательскихНастроек.ЛевоеЗначение = ПолеНаправлениеДеятельности.Поле;
				ЭлементПользовательскихНастроек.ПравоеЗначение = НаправлениеДеятельности;
				ЭлементПользовательскихНастроек.Использование = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

