#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имена блокруемых реквизитов для механизма блокирования реквизитов БСП
//	Возвращаемое значание:
//		Массив - имена блокируемых реквизитов
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	ИмяОбъекта = Метаданные.Справочники.вогЮридическиеЛица.Имя;
	
	Результат = РегистрыСведений.вогЗапретРедактированияРеквизитов.ПолучитьБлокируемыеРеквизитыОбъекта(ИмяОбъекта);	
	
	Возврат Результат;

КонецФункции

// Создает связь со всеми торговыми точками с юридиским лицом по клиенту.
// Параметры:
//  Ссылка                                - Ссылка - Ссылка на юридическое лицо.
//
Процедура ЗаполнитьСвязьЮридическоеЛицоТорговаяТочка(Ссылка) Экспорт // ++ Тищенко В.В.

	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Ссылка.Партнер) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	вогТорговыеТочки.Ссылка КАК ОбъектСвязи,
		|	&ЮридическоеЛицо КАК ЮридическоеЛицо
		|ИЗ
		|	Справочник.вогТорговыеТочки КАК вогТорговыеТочки
		|ГДЕ
		|	вогТорговыеТочки.Партнер = &Партнер");
		Запрос.УстановитьПараметр("ЮридическоеЛицо"	, Ссылка);
		Запрос.УстановитьПараметр("Партнер"			, Ссылка.Партнер);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаСвязей 	= РезультатЗапроса.Выгрузить();
			НаборЗаписей 	= РегистрыСведений.вогСвязиЮридическихЛиц.СоздатьНаборЗаписей();
			// Дополнительная проверка.Может вызвать избыточную блокировку. Связь создается для нового объекта.
			// Но может понадобится для созданных объектов.
			НаборЗаписей.Отбор.ЮридическоеЛицо.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Загрузить(ТаблицаСвязей);
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // -- Тищенко В.В.

#КонецОбласти

#КонецЕсли

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
