#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Процедура выполняет заполнение предопределенных элементов справочника.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	ЭлементСправочника = Справочники.CRM_ВажностьКлиентов.ОсобоВажныйКлиент.ПолучитьОбъект();
	ЭлементСправочника.РеквизитДопУпорядочивания = 1;
	ЭлементСправочника.Записать();
	
	ЭлементСправочника = Справочники.CRM_ВажностьКлиентов.ВажныйКлиентФедеральногоУровня.ПолучитьОбъект();
	ЭлементСправочника.РеквизитДопУпорядочивания = 2;
	ЭлементСправочника.Записать();
	
	ЭлементСправочника = Справочники.CRM_ВажностьКлиентов.ВажныйКлиентРегиональногоУровня.ПолучитьОбъект();
	ЭлементСправочника.РеквизитДопУпорядочивания = 3;
	ЭлементСправочника.Записать();
	
	ЭлементСправочника = Справочники.CRM_ВажностьКлиентов.ОбычныйКлиент.ПолучитьОбъект();
	ЭлементСправочника.РеквизитДопУпорядочивания = 4;
	ЭлементСправочника.Записать();
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

#КонецЕсли

// Процедура - обработчик получения формы справочника.
//
// Параметры:
//	ВидФормы					- Строка	- Вид формы справочника.
//	Параметры					- Структура	- Параметры, переданные для формы.
//	ВыбраннаяФорма				- Строка	- Имя открываемой формы справочника.
//	ДополнительнаяИнформация	- Строка	- Дополнительная информация.
//	СтандартнаяОбработка		- Булево	- Признак стандартной обработки.
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("Ключ") Тогда
			Если Параметры.Ключ.Предопределенный Тогда
				// Запрещаем редактировать предопределенный элемент.
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ФормаЭлемента";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ОбработкаПолученияФормы()

