#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыНастройки(ПараметрНастройкиСсылка) Экспорт

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Клиенты");
	СтруктураРеквизитов.Вставить("Номенклатура");
	СтруктураРеквизитов.Вставить("Коллекции");
	СтруктураРеквизитов.Вставить("Повестка");
	//>>Бей(27.05.2019 15:30:57):#176
	СтруктураРеквизитов.Вставить("ТорговыеТочки");
	СтруктураРеквизитов.Вставить("ВариантЗаполненияДанныхТорговыеТочки");
	//<<Бей(27.05.2019 15:31:01):#176	
	СтруктураРеквизитов.Вставить("ВариантЗаполненияДанныхНоменклатураКоллекции");
	СтруктураРеквизитов.Вставить("ВариантЗаполненияДанныхКлиенты");
	СтруктураРеквизитов.Вставить("ПравилоРасчетаПроцентаВыполненияЗадач");
	СтруктураРеквизитов.Вставить("ЗаполнятьНаселенныйПункт"); //VOG Ульянов И.В. 03.02.2020 CRM-264
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрНастройкиСсылка, СтруктураРеквизитов);
	Если Не ЗначениеЗаполнено(ПараметрНастройкиСсылка) Тогда
		Реквизиты.Вставить("Клиенты", Ложь);
		Реквизиты.Вставить("Номенклатура", Ложь);
		Реквизиты.Вставить("Коллекции", Ложь);
		Реквизиты.Вставить("Повестка", Ложь);
		//>>Бей(27.05.2019 15:31:36):#176
		Реквизиты.Вставить("ТорговыеТочки", Ложь);
		//<<Бей(27.05.2019 15:31:39):#176
		Реквизиты.Вставить("ЗаполнятьНаселенныйПункт", Ложь); //VOG Ульянов И.В. 03.02.2020 CRM-264
	
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции // ПараметрыНастройки()

#КонецОбласти

#КонецЕсли