
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	//КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(), ДанныеРасшифровки);
	//
	//
	//// Инициализация процессора компоновки
	//
	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,, ДанныеРасшифровки);
	//
	//ПроцессорВывода = новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//
	//ПроцессорВывода.УстановитьДокумент(Результат);
	//
	//ПроцессорВывода.НачатьВывод();
	//
	//Пока Истина Цикл
	//	ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
	//	Если ЭлементРезультата= Неопределено Тогда
	//		Прервать;
	//	Иначе
	//		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ПроцессорВывода.ЗакончитьВывод();
КонецПроцедуры
