
Функция ВернутьОбработкуДействия(Триггер) Экспорт
	ОбработкаПроверки = Триггер.Действие.ОбработкаДействия.Получить();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
	ОбработкаПроверки.Записать(ИмяВременногоФайла);
	
	ПараметрыЗащиты = Новый("ОписаниеЗащитыОтОпасныхДействий"+"");
	ПараметрыЗащиты.ПредупреждатьОбОпасныхДействиях = ЛОЖЬ;                                            
	
	Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресХранилища = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор());
	
	Обработка =  ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(АдресХранилища,,Ложь, ПараметрыЗащиты), Ложь);
	Возврат Обработка;
КонецФункции	

Функция ВернутьОбработкуУсловия(Триггер) Экспорт
	ОбработкаПроверки = Триггер.УсловиеСрабатывания.ОбработкаПроверки.Получить();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
	ОбработкаПроверки.Записать(ИмяВременногоФайла);
	
	ПараметрыЗащиты = Новый("ОписаниеЗащитыОтОпасныхДействий"+"");
	ПараметрыЗащиты.ПредупреждатьОбОпасныхДействиях = ЛОЖЬ;                                            
	
	Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресХранилища = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор());
	
	Обработка =  ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(АдресХранилища,,Ложь, ПараметрыЗащиты), Ложь);
	Возврат Обработка;
КонецФункции	