////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
#Область ЭКСПОРТНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользованиеОтбора = НЕ Объект.Ссылка.Пустая();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Пользователи, "CRM_ДолжностнаяПозиция", Объект.Ссылка, ВидСравненияКомпоновкиДанных.ВИерархии,, ИспользованиеОтбора);
	
	//+++ Терпогосян Д.Б. [05.08.2021 15:22:47] № DEV-813
	СклонениеПредставленийОбъектов.ПриСозданииНаСервере(ЭтотОбъект, Объект.НаименованиеДляПечати);
	//--- Терпогосян Д.Б. [05.08.2021 15:22:47] № DEV-813 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Пользователи, "CRM_ДолжностнаяПозиция", Объект.Ссылка, ВидСравненияКомпоновкиДанных.ВИерархии,, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//+++ Терпогосян Д.Б. [05.08.2021 15:27:57] № DEV-813 
	СклонениеПредставленийОбъектов.ПриЗаписиНаСервере(ЭтотОбъект, Объект.НаименованиеДляПечати, ТекущийОбъект.Ссылка, Ложь);
	//--- Терпогосян Д.Б. [05.08.2021 15:27:57] № DEV-813 
	
КонецПроцедуры

//+++ Терпогосян Д.Б. [05.08.2021 15:29:22] № DEV-813
// СтандартныеПодсистемы.СклонениеПредставленийОбъектов
&НаКлиенте
Процедура Склонения(Команда)
    СклонениеПредставленийОбъектовКлиент.ОбработатьКомандуСклонения(ЭтотОбъект, Объект.НаименованиеДляПечати, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДляПечатиПриИзменении(Элемент)
	СклонениеПредставленийОбъектовКлиент.ПросклонятьПредставлениеПоВсемПадежам(ЭтотОбъект, Объект.НаименованиеДляПечати, Ложь);
КонецПроцедуры
//--- Терпогосян Д.Б. [05.08.2021 15:29:28] № DEV-813 

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ОБРАБОТЧИКИ_КОМАНД_ФОРМЫ

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ОПИСАНИЯ_ОПОВЕЩЕНИЙ
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ДЛЯ_УПРАВЛЕНИЯ_ВНЕШНИМ_ВИДОМ_ФОРМЫ
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ДЕЙСТВИЯ_КОМАНДНЫХ_ПАНЕЛЕЙ_ФОРМЫ
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ_ОБРАБОТКИ_СВОЙСТВ_И_КАТЕГОРИЙ
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ__ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ТАБЛИЧНОГО_ПОЛЯ__
#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ОПЕРАТОРЫ_ОСНОВНОЙ_ПРОГРАММЫ
#КонецОбласти