
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Объект.Ссылка.Пустая() Тогда
		Если	Параметры.Свойство("ЗначениеКопирования")
			И	ТипЗнч(Параметры.ЗначениеКопирования) = Тип("СправочникСсылка.CRM_ВоронкиПродаж")
			И	(Параметры.ЗначениеКопирования.Предопределенный ИЛИ Параметры.ЗначениеКопирования.Родитель.Предопределенный) Тогда
			//
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Копирование предопределенного элемента запрещено!'"));
			Возврат;
		ИначеЕсли ЗначениеЗаполнено(Объект.Родитель) И Объект.Родитель.Предопределенный Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Изменение состава этапов предопределенного элемента запрещено!'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
