&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.СписокНоменклатурныхПозиций.ТекущиеДанные <> Неопределено Тогда
		МассивВыбранныхЭлементов = Новый Массив;
		Для Каждого Строка Из Элементы.СписокНоменклатурныхПозиций.ВыделенныеСтроки Цикл
			МассивВыбранныхЭлементов.Добавить(Строка);
		КонецЦикла;
		ОповеститьОВыборе(МассивВыбранныхЭлементов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурныхПозицийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		МассивВыбранныхЭлементов = Новый Массив;
		МассивВыбранныхЭлементов.Добавить(Элемент.ТекущиеДанные.Ссылка);
		ОповеститьОВыборе(МассивВыбранныхЭлементов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Период") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокНоменклатурныхПозиций,"Период",Параметры.Период);
	КонецЕсли;
	
КонецПроцедуры
