
Процедура ПриЗаписи(Отказ, Замещение)
	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	// Вставить содержимое обработчика.
	
	Для каждого Запись из ЭтотОбъект цикл
		Если ЗначениеЗаполнено(Запись.ДатаВыставленияВОПотенциал) и ЗначениеЗаполнено(Запись.КоличествоВОПотенциал) тогда
			ДатаВыставленияВОПотенциал = СтрЗаменить(НРег(Запись.ДатаВыставленияВОПотенциал)," ","");
			Если ДатаВыставленияВОПотенциал = "4кв2020" тогда
				Запись.МесяцНачалаРасчёта = Дата(2021,1,1,1,1,1);		
			ИначеЕсли ДатаВыставленияВОПотенциал = "1кв2021" тогда
				Запись.МесяцНачалаРасчёта = Дата(2021,4,1,1,1,1);		
			ИначеЕсли ДатаВыставленияВОПотенциал = "2кв2021" тогда
				Запись.МесяцНачалаРасчёта = Дата(2021,7,1,1,1,1);		
			ИначеЕсли ДатаВыставленияВОПотенциал = "3кв2021" тогда
				Запись.МесяцНачалаРасчёта = Дата(2021,10,1,1,1,1);		
			ИначеЕсли ДатаВыставленияВОПотенциал = "4кв2021" тогда
				Запись.МесяцНачалаРасчёта = Дата(2022,1,1,1,1,1);		
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
