
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ++ VOG Солодов В.В. 14.01.2020 CRM-133
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ОписаниеСтатуса = вогОбщегоНазначения.ПолучитьОписаниеСтатусаСогласованияОбъекта(Запись.РаспределительныйЦентр);
		
		Если ОписаниеСтатуса.Статус = Перечисления.вогСтатусыСогласования.Согласован Тогда
			вогИнтеграцияСУчетнойСистемой.ЗарегистрироватьДанныеКОтправкеВУчетнуюСистему(Запись.РаспределительныйЦентр,,, Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // -- VOG Солодов В.В. 14.01.2020

#КонецОбласти

#КонецЕсли