
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = Новый Структура;
	Отбор.Вставить("вогЮридическоеЛицо", ПараметрКоманды);
	//{[+](фрагмент добавлен), Виноградов Дмитрий 21.06.2018 14:39:00 ID
	Отбор.Вставить("Владелец", ПолучитьПартнера(ПараметрКоманды));
	//}Администратор 21.06.2018 14:39:00
	
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаСписка", 
		Новый Структура("Отбор", Отбор), 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры

//{[+](фрагмент добавлен), Виноградов Дмитрий 21.06.2018 14:39:00 ID
&НаСервере
Функция ПолучитьПартнера(ПараметрКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат ПараметрКоманды.Партнер;
	Иначе
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции
//}Администратор 21.06.2018 14:39:00
