
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого СтрокаДопРеквизит Из Объект.ДополнительныеРеквизиты Цикл
		ДопРеквизит = СтрокаДопРеквизит.Свойство;
		
		ИдентификаторЭтапа = СтрЗаменить(Строка(ДопРеквизит.УникальныйИдентификатор()),"-","_");
		
		ИмяРеквизита = "ДопРеквизит_"+ИдентификаторЭтапа;
		Элемент = Элементы.Найти(ИмяРеквизита);
		Если Элемент = Неопределено Тогда
			МассивРеквизитов = Новый Массив;
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита, ДопРеквизит.ТипЗначения,,ДопРеквизит.Заголовок));
			ЭтотОбъект.ИзменитьРеквизиты(МассивРеквизитов);
			//
			Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Элементы.ГруппаДопРеквизиты);
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			//
			//Элемент.РежимВыделенияСтроки =РежимВыделенияСтрокиТаблицы.Строка;
			//Элемент.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
			//Элемент.РежимВыбора = Истина;
			//Элемент.ОтображениеСостоянияПросмотра.Видимость = Ложь;
			//Элемент.ОтображениеСтрокиПоиска.Видимость = Ложь;
			//Элемент.КоманднаяПанель.Видимость = Ложь;
			Элемент.ПутьКДанным = ИмяРеквизита;
			//Элемент.РазрешитьПеретаскивание = Истина;
			Элемент.Видимость = Истина;
			//Элемент.Шапка = Ложь;
			//Элемент.ГоризонтальныеЛинии = Ложь;
			//Элемент.ВертикальныеЛинии = Ложь;
			//Элемент.УстановитьДействие("Выбор", "ТаблицаОбработкаВыбор");
			//Элемент.УстановитьДействие("Перетаскивание", "ТаблицаОбработкаПеретаскивание");
			//Элемент.УстановитьДействие("ПередУдалением", "ТаблицаОбработкаПередУдалением");
			//Элемент.УстановитьДействие("НачалоПеретаскивания", "ТаблицаОбработкаНачалоПеретаскивания");
			//Элемент.УстановитьДействие("ПроверкаПеретаскивания", "ТаблицаОбработкаПроверкаПеретаскивания");
			//Элемент.УстановитьДействие("ПередНачаломДобавления", "НеРазобраноПередНачаломДобавления");
			//Элемент.УстановитьДействие("ПриАктивизацииСтроки", "НеРазобраноПриАктивизацииСтроки");
			Элемент.Заголовок = ДопРеквизит.Заголовок;
			Элемент.Подсказка = ДопРеквизит.Подсказка;
			//Элемент.КонтекстноеМеню.Видимость = Ложь;
			Элемент.ТолькоПросмотр = Истина;
			//Элемент.Высота = 4;
			//Элемент.РастягиватьПоВертикали = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	// Лиды
	Если РегистрыСведений.CRM_СостоянияЛидов.СсылкаЯвляетсяЛидом(Объект.Ссылка) Тогда
		СтруктураСостоянияЛида = РегистрыСведений.CRM_СостоянияЛидов.ПолучитьТекущееСостояниеЛида(Объект.Ссылка);
		Если СтруктураСостоянияЛида = Неопределено Тогда
			Элементы.ГруппаСостояниеЛида.Видимость = Ложь;
		Иначе
			СостояниеЛида = СтруктураСостоянияЛида.Состояние;
			Если СостояниеЛида = Справочники.CRM_СостоянияЛидов.Отклонен Тогда
				ПричинаОтклоненияЛида = СтруктураСостоянияЛида.ПричинаОтклонения;
				КомментарийСостоянияЛида = СтруктураСостоянияЛида.Комментарий;
			Иначе
				Элементы.ПричинаОтклонения.Видимость = Ложь;
				Элементы.КомментарийСостоянияЛида.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.ГруппаСостояниеЛида.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьАРМ");
КонецПроцедуры
