
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораИсточника();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораИсточника() 
	
	Элементы.Источник.СписокВыбора.Добавить(Неопределено, "Не указано");
	
	Для Каждого Стр Из Метаданные.ОпределяемыеТипы.вогИсточникДополнительныхКомандФормы.Тип.Типы() Цикл 
		
		МассивТек = Новый Массив;
		МассивТек.Добавить(Стр);
		
		Описание = Новый ОписаниеТипов(МассивТек);
		
		ПустаяСсылка = Описание.ПривестиЗначение(Неопределено);
		
		Элементы.Источник.СписокВыбора.Добавить(ПустаяСсылка, СокрЛП(Стр));
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти