#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьЕдиницуИзмеренияПоУмолчанию() Экспорт
	
	ЕдиницаПоУмолчанию = Справочники.CRM_ЕдиницыИзмеренияПоказателей.НайтиПоКоду("796");	
	Если ЕдиницаПоУмолчанию = Справочники.CRM_ЕдиницыИзмеренияПоказателей.ПустаяСсылка() Тогда
		ЕдиницаПоУмолчанию = Справочники.CRM_ЕдиницыИзмеренияПоказателей.НайтиПоНаименованию("шт", Истина);
	КонецЕсли;
	
	Возврат ЕдиницаПоУмолчанию;
	
КонецФункции
	
#КонецЕсли