#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы.

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	// Обзвон клиетов (для телемаркетинга).
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ОбзвонКлиентов.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 1;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Телемаркетинг;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	СправочникОбъект.Описание			= Нстр("ru = 'Используется для обзвона списка клиентов по маркетинговой кампании'");
	СправочникОбъект.СостояниеИнтереса	= Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		СправочникОбъект.Записать();
	Исключение		 
	КонецПопытки;
	
	// Потеря обращения
	
	СправочникОбъект					= Справочники.CRM_ВидыВзаимодействий.ПотеряОбращения.ПолучитьОбъект();
	СправочникОбъект.Баллы				= 0;
	СправочникОбъект.ВидДела			= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	СправочникОбъект.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	СправочникОбъект.Направление		= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	СправочникОбъект.Описание			= Нстр("ru = 'Потеря обращения'");
	СправочникОбъект.СостояниеИнтереса	= Справочники.CRM_СостоянияИнтересов.ИнтересПотерян;
	Попытка
		СправочникОбъект.Записать();
	Исключение		 
	КонецПопытки;	
	
	// Выполнение договора (100%)
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча у клиента в офисе'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыполнениеДоговора")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 36;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыполнениеДоговора;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Контроль работы с клиентом'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыполнениеДоговора")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.Прочее;
	НовыйСправочник.Наименование		= Нстр("ru = 'Контроль работы с клиентом'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Контроль работы с клиентом'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыполнениеДоговора;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Поддержание контакта с клиентом'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыполнениеДоговора")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 1;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru = 'Поддержание контакта с клиентом'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Поддержание контакта с клиентом'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыполнениеДоговора;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Работа с документами'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыполнениеДоговора")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 1;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru = 'Работа с документами'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Работа с документами'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыполнениеДоговора;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	// Выявление потребностей (40%).
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча с клиентом в нашем офисе'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыявлениеПотребностей")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 18;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча с клиентом в нашем офисе'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча с клиентом в нашем офисе'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча у клиента (в другом городе)'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыявлениеПотребностей")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 48;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча у клиента (в другом городе)'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча у клиента (в другом городе)'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча у клиента в офисе'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыявлениеПотребностей")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 36;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Обращение клиента в компанию'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыявлениеПотребностей")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Презентация, демонстрация (удаленная)'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыявлениеПотребностей")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 6;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Презентация, демонстрация (удаленная)'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Презентация, демонстрация (удаленная)'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Презентация, демонстрация (в нашем офисе)'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыявлениеПотребностей")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 9;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Презентация, демонстрация (в нашем офисе)'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Презентация, демонстрация (в нашем офисе)'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Презентация, демонстрация (у клиента)'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыявлениеПотребностей")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 21;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Презентация, демонстрация (у клиента)'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Презентация, демонстрация (у клиента)'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Телефонный звонок клиенту'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыявлениеПотребностей")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 1;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru = 'Телефонный звонок клиенту'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Телефонный звонок клиенту'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Электронное письмо клиенту'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ВыявлениеПотребностей")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 1;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru = 'Электронное письмо клиенту'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Электронное письмо клиенту'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ВыявлениеПотребностей;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;

	// Первичный интерес (10%)
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча с клиентом в нашем офисе'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 18;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча с клиентом в нашем офисе'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча с клиентом в нашем офисе'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча у клиента в офисе'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 36;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Обращение клиента в компанию"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Обращение клиента в компанию'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 1;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ПочтовоеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Обращение клиента в компанию'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Обращение клиента в компанию'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.Прочее;
	НовыйСправочник.Наименование		= Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		НовыйСправочник.Записать();
	Исключение 
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Обращение клиента в компанию'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Телефонный звонок клиенту'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru = 'Телефонный звонок клиенту'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Телефонный звонок клиенту'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Электронное письмо клиенту'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru = 'Электронное письмо клиенту'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Электронное письмо клиенту'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПервичныйИнтерес;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	// Подготовка предложения (65%).
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча у клиента в офисе'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПодготовкаПредложения")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 36;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПодготовкаПредложения;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Обращение клиента в компанию'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПодготовкаПредложения")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Входящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Обращение клиента в компанию'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПодготовкаПредложения;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Подготовка предложения для проекта'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПодготовкаПредложения")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 24;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru = 'Подготовка предложения для проекта'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Подготовка предложения для проекта'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПодготовкаПредложения;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Подготовка стандартного предложения'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПодготовкаПредложения")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 3;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru = 'Подготовка стандартного предложения'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Подготовка стандартного предложения'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПодготовкаПредложения;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Уточнение деталей у клиента'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПодготовкаПредложения")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 1;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru = 'Уточнение деталей у клиента'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Уточнение деталей у клиента'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПодготовкаПредложения;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	// Предложение и закрытие (95%).
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча с клиентом в нашем офисе'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПредложениеИЗакрытие")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 18;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча с клиентом в нашем офисе'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча с клиентом в нашем офисе'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПредложениеИЗакрытие;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча у клиента (в нашем городе)'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПредложениеИЗакрытие")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 36;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча у клиента (в нашем городе)'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча у клиента (в нашем городе)'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПредложениеИЗакрытие;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Встреча у клиента в офисе'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПредложениеИЗакрытие")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 36;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЛичнаяВстреча;
	НовыйСправочник.Наименование		= Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Встреча у клиента в офисе'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПредложениеИЗакрытие;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Подготовка договора'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПредложениеИЗакрытие")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 6;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru = 'Подготовка договора'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Подготовка договора'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПредложениеИЗакрытие;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Подготовка первичных документов'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПредложениеИЗакрытие")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 3;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ЭлектронноеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru = 'Подготовка первичных документов'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Подготовка первичных документов'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПредложениеИЗакрытие;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Подготовка первичных документов'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПредложениеИЗакрытие")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 3;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ПочтовоеПисьмо;
	НовыйСправочник.Наименование		= Нстр("ru = 'Подготовка первичных документов'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Подготовка первичных документов'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПредложениеИЗакрытие;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
	НовыйСправочник = Справочники.CRM_ВидыВзаимодействий.НайтиПоНаименованию(Нстр("ru = 'Уточнение у клиента решения'"));
	Если НЕ ЗначениеЗаполнено(НовыйСправочник) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	ИначеЕсли СоздаватьНовыйЭлементСправочника(НовыйСправочник, ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПредложениеИЗакрытие")) Тогда
		НовыйСправочник						= Справочники.CRM_ВидыВзаимодействий.СоздатьЭлемент();
	Иначе
		НовыйСправочник = НовыйСправочник.ПолучитьОбъект();
	КонецЕсли;
	НовыйСправочник.Баллы				= 2;	
	НовыйСправочник.ВидДела				= Справочники.CRM_ВидыДелВзаимодействий.Интерес;
	НовыйСправочник.ВидСобытия			= Перечисления.CRM_ВидыСобытий.ТелефонныйЗвонок;
	НовыйСправочник.Наименование		= Нстр("ru = 'Уточнение у клиента решения'");
	НовыйСправочник.Направление			= Перечисления.CRM_ВходящееИсходящееСобытие.Исходящее;
	НовыйСправочник.Описание            = Нстр("ru = 'Уточнение у клиента решения'");
	НовыйСправочник.СостояниеИнтереса   = Справочники.CRM_СостоянияИнтересов.ПредложениеИЗакрытие;
	Попытка
		НовыйСправочник.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры	

Функция СоздаватьНовыйЭлементСправочника(СправочникОбъект, СостояниеИнтереса)
	Если СправочникОбъект.СостояниеИнтереса = СостояниеИнтереса Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

#КонецОбласти

//+вог
Функция ПараметрыВидаВзаимодействий(ВидВзаимодействийСсылка) Экспорт

	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ИспользоватьКлиенты"      , "вогИспользоватьКлиенты");
	СтруктураРеквизитов.Вставить("ИспользоватьСвоиУчастники", "вогИспользоватьСвоиУчастники");
	СтруктураРеквизитов.Вставить("ИспользоватьПовестка"     , "вогИспользоватьПовестка");
	СтруктураРеквизитов.Вставить("ИспользоватьПрочее"	    , "вогИспользоватьПрочее");
	СтруктураРеквизитов.Вставить("ИспользоватьМесто"		, "вогИспользоватьМесто");
	СтруктураРеквизитов.Вставить("ИспользоватьСодержание"   , "вогИспользоватьСодержание");
	СтруктураРеквизитов.Вставить("ИспользоватьРезультат"	, "вогИспользоватьРезультат");
	СтруктураРеквизитов.Вставить("ИспользоватьСписокЗадач"  , "вогИспользоватьСписокЗадач");
	СтруктураРеквизитов.Вставить("ИспользоватьТорговыеТочки"  , "вогИспользоватьТорговыеТочки");
	СтруктураРеквизитов.Вставить("ВариантЗаполненияДанныхТорговыеТочки"  , "вогВариантЗаполненияДанныхТорговыеТочки");
	СтруктураРеквизитов.Вставить("ВариантЗаполненияДанныхКлиенты"  , "вогВариантЗаполненияДанныхКлиенты");
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидВзаимодействийСсылка, СтруктураРеквизитов);
	Если Не ЗначениеЗаполнено(ВидВзаимодействийСсылка) Тогда
		Для каждого КлючЗначениеРеквизита Из Реквизиты Цикл
			Реквизиты[КлючЗначениеРеквизита.Ключ] = Ложь;		
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции // ПараметрыВидаВзаимодействий()
//-вог

#КонецЕсли