
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", 	ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", 	РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ++ VOG Солодов В.В. 26.02.2021 DEV-218
	Если СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал Тогда
		
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
		
		Документы.ПланированиеПродажПлитка.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		Документы.ПланированиеПродажПлитка.ОтразитьДанныеПланированияПродажПлиткаКвартал(ДополнительныеСвойства, Движения, Отказ);
		Документы.ПланированиеПродажПлитка.ОтразитьДанныеПланированияПосещений(ДополнительныеСвойства, Движения, Отказ);
		Документы.ПланированиеПродажПлитка.ОтразитьДанныеКомментариев(ДополнительныеСвойства, Движения, Отказ);
		Документы.ПланированиеПродажПлитка.ОтразитьДанныеМаркетинга(ДополнительныеСвойства, Движения, Отказ);
		
		ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		// Очистить дополнительные свойства для проведения
		ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
	Иначе
	// -- VOG Солодов В.В. 26.02.2021 DEV-218
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка КАК Ссылка,
	               |	ПланированиеПродажПлиткаДанныеПланирования.НомерСтроки КАК НомерСтроки,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КомплектПанелей КАК КомплектПанелей,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоВОПотенциал КАК КоличествоВОПотенциал,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоВОПлан КАК КоличествоВОПлан,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоПотенциал КАК КоличествоПотенциал,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоПлан КАК КоличествоПлан,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ДатаВыставленияВОПотенциал КАК ДатаВыставленияВОПотенциал,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ДатаВыставленияВОПлан КАК ДатаВыставленияВОПлан,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ТорговаяТочка КАК ТорговаяТочка,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Бренд КАК Бренд,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Комментарий КАК Комментарий,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоПотенциалПоправочное КАК КоличествоПотенциалПоправочное,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоПланПоправочное КАК КоличествоПланПоправочное,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ПоправочныйКоэффициентПотенциал КАК ПоправочныйКоэффициентПотенциал,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ПоправочныйКоэффициентПлан КАК ПоправочныйКоэффициентПлан,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка.Дата КАК Период,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка.Автор КАК Автор,
	               |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Плитка) КАК Направление,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка.СценарийПланирования КАК Сценарий,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка.ВерсияСценария КАК Версия,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка.ПериодПланирования КАК ПериодПланирования,
	               |	ЗНАЧЕНИЕ(Перечисление.видыПотенциальнойТорговойТочки.) КАК ВидПотенциальнойТорговойТочки,
	               |	ЗНАЧЕНИЕ(Справочник.вогНаселенныеПункты.) КАК Город,
	               |	ЗНАЧЕНИЕ(Справочник.структураПредприятия.) КАК Подразделение,
	               |	NULL КАК Клиент
	               |ИЗ
	               |	Документ.ПланированиеПродажПлитка.ДанныеПланирования КАК ПланированиеПродажПлиткаДанныеПланирования
	               |ГДЕ
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка = &Ссылка
	               |	И ПланированиеПродажПлиткаДанныеПланирования.ТорговаяТочка ССЫЛКА Справочник.вогТорговыеТочки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка,
	               |	ПланированиеПродажПлиткаДанныеПланирования.НомерСтроки,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КомплектПанелей,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоВОПотенциал,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоВОПлан,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоПотенциал,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоПлан,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ДатаВыставленияВОПотенциал,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ДатаВыставленияВОПлан,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ТорговаяТочка,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Бренд,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Комментарий,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоПотенциалПоправочное,
	               |	ПланированиеПродажПлиткаДанныеПланирования.КоличествоПланПоправочное,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ПоправочныйКоэффициентПотенциал,
	               |	ПланированиеПродажПлиткаДанныеПланирования.ПоправочныйКоэффициентПлан,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка.Дата,
	               |	ДанныеПланированияПродажПлитка.Автор,
	               |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Плитка),
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка.СценарийПланирования,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка.ВерсияСценария,
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка.ПериодПланирования,
	               |	ДанныеПланированияПродажПлитка.ВидПотенциальнойТорговойТочки,
	               |	ДанныеПланированияПродажПлитка.Город,
	               |	ДанныеПланированияПродажПлитка.Подразделение,
	               |	ДанныеПланированияПродажПлитка.Клиент
	               |ИЗ
	               |	Документ.ПланированиеПродажПлитка.ДанныеПланирования КАК ПланированиеПродажПлиткаДанныеПланирования
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПланированияПродажПлитка КАК ДанныеПланированияПродажПлитка
	               |		ПО ПланированиеПродажПлиткаДанныеПланирования.ТорговаяТочка = ДанныеПланированияПродажПлитка.ТорговаяТочка
	               |			И (НЕ ПланированиеПродажПлиткаДанныеПланирования.ТорговаяТочка ССЫЛКА Справочник.вогТорговыеТочки)
	               |			И (ДанныеПланированияПродажПлитка.Регистратор ССЫЛКА Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка)
	               |ГДЕ
	               |	ПланированиеПродажПлиткаДанныеПланирования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Движения.ДанныеПланированияПродажПлитка.Записывать = Истина;
	Движения.ДанныеПланированияПродажПлитка.Загрузить(ТЗ);
	Для каждого Запись из Движения.ДанныеПланированияПродажПлитка цикл
		
		Запись.Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Запись.Автор.Подразделение);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПланированиеПродажПлиткаКомментарии.Ссылка.Дата КАК Период,
	               |	ПланированиеПродажПлиткаКомментарии.Регион КАК Регион,
	               |	ПланированиеПродажПлиткаКомментарии.ТорговаяТочка КАК ТорговаяТочка,
	               |	ПланированиеПродажПлиткаКомментарии.Бренд КАК Бренд,
	               |	ПланированиеПродажПлиткаКомментарии.Комментарий КАК Комментарий,
	               |	ПланированиеПродажПлиткаКомментарии.Рынок КАК Рынок,
	               |	ПланированиеПродажПлиткаКомментарии.Комплект КАК КомплектПанелей,
				   // +++ VOG Кулаков П.Л. 09.06.2021 DEV-605
	               |	ПланированиеПродажПлиткаКомментарии.Ссылка.ВерсияСценария КАК ВерсияСценария,
	               |	ПланированиеПродажПлиткаКомментарии.Ссылка.ПериодПланирования КАК ПериодПланирования,
	               |	ПланированиеПродажПлиткаКомментарии.Ссылка.СценарийПланирования КАК СценарийПланирования,
	               |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Плитка) КАК НаправлениеДеятельности
				   // --- VOG Кулаков П.Л.
	               |ИЗ
	               |	Документ.ПланированиеПродажПлитка.Комментарии КАК ПланированиеПродажПлиткаКомментарии
	               |ГДЕ
	               |	ПланированиеПродажПлиткаКомментарии.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Движения.КомментарииКПланированиюПродажПлитка.Загрузить(Запрос.Выполнить().Выгрузить());
	// +++ VOG Кулаков П.Л. 09.06.2021 DEV-605
	Для каждого Запись из Движения.КомментарииКПланированиюПродажПлитка цикл
		Запись.Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Запись.Автор.Подразделение);
	КонецЦикла;
	// --- VOG Кулаков П.Л.
	Движения.КомментарииКПланированиюПродажПлитка.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаГод;
	
	
КонецПроцедуры

#КонецОбласти
