
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВходящийТипОбработчика = Неопределено;
	
	Если Параметры.ПараметрыВыбора.Свойство("ТипОбработчика",ВходящийТипОбработчика) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТипОбработчика","Видимость",Ложь);
		Объект.ТипОбработчика = ВходящийТипОбработчика;
		ОтобразитьКомпиляцию();
	ИначеЕсли Параметры.Ключ.Пустая() Тогда
		Объект.ТипОбработчика = Перечисления.вогТипыОбработчика.Статус;
		ОтобразитьКомпиляцию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбработчикаПриИзменении(Элемент)
	ОтобразитьКомпиляцию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьКомпиляцию()

	Если Объект.ТипОбработчика = Перечисления.вогТипыОбработчика.Обработка Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияПроцедураСервер","Видимость",Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияИмяПроцедурыКлиент","Видимость",Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияПроцедураСервер","Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияИмяПроцедурыКлиент","Видимость",Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти