#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКопировании(ОбъектКопирования)
	Вид = Неопределено;
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;	
	
	Если ПометкаУдаления И ЗначениеЗаполнено(Вид) И НЕ Владелец.ПометкаУдаления Тогда		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нельзя удалять предопределенные папки электронной почты!'"));		
	КонецЕсли;	
	
	Если ПометкаУдаления И НЕ ЗначениеЗаполнено(Вид) И НЕ Владелец.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлектронноеПисьмоВходящее.Ссылка
		|ИЗ
		|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
		|ГДЕ
		|	ЭлектронноеПисьмоВходящее.CRM_Папка = &CRM_Папка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлектронноеПисьмоИсходящее.Ссылка
		|ИЗ
		|	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
		|ГДЕ
		|	ЭлектронноеПисьмоИсходящее.CRM_Папка = &CRM_Папка";
		
		Запрос.УстановитьПараметр("CRM_Папка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если  ВыборкаДетальныеЗаписи.Количество()<>0 Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Папка содержит электронные письма. Удаление недоступно!'"));		
		КонецЕсли;;
		
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецЕсли
