// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.

// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.

#Область Справочник_ВидыКонтактнойИнформации_ФормаЭлемента

// Процедура установливает доступность флажка "CRM_Основной".
//
// Параметры:
//	Нет.
//
Процедура УстановитьВидимостьОсновной(Форма) Экспорт
	
	Если (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникПартнеры"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_СправочникПартнерыКомпания"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочниквогРаспределительныеЦентры"))
		ИЛИ (Форма.Объект.Родитель = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочниквогРынки"))Тогда
		Форма.Элементы.CRM_Основной.Видимость = Истина;
	Иначе
		Форма.Элементы.CRM_Основной.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьОсновной()

// Процедура установливает доступность флажка "CRM_ИспользоватьДляОповещений".
//
// Параметры:
//	Нет.
//
Процедура УстановитьВидимостьИспользоватьДляОповещений(Форма) Экспорт
	
	Если (Форма.Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"))
		ИЛИ (Форма.Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты")) Тогда
		Форма.Элементы.CRM_ИспользоватьДляОповещений.Видимость = Истина;
	Иначе
		Форма.Элементы.CRM_ИспользоватьДляОповещений.Видимость = Ложь;
		Если Форма.Объект.CRM_ИспользоватьДляОповещений Тогда
			Форма.Объект.CRM_ИспользоватьДляОповещений = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры // УстановитьДоступностьИспользоватьДляОповещений()

#КонецОбласти

#Область Справочник_ФизическиеЛица_ФормаЭлемента

Процедура ФизическиеЛицаФормаЭлементаПослеЗаписи(Форма, Объект) Экспорт
	
	Если Форма.НеобходимоОповещение Тогда
		CRM_ВзаимодействияКлиент.КонтактСоздан(Объект.Ссылка, Объект.Наименование, Форма.ОбъектОснование);
		Оповестить("ЗаполнитьКонтактВТелефонномЗвонке", Новый Структура("Звонок, Контакт", Форма.ОбъектОснование, Объект.Ссылка));
		Форма.НеобходимоОповещение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
