
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если Параметры.Свойство("Ключ") Тогда
			ДокументОснование = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Параметры.Ключ, "ДокументОснование");
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				Параметры.Вставить("ПозиционироватьНаВзаимодействие", Параметры.Ключ);
				Параметры.Вставить("Ключ", ДокументОснование);
				МетаданныеОснования = ДокументОснование.Метаданные();
				Если ТипЗнч(ДокументОснование) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
					CRM_МетодыМодулейМенеджеровЗадач.ОбработкаПолученияФормОбъектовCRM(Задачи.ЗадачаИсполнителя, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
				ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОснования) Тогда
					ВыбраннаяФорма = "Документ." + МетаданныеОснования.Имя + ".ФормаОбъекта";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
