

Процедура ПередЗаписью(Отказ)
	Если УсловиеСрабатывания = Справочники.CRM_УсловияСрабатыванияТриггеров.ПоРасписанию Тогда
		РегламентноеЗадание = Неопределено;
		Если ЗначениеЗаполнено(УникальныйИдентификаторЗадания) Тогда
			GUIDЗадания = Новый УникальныйИдентификатор(УникальныйИдентификаторЗадания);
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(GUIDЗадания);
		КонецЕсли;
		Если РегламентноеЗадание = Неопределено Тогда
			РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.CRM_ВыполнениеТриггеров);
			УникальныйИдентификаторЗадания = РегламентноеЗадание.УникальныйИдентификатор;
			ПараметрыЗаданияМассив = Новый Массив;
			ПараметрыСтруктура = Новый Структура;
			ПараметрыСтруктура.Вставить("УникальныйИдентификаторЗадания", УникальныйИдентификаторЗадания);
			ПараметрыЗаданияМассив.Добавить(ПараметрыСтруктура);
			РегламентноеЗадание.Параметры = ПараметрыЗаданияМассив;
		КонецЕсли;
		Если РегламентноеЗадание.Наименование <> "Периодическое выполнение триггера: "+Наименование ИЛИ РегламентноеЗадание.Использование <> (Строка(РегламентноеЗадание.Расписание) <> "один день; один раз в день" И Действует) Тогда
			РегламентноеЗадание.Наименование = "Периодическое выполнение триггера: "+Наименование;
			РегламентноеЗадание.Использование = (Строка(РегламентноеЗадание.Расписание) <> "один день; один раз в день" И Действует);
			РегламентноеЗадание.Записать();
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(УникальныйИдентификаторЗадания) Тогда
			GUIDЗадания = Новый УникальныйИдентификатор(УникальныйИдентификаторЗадания);
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(GUIDЗадания);
			РегламентноеЗадание.Использование = Ложь;
			РегламентноеЗадание.Записать();
			УникальныйИдентификаторЗадания = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Если ПометкаУдаления Тогда
		Если ЗначениеЗаполнено(УникальныйИдентификаторЗадания) Тогда
			GUIDЗадания = Новый УникальныйИдентификатор(УникальныйИдентификаторЗадания);
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(GUIDЗадания);
			РегламентноеЗадание.Удалить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

