#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВариантыОтчетов

// Настройки вариантов этого отчета.
// Подробнее - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	// Настройка размещения, видимости по умолчанию, важности.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоКомпаниям");
	ОписаниеВарианта.Описание = НСтр("ru = 'План-фактный анализ продаж по компаниям'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоБрендам");
	ОписаниеВарианта.Описание = НСтр("ru = 'План-фактный анализ продаж по брендам'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоКлиентам");
	ОписаниеВарианта.Описание = НСтр("ru = 'План-фактный анализ продаж по клиентам(нат.ед.)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоКлиентамРуб");
	ОписаниеВарианта.Описание = НСтр("ru = 'План-фактный анализ продаж по клиентам(тыс.руб.)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоМенеджерам");
	ОписаниеВарианта.Описание = НСтр("ru = 'План-фактный анализ продаж по менеджерам(нат.ед.)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоМенеджерамРуб");
	ОписаниеВарианта.Описание = НСтр("ru = 'План-фактный анализ продаж по менеджерам(тыс.руб.)'");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	
	// ++ VOG Солодов В.В. 10.09.2021 CRM-1198
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	// -- VOG Солодов В.В. 10.09.2021 CRM-1198
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецЕсли