
&НаКлиенте
Процедура Заполнить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнениеЗавершение",ЭтаФорма);
	
	ОткрытьФорму("Документ.вогТранспортныеЗатраты.Форма.ФормаЗагрузкиДанные",,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеЗавершение(Параметр,ДопПараметр) экспорт
	
	ЗагрузитьНаСервере(Параметр);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(АдресХ)
	
	Попытка
		ТЗ = ПолучитьИзВременногоХранилища(АдресХ);
		УдалитьИзВременногоХранилища(АдресХ);
	Исключение
		Возврат;
	КонецПопытки;
	
	Объект.ТаблицаТранспортныхЗатрат.Очистить();
	Для каждого Строка из ТЗ цикл
		СтрокаТранспортныхЗатрат = Объект.ТаблицаТранспортныхЗатрат.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаТранспортныхЗатрат,Строка);	
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал;
		Объект.ВерсияСценария = Справочники.вогВерсииСценариевПланирования.НайтиПоНаименованию("Основная",Истина,,Справочники.вогСценарииПланирования.ПланНаКвартал); 
	КонецЕсли;
	
КонецПроцедуры
