//++ VOG Иванов С.А. 29.10.2019 ID заявки: 000000775
Процедура СоздатьЗаписьРолиКонтактногоЛица(СтруктураЗаписи, Удалить = Ложь) Экспорт
	МенеджерЗаписи = РегистрыСведений.вогРолиКонтактныхЛиц.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.КонтактноеЛицо          = СтруктураЗаписи.КонтактноеЛицо; 
	МенеджерЗаписи.ОбъектСвязи             = СтруктураЗаписи.ОбъектСвязи; 
	МенеджерЗаписи.CRM_РольКонтактногоЛица = СтруктураЗаписи.CRM_РольКонтактногоЛица;
	Если Удалить Тогда
		МенеджерЗаписи.Удалить();
	Иначе
		МенеджерЗаписи.Записать(); 
	КонецЕсли;	
КонецПроцедуры
//-- VOG Иванов С.А. 29.10.2019 ID заявки: 000000775



