
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаПоследнейСинхронизацииКонтактов	= Объект.ДатаПоследнейСинхронизацииКонтактов;
	ДатаПоследнейСинхронизацииСобытий	= Объект.ДатаПоследнейСинхронизацииСобытий;
	ДатаПоследнейСинхронизацииПисем		= Объект.ДатаПоследнейСинхронизацииПисем;
	Если  НЕ ЗначениеЗаполнено(ДатаПоследнейСинхронизацииКонтактов) 
		И НЕ ЗначениеЗаполнено(ДатаПоследнейСинхронизацииСобытий) Тогда
		
		Если Объект.Ссылка.Пустая() Тогда
			НадписьДатаСинхронизации = "";
		Иначе
			НадписьДатаСинхронизации = НСтр("ru = 'Обмен не выполнен'");
		КонецЕсли;
		
	Иначе
		НадписьДатаСинхронизации = "";
		
		Если ДатаПоследнейСинхронизацииКонтактов = ДатаПоследнейСинхронизацииСобытий Тогда
			НадписьДатаСинхронизации = НСтр("ru = 'Дата последнего сеанса обмена:'") + " " + Строка(ДатаПоследнейСинхронизацииКонтактов)
		Иначе
			Если ЗначениеЗаполнено(ДатаПоследнейСинхронизацииКонтактов) Тогда
				НадписьДатаСинхронизации = НСтр("ru = 'Дата последней синхронизации контактов:'") + " " + Строка(ДатаПоследнейСинхронизацииКонтактов);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДатаПоследнейСинхронизацииСобытий) Тогда
				НадписьДатаСинхронизации = НадписьДатаСинхронизации + ?(ЗначениеЗаполнено(НадписьДатаСинхронизации), Символы.ПС, "");
				НадписьДатаСинхронизации = НадписьДатаСинхронизации + НСтр("ru = 'Дата последней синхронизации мероприятий:'") + " " + Строка(ДатаПоследнейСинхронизацииСобытий);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДатаПоследнейСинхронизацииПисем) Тогда
				НадписьДатаСинхронизации = НадписьДатаСинхронизации + ?(ЗначениеЗаполнено(НадписьДатаСинхронизации), Символы.ПС, "");
				НадписьДатаСинхронизации = НадписьДатаСинхронизации + НСтр("ru = 'Дата последней синхронизации писем:'") + " " + Строка(ДатаПоследнейСинхронизацииПисем);
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Элементы.НадписьДатаСинхронизации.Заголовок = НадписьДатаСинхронизации;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИмяКомпьютераСформироватьНаименование()
	
	Объект.Компьютер = ИмяКомпьютера();
	Объект.Наименование = Строка(Объект.Пользователь) +" (" + Строка(Объект.Компьютер) + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		#Если НЕ Вебклиент Тогда
			Объект.Компьютер = ИмяКомпьютера();
			Объект.Наименование = Строка(Объект.Пользователь) +" (" + Строка(Объект.Компьютер) + ")";
		#Иначе
			ПолучитьИмяКомпьютераСформироватьНаименование();
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

