
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьСкрытьПротоколОбмена(Команда)
	
	Элементы.ФормаПоказатьСкрытьПротоколОбмена.Пометка = Не Элементы.ФормаПоказатьСкрытьПротоколОбмена.Пометка;	
	Элементы.ГруппаПротоколОбмена.Видимость = Элементы.ФормаПоказатьСкрытьПротоколОбмена.Пометка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("Подключаемый_СписокПриАктивизацииСтроки", 0.1, Истина);	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеПроцедурыФункции

&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
		
	КонецЕсли;
	
 	ЗначениеКлюча = Новый Структура("Период, ДействиеПриОбмене, Объект");
	ЗаполнитьЗначенияСвойств(ЗначениеКлюча, ТекущиеДанные);
	
	ОбработкаПоЗначениюКлючаЗаписиСервер(ЗначениеКлюча);    
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервере
Процедура ОбработкаПоЗначениюКлючаЗаписиСервер(КлючЗаписи)

	Менеджер = РегистрыСведений.вогЖурналОбменаСУчетнойСистемой.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, КлючЗаписи);
	
	Менеджер.Прочитать();
	Если Менеджер.Выбран() Тогда
		ПротоколОбмена = Менеджер.ХранилищеПротоколаОбмена.Получить();
	
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПоЗначениюКлючаЗаписиСервер()

#КонецОбласти

