
&НаКлиенте
Процедура СохранитьТокен(Команда)
	
	ПараметрыЗакрытия = Новый  Структура;
	ПараметрыЗакрытия.Вставить("Токен",Токен);
	Закрыть(Токен);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МакетНастроекКонсоли = ПолучитьОбщийМакет("CRM_ПараметрыПриложенияGoogle");
	Client_id         = МакетНастроекКонсоли.ПолучитьОбласть("Client_id|Значение").ТекущаяОбласть.Текст;
	Redirect_uri      = МакетНастроекКонсоли.ПолучитьОбласть("Redirect_uri|Значение").ТекущаяОбласть.Текст;
	
	Cсылка ="https://accounts.google.com/o/oauth2/auth?scope=https://www.googleapis.com/auth/calendar&state=%2Fprofile"
			+"&redirect_uri="+Redirect_uri+"&response_type=code&client_id="+Client_id+"&access_type=offline";

КонецПроцедуры
