
&НаКлиенте
Процедура КомандаОК(Команда)
	
	СтруктураВозврата = Новый Структура("Исполнитель,Роль,ПричинаПеренаправления");
	Если ИсполнительРоль = 0 Тогда
		СтруктураВозврата.Исполнитель = Исполнитель;
		СтруктураВозврата.ПричинаПеренаправления = ПричинаПеренаправления;
	Иначе
		СтруктураВозврата.Роль = Исполнитель;
		СтруктураВозврата.ПричинаПеренаправления = ПричинаПеренаправления;
	КонецЕсли;
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительРольПриИзменении(Элемент)
	
	УстановитьСвойствоПоля();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСвойствоПоля();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойствоПоля()
	
	Если ИсполнительРоль = 0 Тогда
		Элементы.Исполнитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		Элементы.Исполнитель.ВыбиратьТип = Ложь;
		Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		Элементы.Исполнитель.ПодсказкаВвода = НСтр("ru = 'Исполнитель'");
	Иначе
		Элементы.Исполнитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.РолиИсполнителей");
		Элементы.Исполнитель.ВыбиратьТип = Ложь;
		Исполнитель = ПредопределенноеЗначение("Справочник.РолиИсполнителей.ПустаяСсылка");
		Элементы.Исполнитель.ПодсказкаВвода = НСтр("ru = 'Роль исполнителя'");
	КонецЕсли;
	
КонецПроцедуры
