
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("ОтборПартнер,ВидЖурнала,БлокироватьИзменениеВидаЖурнала,БлокироватьИзменениеОтбораПоПартнеру", ПараметрКоманды, ПредопределенноеЗначение("Справочник.CRM_ГруппыУниверсальногоЖурнала.Продажи"), Истина, Истина);
	ОткрытьФорму("Обработка.CRM_УниверсальныйЖурналДокументов.Форма.ФормаФиксированныйОтбор", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
