
//+++ Терпогосян Д.Б. [21.10.2021 16:15:46] № CRM-1259
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	тзДанные = ПолучитьДанныеРРОиРТНПоМенеджерам(); 
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ДанныеРРОиРТНПоМенеджерам", тзДанные);
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//ПроцессорВывода.НачатьВывод();
	//ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	//Пока ЭлементРезультата <> Неопределено Цикл
	//	ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
	//	ЭлементРезультата = ПроцессорКомпоновки.Следующий();
	//КонецЦикла;
	//ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

Функция ПолучитьДанныеРРОиРТНПоМенеджерам()
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиЗадач.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
	               |	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	               |	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя
	               |ПОМЕСТИТЬ втАдресация
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.РольИсполнителя.Наименование = ""Руководитель регионального отдела""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИсполнителиЗадач.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
	               |	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	               |	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя
	               |ПОМЕСТИТЬ втАдресация1
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.РольИсполнителя.Наименование = ""Руководитель товарного направления""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Менеджер,
	               |	втАдресация.Исполнитель.Наименование КАК РРО,
	               |	втАдресация1.Исполнитель.Наименование КАК РТН
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втАдресация КАК втАдресация
	               |		ПО (втАдресация.ОсновнойОбъектАдресации = Пользователи.Подразделение)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втАдресация1 КАК втАдресация1
	               |		ПО (втАдресация1.ОсновнойОбъектАдресации = Пользователи.Подразделение.Родитель)
	               |ГДЕ
	               |	НЕ Пользователи.ПометкаУдаления
	               |	И НЕ Пользователи.Недействителен
	               |	И НЕ(втАдресация.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |				И втАдресация1.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	               |ИТОГИ
	               |ПО
	               |	Менеджер"; 
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	тзРезультат = Новый ТаблицаЗначений(); 
	тзРезультат.Колонки.Добавить("Менеджер", Новый ОписаниеТипов("СправочникСсылка.Пользователи")); 
	тзРезультат.Колонки.Добавить("РРО", Новый ОписаниеТипов("Строка"));
	тзРезультат.Колонки.Добавить("РТН", Новый ОписаниеТипов("Строка")); 
	
	Пока Выборка.Следующий() Цикл
	    нСтр = тзРезультат.Добавить(); 
		лРРО = ""; лРТН = ""; 
		ВыборкаДетальная = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаДетальная.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальная.РРО) Тогда 
				лРРО = лРРО + ?(лРРО = "", "", ", ")+ ВыборкаДетальная.РРО; 
			КонецЕсли; 
		    Если ЗначениеЗаполнено(ВыборкаДетальная.РТН) Тогда 
				лРТН = лРТН + ?(лРТН = "", "", ", ")+ ВыборкаДетальная.РТН; 
			КонецЕсли; 
		КонецЦикла; 
		нСтр.Менеджер = Выборка.Менеджер; 
		нСтр.РРО = лРРО; 
		нСтр.РТН = лРТН; 
	КонецЦикла; 
    УстановитьПривилегированныйРежим(Ложь); 
	Возврат тзРезультат
КонецФункции // ПолучитьДанныеРРОиРТНПоМенеджерам()
#КонецЕсли
//--- Терпогосян Д.Б. [21.10.2021 16:15:53] № CRM-1259 
