
&НаСервере
// Функция возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
// Параметры:
//  СсылкаНаОбъект	- Ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита	- Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьЗначениеРеквизита(СсылкаНаОбъект, ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита);
КонецФункции // ПолучитьЗначениеРеквизита()

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("ОтборПартнер,ВидЖурнала,БлокироватьИзменениеВидаЖурнала,БлокироватьИзменениеОтбораПоПартнеру", ПараметрКоманды, ПредопределенноеЗначение("Справочник.CRM_ГруппыУниверсальногоЖурнала.Контакты"), Истина, Истина);
	
	КонтактноеЛицо = Неопределено;
	Попытка
		ДокументСсылка = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка;
		КонтактноеЛицо = ПолучитьЗначениеРеквизита(ДокументСсылка, "КонтактноеЛицо");
	Исключение КонецПопытки;
	Если ЗначениеЗаполнено(КонтактноеЛицо) И ТипЗнч(КонтактноеЛицо) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		ПараметрыФормы.Вставить("КонтактноеЛицо", КонтактноеЛицо);
	КонецЕсли;
	
	Проект = Неопределено;
	Попытка
		ДокументСсылка = ПараметрыВыполненияКоманды.Источник.Объект.Ссылка;
		Проект = ПолучитьЗначениеРеквизита(ДокументСсылка, "Проект");
	Исключение КонецПопытки;
	Если ЗначениеЗаполнено(Проект) И ТипЗнч(Проект) = Тип("СправочникСсылка.Проекты") Тогда
		ПараметрыФормы.Вставить("Проект", Проект);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.CRM_УниверсальныйЖурналДокументов.Форма.ФормаФиксированныйОтбор", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
