
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПринадлежностьВидаСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ВидПрисоединенныйФайл", Объект.Принадлежность, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПринадлежностьВидаСервер()
	
	Элементы.Принадлежность.СписокВыбора.Очистить();
	Для каждого ЭлементМетаданных Из Метаданные.Справочники Цикл
		Если СтрНайти(ЭлементМетаданных.Имя, "ПрисоединенныеФайлы") > 0 Тогда
			Элементы.Принадлежность.СписокВыбора.Добавить(ЭлементМетаданных.ПолноеИмя(), ЭлементМетаданных.Синоним);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПринадлежностьВидаСервер()

#КонецОбласти
