
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	//Обработчики событий
	Если НЕ ЭтоГруппа Тогда
		
		Для каждого ЗначениеПеречисления Из Перечисления.вогСобытияВопросов Цикл
			ЭтотОбъект.ОбработчикиСобытий.Добавить().Событие = ЗначениеПеречисления;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//++ Бей #407 - Если тч состав вопроса не заполнена - то на форму выводится просто таблица без возможности выбора варинта ответа
	//Если Не ЭтоНовый() И НЕ ЭтоГруппа 
	//	И НЕ ТипОтвета = ПредопределенноеЗначение("Перечисление.вогТипыОтветов.Заполняемый") Тогда
	//	ПроверяемыеРеквизиты.Добавить("СоставВопроса");		
	//КонецЕсли;
	//--
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 	
	
	Если НЕ ЭтоГруппа И Не ИспользоватьАлгоритмОбработкиОтветов Тогда
		АлгоритмОбработкиОтветов = Неопределено;			
	КонецЕсли;
	
	
	Если НЕ ЭтоГруппа И ТипОтвета = ПредопределенноеЗначение("Перечисление.вогТипыОтветов.Заполняемый") Тогда
		СоставВопроса.Очистить();			
		НаборДополнительнойИнформации.Очистить();
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Если НЕ ЭтоГруппа Тогда
		СоставВопроса.Очистить();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
