#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьДатуОкончанияЭтапа(Этап) Экспорт
	
	Перем Результат;
	
	//ДлинаДня = 86400;
	//Возврат Начало + Длительность * ДлинаДня; 
	
	Если ТипЗнч(Этап) = Тип("ДокументОбъект.CRM_ЭтапКалендарногоПлана") Тогда 
		Результат = Этап.ДатаЗакрытия;
	ИначеЕсли ТипЗнч(Этап) = Тип("ДокументСсылка.CRM_ЭтапКалендарногоПлана") Тогда 
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Этап, "ДатаЗакрытия");
	Иначе
		ВызватьИсключение НСтр("ru = 'Невозможно получить дату окочания этапа. Обратитесь к администратору.'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		Представление = Данные.Ссылка.Тема;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
