#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если ВидФормы = "ФормаЗаписи" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// +++ VOG Кулаков П.Л. 26.03.2021
Функция ПолучитьМенеджераТорговойТочки(ТорговаяТочка, Подразделение, НаправлениеДеятельности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогМенеджерыОбъектов.Менеджер КАК Менеджер
		|ИЗ
		|	РегистрСведений.вогМенеджерыОбъектов КАК вогМенеджерыОбъектов
		|ГДЕ
		|	вогМенеджерыОбъектов.Владелец = &Владелец
		|	И вогМенеджерыОбъектов.Подразделение = &Подразделение
		|	И вогМенеджерыОбъектов.Роль = &Роль
		|	И вогМенеджерыОбъектов.НаправлениеДеятельности = &НаправлениеДеятельности";
	
	Запрос.УстановитьПараметр("Владелец", ТорговаяТочка);
	Запрос.УстановитьПараметр("НаправлениеДеятельности", НаправлениеДеятельности);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Роль", Справочники.РолиКонтактныхЛицПартнеров.Менеджер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Менеджер;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // --- VOG Кулаков П.Л.

#КонецЕсли