
#Область ОбработчикиСобытийФормы

// ++ VOG Солодов В.В. 03.06.2021 DEV-597
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДвоичныеДанныеПравил = ТекущийОбъект.ПравилаОбмена.Получить();
	
	Если ТипЗнч(ДвоичныеДанныеПравил) = Тип("ДвоичныеДанные") Тогда
		
		ТекстПравил = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеПравил, КодировкаТекста.UTF8);
		Правила.УстановитьТекст(ТекстПравил);
		
	КонецЕсли;
	
КонецПроцедуры // -- VOG Солодов В.В. 03.06.2021 DEV-597

#КонецОбласти

&НаКлиенте
Процедура ДобавитьПравила(Команда)
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеВыбораФайла",   ЭтотОбъект),,,Истина,УникальныйИдентификатор);
КонецПроцедуры

 &НаКлиенте
Процедура ПослеВыбораФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат; 
	КонецЕсли;
	
	ПриложитьПравила(Адрес);
	
КонецПроцедуры

&НаСервере
Процедура ПриложитьПравила(Адрес)
	
	ЭлементОбъект = РеквизитФормыВЗначение("Объект");
	// ++ VOG Солодов В.В. 03.06.2021 DEV-597
	ДвоичныеДанныеПравил 		= ПолучитьИзВременногоХранилища(Адрес);
	ТекстПравил 				= ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеПравил, КодировкаТекста.UTF8);
	Правила.УстановитьТекст(ТекстПравил);
	
	ЭлементОбъект.ПравилаОбмена = Новый ХранилищеЗначения(ДвоичныеДанныеПравил);
	// До изменения
	//ПравилаХранилище = Новый ХранилищеЗначения();
	//ЭлементОбъект.ПравилаОбмена = ПравилаХранилище;
	// -- VOG Солодов В.В. 03.06.2021 DEV-597
	ЭлементОбъект.Записать();
	
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьПравила(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
