
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Вид",Справочники.ВидыКонтактнойИнформации.ПолучитьСсылку(Новый УникальныйИдентификатор("107a33e0-d82f-11e8-a684-005056bc3fe8")));
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КлассификаторСтатусРЦ",ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("1cca0c0e-8ddb-11e9-b656-005056bc3fe8")));
	
	// +++ VOG Кулаков П.Л. 25.01.2021 DEV-79
	вогНачальнаяСтраницаПользователяКлиетСервер.НачальнаяСтраницаПользователяПриСозданииНаСервере(ЭтаФорма);
	// --- VOG Кулаков П.Л.
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПоручение(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны торговые точки. '"), 15);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяТаблицы"    , "Справочник.вогРаспределительныеЦентры");
	ПараметрыФормы.Вставить("МассивОбъектов", ВыделенныеСтроки);
	
	ОткрытьФорму("Обработка.вогМастерФормированияПоручений.Форма", 
		ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область НачальнаяСтраница
// +++ VOG Кулаков П.Л. 28.12.2020 DEV-48
&НаКлиенте
Процедура УстановитьПунктМеню()
	
	Если Элементы.Найти("МенюHTML") = Неопределено Тогда 
		//ОтключитьОбработчикОжидания("УстановитьПунктМеню");
		Возврат;
	КонецЕсли;
	
	Если Элементы.МенюHTML.Документ <> Неопределено Тогда
		Если Элементы.МенюHTML.Документ.readyState = "complete" Тогда
			вогНачальнаяСтраницаПользователяКлиетСервер.НачальнаяСтраницаПользователяПриОткрытии(ЭтаФорма,"раcпред. центры");
			//ОтключитьОбработчикОжидания("УстановитьПунктМеню");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // --- VOG Кулаков П.Л.

// +++ VOG Кулаков П.Л. 28.12.2020 DEV-48
&НаКлиенте
Процедура Подключаемый_МенюHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Element <> Неопределено Тогда
		вогНачальнаяСтраницаПользователяКлиетСервер.МенюHTMLПриНажатии(ЭтаФорма,"распред. центры");
	КонецЕсли;
		
КонецПроцедуры // --- VOG Кулаков П.Л.

#КонецОбласти

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// +++ VOG Кулаков П.Л. 25.01.2021 DEV-79
	ПодключитьОбработчикОжидания("УстановитьПунктМеню",0.1,Истина);
	// --- VOG Кулаков П.Л.
КонецПроцедуры
