
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Структура подчиненности".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует массив реквизитов документа. 
// 
// Параметры: 
//	ИмяДокумента	- Строка	- Имя документа.
// 
// Возвращаемое значение: 
//	Массив	- Массив наименований реквизитов документа. 
// 
Функция МассивРеквизитовОбъектаДляФормированияПредставления(ИмяДокумента) Экспорт
	МассивДопРеквизитов = Новый Массив;
	Возврат МассивДопРеквизитов
КонецФункции

// Функция возвращает представление документа для печати.
//
// Параметры:
//  Выборка	- КоллекцияДанных	- Структура или выборка из результатов запроса
//                 в которой содержатся дополнительные реквизиты, на основании
//                 которых можно сформировать переопределенное представление
//                 документа для вывода в отчет "Структура подчиненности".
//
// Возвращаемое значение:
//	Строка,Неопределено	- Переопределенное представление документа, или Неопределено,
//                           если для данного типа документов такое не задано.
//
Функция ПредставлениеОбъектаДляВыводаВОтчет(Выборка) Экспорт
	
	Если ТипЗнч(Выборка.Ссылка) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		Представление = "";
		
		ПредставлениеДокумента = Выборка.Ссылка.Наименование + ?(ЗначениеЗаполнено(Выборка.Ссылка.Проект),"/ "+Выборка.Ссылка.Проект,"") + " / от  " + Формат(Выборка.Ссылка.Дата,"ДФ=dd.MM.yyyy");
		
		Возврат ПредставлениеДокумента;
	КонецЕсли;
	
	Если ТипЗнч(Выборка.Ссылка) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		
		ПредставлениеДокумента = НСтр("ru='Этап: '") + Выборка.Ссылка.CRM_ТочкаМаршрута.Наименование + " / " + Выборка.Ссылка.Наименование + " / Срок до: " + Формат(Выборка.Ссылка.СрокИсполнения,"ДФ=dd.MM.yyyy");
		
		Возврат ПредставлениеДокумента;
	КонецЕсли;
	Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		ПредставлениеДокумента = НСтр("ru='Исходящее эл. письмо: '") +  Выборка.Ссылка.СписокПолучателейПисьма + " " 
			+ """" + Выборка.Ссылка.Тема + """" + " от " + Формат(Выборка.Ссылка.Дата, "ДФ='d.MM.yyyy HH:mm'");
		Возврат ПредставлениеДокумента;
	ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ПредставлениеДокумента = НСтр("ru='Входящее эл. письмо: '") +  Выборка.Ссылка.ОтправительПредставление + "<" 
			+ Выборка.Ссылка.ОтправительАдрес + "> " + """" + Выборка.Ссылка.Тема + """" + " от " 
			+ Формат(Выборка.Ссылка.Дата, "ДФ='d.MM.yyyy HH:mm'");
		Возврат ПредставлениеДокумента;
	ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		Если ЗначениеЗаполнено(Выборка.Ссылка.АбонентКонтакт) Тогда
			ПредставлениеКонтакта = Выборка.Ссылка.АбонентКонтакт.Наименование;
		Иначе	
			ПредставлениеКонтакта = Выборка.Ссылка.АбонентПредставление;
		КонецЕсли;
		ПредставлениеДокумента = ?(Выборка.Ссылка.Входящий, НСтр("ru='Входящий звонок'"), НСтр("ru='Исходящий звонок'"))	+ ": " 
			+ ПредставлениеКонтакта + ", " 
			+ Формат(Выборка.Ссылка.Дата, "ДФ='d MMM'; ДЛФ=D") + " / "
			+ Формат(Выборка.Ссылка.Дата, "ДФ=HH:mm; ДЛФ=T; ДП=00:00") + " / " 
			+ Формат(Дата('00010101') + Выборка.Ссылка.сфпДлительностьЗвонка, "ДФ=mm:ss; ДЛФ=T; ДП=00:00") + ", " 
			+ Строка(Выборка.Ссылка.Автор.Наименование);
		Возврат ПредставлениеДокумента;
	ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.СообщениеSMS") Тогда
		ПредставлениеДокумента = ?(Выборка.Ссылка.sms4bТипСообщения = Перечисления.sms4ВходящееИсходящееSMS.Входящее,
			НСтр("ru='Входящее сообщение SMS'"), НСтр("ru='Исходящее сообщение SMS'"))
			+ " от " + Формат(Выборка.Ссылка.Дата, "ДФ=dd.MM.yyyy; ДЛФ=DT")
			+ " (" + Выборка.Ссылка.sms4bСтатусСтрокой + "): " + Выборка.Ссылка.СписокУчастников;
		Возврат ПредставлениеДокумента;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция возвращает имя реквизита документа, в котором содержится информация о Сумме и Валюте документа для вывода в
// структуру подчиненности.
// По умолчанию используются реквизиты Валюта и СуммаДокумента. Если для конкретного документа или конфигурации в целом
// используются другие
// реквизиты, то переопределить значения по умолчанию можно в данной функции.
//
// Параметры:
//  ИмяДокумента  - Строка - Имя документа, для которого надо получить имя реквизита.
//  Реквизит      - Строка - Строка, может принимать значения "Валюта" и "СуммаДокумента".
//
// Возвращаемое значение:
//   Строка   - Имя реквизита документа, в котором содержится информация о Валюте или Сумме.
//
Функция ИмяРеквизитаДокумента(ИмяДокумента, Реквизит) Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяДокумента);
	
	Если МетаданныеДокумента = Неопределено Тогда
		МетаданныеДокумента = Метаданные.БизнесПроцессы.Найти(ИмяДокумента);
	КонецЕсли; 
	
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Реквизит = "СуммаДокумента" Тогда
		Если МетаданныеДокумента.Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			Возврат "СуммаДокумента";
		КонецЕсли;
	ИначеЕсли Реквизит = "Валюта" Тогда
		Если МетаданныеДокумента.Реквизиты.Найти("Валюта") <> Неопределено Тогда
			Возврат "Валюта";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
