
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыОтбор = Новый Структура("ИсполнительЗадачи",ПользователиКлиентСервер.ТекущийПользователь());
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии, ПоказыватьСогласование, Отбор", Истина, Истина, ПараметрыОтбор);
	ОткрытьФорму("Отчет.вогПланПоКомандировкам.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
