
#Область ПрограммныйИнтерфейс

Функция СтруктураИнтерфейсаРабочегоСтола() Экспорт

	СтруктураИнтерфейса = Новый Структура;
	
	СтруктураИнтерфейса.Вставить("ФонТумблеров"					    , ЦветаСтиля.скФонТумблеров);
	СтруктураИнтерфейса.Вставить("ЦветШрифтаТумблеров"				, ЦветаСтиля.скЦветШрифтаТумблеров);
	СтруктураИнтерфейса.Вставить("ДанныеЛоготипа"					, Константы.скЛоготипРабочегоСтола.Получить().Получить());
	СтруктураИнтерфейса.Вставить("ДвоичныеДанныеЛоготипаПоУмолчанию", БиблиотекаКартинок.скЛоготипРабочийСтол.ПолучитьДвоичныеДанные());
	
	Возврат СтруктураИнтерфейса;
	
КонецФункции // СтруктураИнтерфейсаРабочегоСтола()

#КонецОбласти