#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат; 
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда 
		ПриСозданииЧтенииНаСервере();
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность(ЭтаФорма);
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ПриСозданииЧтенииНаСервере(ТекущийОбъект);
	CRM_СобытияФорм.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьКонтактнаяИнформацияПриИзменении(Элемент)
	УстановитьВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКонтактныеЛицаПриИзменении(Элемент)
	УстановитьВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Форма)

	Объект	 = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаВидыКонтактнойИнформации.Видимость = Объект.ИспользоватьКонтактнаяИнформация;	
	Элементы.вогВидСвязиКонтакнтыхЛиц.Видимость       = Объект.ИспользоватьКонтактныеЛица;	
	
КонецПроцедуры // УстановитьВидимостьДоступность()

&НаСервере
Процедура ПриСозданииЧтенииНаСервере(ОбъектДляЗаполнения = Неопределено)

КонецПроцедуры

#КонецОбласти