#Область  СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтобратьСписок()
	Если ПараметрПоиска = 0 Тогда 
		НайденныеПартнеры = CRM_КлиентыСервер.НайтиПартнераПоИНН(ЗначениеПоиска);	
	ИначеЕсли ПараметрПоиска = 1  Тогда 
		НайденныеПартнеры = CRM_КлиентыСервер.НайтиПартнераПоКИ(ЗначениеПоиска, ПараметрПоиска);
	ИначеЕсли ПараметрПоиска = 2  Тогда 
		НайденныеПартнеры = CRM_КлиентыСервер.НайтиПартнераПоКИ(ЗначениеПоиска, ПараметрПоиска);
	ИначеЕсли ПараметрПоиска = 3  Тогда 
		НайденныеПартнеры = CRM_КлиентыСервер.НайтиПартнераПоНаименованию(ЗначениеПоиска);
	ИначеЕсли ПараметрПоиска = 4  Тогда 
		НайденныеПартнеры = CRM_КлиентыСервер.НайтиПартнераПоКИ(ЗначениеПоиска, ПараметрПоиска);
	ИначеЕсли ПараметрПоиска = 6  Тогда 
		НайденныеПартнеры = CRM_КлиентыСервер.НайтиПартнераПоКИ(ЗначениеПоиска, ПараметрПоиска);
	ИначеЕсли ПараметрПоиска = 5  Тогда 	
		НайденныеПартнеры = CRM_КлиентыСервер.НайтиПартнераПоКонтактномуЛицу(ЗначениеПоиска);
	ИначеЕсли ПараметрПоиска = 9  Тогда 	
		СписокИсключенияТиповКИ = Новый СписокЗначений;
		СписокИсключенияТиповКИ.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
		СписокИсключенияТиповКИ.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
		НайденныеПартнеры = CRM_КлиентыСервер.НайтиПартнераПоКИ(ЗначениеПоиска, ПараметрПоиска,, СписокИсключенияТиповКИ);
	КонецЕсли;	
	
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
    ПользовательскийОтбор.Элементы.Очистить();
	
	Партнеры				= ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Партнеры.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ссылка");
	Партнеры.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВСписке;
	Партнеры.Использование	= Истина;
	Партнеры.ПравоеЗначение	= НайденныеПартнеры;
	Партнеры.ПредставлениеПользовательскойНастройки = "Партнер";	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьТекущийПоиск()
	НайденныеПартнеры = Новый СписокЗначений();
	
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
    ПользовательскийОтбор.Элементы.Очистить();
	
	Партнеры				= ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Партнеры.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ссылка");
	Партнеры.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВСписке;
	Партнеры.Использование	= Истина;
	Партнеры.ПравоеЗначение	= НайденныеПартнеры;
	Партнеры.ПредставлениеПользовательскойНастройки = "Партнер";
КонецПроцедуры

#КонецОбласти

#Область  ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеПоиска = "";
	ВыбранныйПартнер = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтменитьТекущийПоиск();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандИРеквизитовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбранныйПартнер = ВыбраннаяСтрока; 
	Закрыть(ВыбранныйПартнер);
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоИНН(Команда)
	ОтобратьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоискаПриИзменении(Элемент)
	ОтобратьСписок();
КонецПроцедуры

#КонецОбласти
