
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ТипМессенджера", ТипМессенджера);
	Если Параметры.Свойство("АвторизацияПользователя", АвторизацияПользователя) Тогда
		Если ТипМессенджера = Перечисления.CRM_ТипыМессенджеров.ВКонтакте Тогда
			ПутьКСтраницеАвторизации = "https://oauth.vk.com/authorize?v=5.67&client_id=6086563&scope=groups,offline,docs&redirect_uri=http://api.vk.com/blank.html&display=page&response_type=token";
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ПолучениеТокенаГруппы", ПолучениеТокенаГруппы) Тогда
		Параметры.Свойство("IDГруппы", IDГруппы);
		Если ТипМессенджера = Перечисления.CRM_ТипыМессенджеров.ВКонтакте Тогда
			ПутьКСтраницеАвторизации = "https://oauth.vk.com/authorize?v=5.67&client_id=6086563&group_ids="+IDГруппы+"&scope=messages,manage,docs&redirect_uri=http://api.vk.com/blank.html&display=page&response_type=token";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ТекстЗапроса.Видимость = Истина;
	Элементы.ТекстЗапроса.Документ.URL = ПутьКСтраницеАвторизации;
	ПодключитьОбработчикОжидания("ТекстЗапросаДокументСформирован", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗапросаДокументСформирован()
	Ресурс = Элементы.ТекстЗапроса.Документ.URL;
	Если ТипМессенджера = ПредопределенноеЗначение("Перечисление.CRM_ТипыМессенджеров.ВКонтакте") Тогда
		СтрокаНачалаТокена = ?(АвторизацияПользователя, "access_token=", "access_token_"+IDГруппы+"=");
		Позиция = СтрНайти(Ресурс, СтрокаНачалаТокена);
		Если Позиция>0 Тогда
			Элементы.ТекстЗапроса.Видимость = Ложь;
			МаркерДоступа = Сред(Ресурс, Позиция+СтрДлина(СтрокаНачалаТокена),  СтрНайти(Ресурс, "&expires_in=")-(Позиция+13));
			Закрыть(Новый Структура("Токен", МаркерДоступа));
		КонецЕсли;
	КонецЕсли;
	ПодключитьОбработчикОжидания("ТекстЗапросаДокументСформирован", 0.1, Истина);
КонецПроцедуры
