

Функция ВоронкаПродажПолучитьТекстЗапроса(Форма) Экспорт
	
	ТекстЗапроса = "";
	
	Если Форма.ЕстьЭтапыПоКартамМаршрута Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВоронкаСостав.ТочкаМаршрута КАК ТочкаМаршрута,
		|	ВоронкаСостав.ТочкаМаршрута.Вид КАК ВидТочкиМаршрута,
		|	ВоронкаСостав.КартаМаршрута КАК КартаМаршрута,
		|	ВоронкаСостав.Ссылка КАК Этап
		|ПОМЕСТИТЬ ЭтапыТочекМаршрута
		|ИЗ
		|	Справочник.CRM_ВоронкиПродаж.Состав КАК ВоронкаСостав
		|ГДЕ
		|	ВоронкаСостав.Ссылка.Родитель = &Воронка
		|	И НЕ ВоронкаСостав.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
		|	ЗадачаИсполнителя.CRM_ТочкаМаршрута КАК CRM_ТочкаМаршрута,
		|	МАКСИМУМ(ЗадачаИсполнителя.CRM_Итерация) КАК CRM_Итерация
		|ПОМЕСТИТЬ ИтерацииЗадач
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
		|	И ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И НЕ ЗадачаИсполнителя.CRM_Переадресована
		|	И ЗадачаИсполнителя.БизнесПроцесс.Стартован
		|	И НЕ ЗадачаИсполнителя.БизнесПроцесс.Завершен
		|	И ВЫБОР
		|			КОГДА НЕ ЗадачаИсполнителя.Выполнена
		|				ТОГДА ЗадачаИсполнителя.СрокИсполнения <= &ГоризонтВоронки
		|						И ЗадачаИсполнителя.Дата <= &КонецПериода
		|			ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения МЕЖДУ &НачалоПериода И &КонецПериода
		|		КОНЕЦ
		|{ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс КАК ОтборБизнесПроцесс}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаИсполнителя.БизнесПроцесс,
		|	ЗадачаИсполнителя.CRM_ТочкаМаршрута
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика,
		|	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньВключенВГрафик
		|ПОМЕСТИТЬ КалендарныйГрафик
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|ГДЕ
		|	КалендарныеГрафики.Календарь = &Календарь
		|	И КалендарныеГрафики.ДатаГрафика <= &ТекущаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КалендарныйГрафик.ДатаГрафика) КАК ДлительностьБизнесПроцесса
		|ПОМЕСТИТЬ ВсеБизнесПроцессы
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ КалендарныйГрафик КАК КалендарныйГрафик
		|		ПО ЗадачаИсполнителя.БизнесПроцесс.ДатаСтарта <= КалендарныйГрафик.ДатаГрафика
		|			И (ВЫБОР
		|				КОГДА ЗадачаИсполнителя.БизнесПроцесс.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА &ТекущаяДата
		|				ИНАЧЕ ЗадачаИсполнителя.БизнесПроцесс.ДатаЗавершения
		|			КОНЕЦ >= КалендарныйГрафик.ДатаГрафика)
		|			И (КалендарныйГрафик.ДеньВключенВГрафик)
		|ГДЕ
		|	ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
		|	И ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И НЕ ЗадачаИсполнителя.CRM_Переадресована
		|	И ЗадачаИсполнителя.БизнесПроцесс.Стартован
		|	И НЕ ЗадачаИсполнителя.БизнесПроцесс.Завершен
		|	И ВЫБОР
		|			КОГДА НЕ ЗадачаИсполнителя.Выполнена
		|				ТОГДА ЗадачаИсполнителя.СрокИсполнения <= &ГоризонтВоронки
		|						И ЗадачаИсполнителя.Дата <= &КонецПериода
		|			ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения МЕЖДУ &НачалоПериода И &КонецПериода
		|		КОНЕЦ
		|{ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс КАК ОтборБизнесПроцесс}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаИсполнителя.БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	CRM_БизнесПроцесс.Ссылка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КалендарныйГрафик.ДатаГрафика)
		|ИЗ
		|	БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
		|		ЛЕВОЕ СОЕДИНЕНИЕ КалендарныйГрафик КАК КалендарныйГрафик
		|		ПО CRM_БизнесПроцесс.ДатаСтарта <= КалендарныйГрафик.ДатаГрафика
		|			И CRM_БизнесПроцесс.ДатаЗавершения >= КалендарныйГрафик.ДатаГрафика
		|			И (КалендарныйГрафик.ДеньВключенВГрафик)
		|ГДЕ
		|	CRM_БизнесПроцесс.Завершен
		|	И НЕ CRM_БизнесПроцесс.ПометкаУдаления
		|	И CRM_БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|	И CRM_БизнесПроцесс.ДатаЗавершения МЕЖДУ &НачалоПериода И &КонецПериода";
		Если Форма.ОтборОтветственные.Количество()>0 Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И CRM_БизнесПроцесс.Ответственный В (&ОтборОтветственные)";
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.ОтборПодразделение) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И CRM_БизнесПроцесс.Подразделение = &ОтборПодразделение";
		КонецЕсли;
		//Если ЗначениеЗаполнено(Форма.ПользовательПодразделение) Тогда
		//	Если ТипЗнч(Форма.ПользовательПодразделение) = Тип("СправочникСсылка.Пользователи") Тогда
		//		ТекстЗапроса = ТекстЗапроса + "
		//		|	И CRM_БизнесПроцесс.Ответственный = &ПользовательПодразделение";
		//	КонецЕсли;
		//	Если ТипЗнч(Форма.ПользовательПодразделение) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		//		ТекстЗапроса = ТекстЗапроса + "
		//		|	И CRM_БизнесПроцесс.Подразделение = &ПользовательПодразделение";
		//	КонецЕсли;
		//КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	{ГДЕ CRM_БизнесПроцесс.Ссылка КАК ОтборБизнесПроцесс} 
		|СГРУППИРОВАТЬ ПО
		|	CRM_БизнесПроцесс.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ВсеБизнесПроцессы.БизнесПроцесс.Завершен
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Активные,
		|	СУММА(ВЫБОР
		|			КОГДА ВсеБизнесПроцессы.БизнесПроцесс.Завершен
		|					И ВсеБизнесПроцессы.БизнесПроцесс.ВариантЗавершения = ЗНАЧЕНИЕ(Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Успешно)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Успешно,
		|	СУММА(ВЫБОР
		|			КОГДА ВсеБизнесПроцессы.БизнесПроцесс.Завершен
		|					И ВсеБизнесПроцессы.БизнесПроцесс.ВариантЗавершения = ЗНАЧЕНИЕ(Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Неудачно,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ВсеБизнесПроцессы.БизнесПроцесс.Завершен
		|				ТОГДА ВсеБизнесПроцессы.БизнесПроцесс.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК АктивныеСумма,
		|	СУММА(ВЫБОР
		|			КОГДА ВсеБизнесПроцессы.БизнесПроцесс.Завершен
		|					И ВсеБизнесПроцессы.БизнесПроцесс.ВариантЗавершения = ЗНАЧЕНИЕ(Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Успешно)
		|				ТОГДА ВсеБизнесПроцессы.БизнесПроцесс.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК УспешноСумма,
		|	СУММА(ВЫБОР
		|			КОГДА ВсеБизнесПроцессы.БизнесПроцесс.Завершен
		|					И ВсеБизнесПроцессы.БизнесПроцесс.ВариантЗавершения = ЗНАЧЕНИЕ(Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно)
		|				ТОГДА ВсеБизнесПроцессы.БизнесПроцесс.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеудачноСумма,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ВсеБизнесПроцессы.БизнесПроцесс.Завершен
		|				ТОГДА ВсеБизнесПроцессы.ДлительностьБизнесПроцесса
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК АктивныеДлительность,
		|	СУММА(ВЫБОР
		|			КОГДА ВсеБизнесПроцессы.БизнесПроцесс.Завершен
		|					И ВсеБизнесПроцессы.БизнесПроцесс.ВариантЗавершения = ЗНАЧЕНИЕ(Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Успешно)
		|				ТОГДА ВсеБизнесПроцессы.ДлительностьБизнесПроцесса
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК УспешноДлительность,
		|	СУММА(ВЫБОР
		|			КОГДА ВсеБизнесПроцессы.БизнесПроцесс.Завершен
		|					И ВсеБизнесПроцессы.БизнесПроцесс.ВариантЗавершения = ЗНАЧЕНИЕ(Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно)
		|				ТОГДА ВсеБизнесПроцессы.ДлительностьБизнесПроцесса
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеудачноДлительность
		|ПОМЕСТИТЬ АктивныеУспешныеНеудачныеБизнесПроцессы
		|ИЗ
		|	ВсеБизнесПроцессы КАК ВсеБизнесПроцессы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсеБизнесПроцессы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачаИсполнителя.Ссылка,
		|	ВЫБОР
		|		КОГДА НЕ ЗадачаИсполнителя.Выполнена
		|			ТОГДА 2
		|		КОГДА ЗадачаИсполнителя.CRM_Неудача
		|			ТОГДА 0
		|		КОГДА НЕ ЗадачаИсполнителя.CRM_Неудача
		|			ТОГДА 1
		|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
		|	ЭтапыТочекМаршрута.Этап,
		|	ЗадачаИсполнителя.CRM_ТочкаМаршрута,
		|	ЗадачаИсполнителя.CRM_Итерация,
		|	ЗадачаИсполнителя.БизнесПроцесс,
		|		ВЫБОР
		|			КОГДА ЗадачаИсполнителя.Выполнена
		|				ТОГДА РАЗНОСТЬДАТ(ЗадачаИсполнителя.ДатаНачала, ЗадачаИсполнителя.ДатаИсполнения, МИНУТА)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ВремяВыполненияВМинутах,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КалендарныйГрафик.ДатаГрафика) КАК ВремяВыполненияВДнях
		|ПОМЕСТИТЬ ЭтапыИЗадачи
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|		ЛЕВОЕ СОЕДИНЕНИЕ КалендарныйГрафик КАК КалендарныйГрафик
		|		ПО ЗадачаИсполнителя.ДатаНачала <= КалендарныйГрафик.ДатаГрафика
		|			И (ВЫБОР
		|				КОГДА ЗадачаИсполнителя.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА &ТекущаяДата
		|				ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения
		|			КОНЕЦ >= КалендарныйГрафик.ДатаГрафика)
		|			И (КалендарныйГрафик.ДеньВключенВГрафик)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		|		ПО ЗадачаИсполнителя.CRM_ТочкаМаршрута = ЭтапыТочекМаршрута.ТочкаМаршрута
		|ГДЕ
		|	ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
		|	И ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
		|	И НЕ ЗадачаИсполнителя.CRM_Переадресована
		|	И ЗадачаИсполнителя.БизнесПроцесс.Стартован
		|		И НЕ ЗадачаИсполнителя.БизнесПроцесс.Завершен
		|		И ВЫБОР
		|			КОГДА НЕ ЗадачаИсполнителя.Выполнена
		|				ТОГДА ЗадачаИсполнителя.СрокИсполнения <= &ГоризонтВоронки
		|						И ЗадачаИсполнителя.Дата <= &КонецПериода
		|			ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения МЕЖДУ &НачалоПериода И &КонецПериода
		|		КОНЕЦ
		|	{ГДЕ ЗадачаИсполнителя.БизнесПроцесс КАК ОтборБизнесПроцесс}
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаИсполнителя.Ссылка,
		|	ЭтапыТочекМаршрута.Этап,
		|	ЗадачаИсполнителя.CRM_ТочкаМаршрута,
		|	ЗадачаИсполнителя.CRM_Итерация,
		|	ЗадачаИсполнителя.БизнесПроцесс,
		|	ВЫБОР
		|		КОГДА НЕ ЗадачаИсполнителя.Выполнена
		|			ТОГДА 2
		|		КОГДА ЗадачаИсполнителя.CRM_Неудача
		|			ТОГДА 0
		|		КОГДА НЕ ЗадачаИсполнителя.CRM_Неудача
		|			ТОГДА 1
		|	КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ЗадачаИсполнителя.Выполнена
		|				ТОГДА РАЗНОСТЬДАТ(ЗадачаИсполнителя.ДатаНачала, ЗадачаИсполнителя.ДатаИсполнения, МИНУТА)
		|			ИНАЧЕ 0
		|		КОНЕЦ 
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Проекты.Ссылка КАК Проект
		|ПОМЕСТИТЬ ПроектыПоКартам
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.CRM_КартаМаршрута В(&КартыМаршрута)
		|	И НЕ Проекты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПроектыПоКартам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Исполнитель,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.КартаМаршрута,
		|	ВложенныйЗапрос.Этап,
		|	ВложенныйЗапрос.АктивнаяУспешноНеУдачно,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.Количество) КАК Количество,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	СУММА(ВложенныйЗапрос.ВремяВыполненияВДнях) КАК ВремяВыполненияВДнях
		|ПОМЕСТИТЬ ВсеБП
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЭтапыИЗадачи.Ссылка.Исполнитель КАК Исполнитель,
		|		ИтерацииЗадач.БизнесПроцесс.Подразделение КАК Подразделение,
		|		ИтерацииЗадач.БизнесПроцесс.КартаМаршрута КАК КартаМаршрута,
		|		ЭтапыИЗадачи.Этап КАК Этап,
		|		ЭтапыИЗадачи.АктивнаяУспешноНеУдачно КАК АктивнаяУспешноНеУдачно,
		|		ЭтапыИЗадачи.ВремяВыполненияВДнях КАК ВремяВыполненияВДнях,
		|		ИтерацииЗадач.БизнесПроцесс КАК Количество,
		|		ИтерацииЗадач.БизнесПроцесс.Сумма КАК Сумма
		|	ИЗ
		|		ИтерацииЗадач КАК ИтерацииЗадач
		|			ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыИЗадачи КАК ЭтапыИЗадачи
		|			ПО ИтерацииЗадач.БизнесПроцесс = ЭтапыИЗадачи.БизнесПроцесс
		|				И ИтерацииЗадач.CRM_ТочкаМаршрута = ЭтапыИЗадачи.CRM_ТочкаМаршрута
		|				И ИтерацииЗадач.CRM_Итерация = ЭтапыИЗадачи.CRM_Итерация
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЭтапыБизнесПроцессыУспешно.БизнесПроцесс.Ответственный,
		|		ЭтапыБизнесПроцессыУспешно.БизнесПроцесс.Подразделение,
		|		ЭтапыБизнесПроцессыУспешно.БизнесПроцесс.КартаМаршрута,
		|		ЭтапыБизнесПроцессыУспешно.Этап,
		|		1,
		|		0,
		|		ЭтапыБизнесПроцессыУспешно.БизнесПроцесс,
		|		ЭтапыБизнесПроцессыУспешно.БизнесПроцесс.Сумма
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЭтапыТочекМаршрута.Этап КАК Этап,
		|			CRM_БизнесПроцесс.Ссылка КАК БизнесПроцесс
		|		ИЗ
		|			ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		|				ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
		|				ПО ЭтапыТочекМаршрута.КартаМаршрута = CRM_БизнесПроцесс.КартаМаршрута
		|		ГДЕ
		|			CRM_БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|			И НЕ CRM_БизнесПроцесс.ПометкаУдаления
		|			И CRM_БизнесПроцесс.Завершен
		|			И CRM_БизнесПроцесс.ВариантЗавершения = ЗНАЧЕНИЕ(Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Успешно)
		|			И CRM_БизнесПроцесс.ДатаЗавершения МЕЖДУ &НачалоПериода И &КонецПериода) КАК ЭтапыБизнесПроцессыУспешно
		|	ГДЕ
		|		ЭтапыБизнесПроцессыУспешно.БизнесПроцесс ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
		|			И НЕ ЭтапыБизнесПроцессыУспешно.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.CRM_БизнесПроцесс.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЭтапыБизнесПроцессыДосрочно.БизнесПроцесс.Ответственный,
		|		ЭтапыБизнесПроцессыДосрочно.БизнесПроцесс.Подразделение,
		|		ЭтапыБизнесПроцессыДосрочно.БизнесПроцесс.КартаМаршрута,
		|		ЭтапыБизнесПроцессыДосрочно.Этап,
		|		0,
		|		0,
		|		ЭтапыБизнесПроцессыДосрочно.БизнесПроцесс,
		|		ЭтапыБизнесПроцессыДосрочно.БизнесПроцесс.Сумма
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЭтапыТочекМаршрута.Этап КАК Этап,
		|			CRM_БизнесПроцесс.Ссылка КАК БизнесПроцесс
		|		ИЗ
		|			ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		|				ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
		|				ПО ЭтапыТочекМаршрута.КартаМаршрута = CRM_БизнесПроцесс.КартаМаршрута
		|					И ЭтапыТочекМаршрута.ТочкаМаршрута = CRM_БизнесПроцесс.ЭтапДосрочногоЗавершения
		|		ГДЕ
		|			CRM_БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|			И НЕ CRM_БизнесПроцесс.ПометкаУдаления
		|			И CRM_БизнесПроцесс.Завершен
		|			И CRM_БизнесПроцесс.ЗавершенДосрочно
		|			И CRM_БизнесПроцесс.ВариантЗавершения = ЗНАЧЕНИЕ(Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно)
		|			И CRM_БизнесПроцесс.ДатаЗавершения МЕЖДУ &НачалоПериода И &КонецПериода) КАК ЭтапыБизнесПроцессыДосрочно
		|	ГДЕ
		|		ЭтапыБизнесПроцессыДосрочно.БизнесПроцесс ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
		|			И НЕ ЭтапыБизнесПроцессыДосрочно.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.CRM_БизнесПроцесс.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЭтапыБизнесПроцессыНеудачно.БизнесПроцесс.Ответственный,
		|		ЭтапыБизнесПроцессыНеудачно.БизнесПроцесс.Подразделение,
		|		ЭтапыБизнесПроцессыНеудачно.БизнесПроцесс.КартаМаршрута,
		|		ЭтапыБизнесПроцессыНеудачно.Этап,
		|		0,
		|		0,
		|		ЭтапыБизнесПроцессыНеудачно.БизнесПроцесс,
		|		ЭтапыБизнесПроцессыНеудачно.БизнесПроцесс.Сумма
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЭтапыТочекМаршрута.Этап КАК Этап,
		|			ПоследняяЗадача.БизнесПроцессСсылка КАК БизнесПроцесс
		|		ИЗ
		|			ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|					ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута КАК БизнесПроцессКартаМаршрута,
		|					ВЫРАЗИТЬ(ЗадачаИсполнителя.БизнесПроцесс.Ссылка КАК БизнесПроцесс.CRM_БизнесПроцесс) КАК БизнесПроцессСсылка,
		|					ЗадачаИсполнителя.CRM_ТочкаМаршрута КАК CRM_ТочкаМаршрута
		|				ИЗ
		|					Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|				ГДЕ
		|					ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|					И НЕ ЗадачаИсполнителя.БизнесПроцесс.ПометкаУдаления
		|					И ЗадачаИсполнителя.БизнесПроцесс.Завершен
		|					И НЕ ЗадачаИсполнителя.БизнесПроцесс.ЗавершенДосрочно
		|					И ЗадачаИсполнителя.БизнесПроцесс.ВариантЗавершения = ЗНАЧЕНИЕ(Справочник.CRM_ВариантыЗавершенияБизнесПроцесса.Неудачно)
		|					И ЗадачаИсполнителя.БизнесПроцесс.ДатаЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
		|				{ГДЕ ЗадачаИсполнителя.БизнесПроцесс КАК ОтборБизнесПроцесс}
		|				УПОРЯДОЧИТЬ ПО
		|					ЗадачаИсполнителя.ДатаИсполнения УБЫВ) КАК ПоследняяЗадача
		|				ПО ЭтапыТочекМаршрута.КартаМаршрута = ПоследняяЗадача.БизнесПроцессКартаМаршрута
		|					И ЭтапыТочекМаршрута.ТочкаМаршрута = ПоследняяЗадача.CRM_ТочкаМаршрута) КАК ЭтапыБизнесПроцессыНеудачно
		|	ГДЕ
		|		ЭтапыБизнесПроцессыНеудачно.БизнесПроцесс ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
		|			И НЕ ЭтапыБизнесПроцессыНеудачно.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.CRM_БизнесПроцесс.ПустаяСсылка)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Исполнитель,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.КартаМаршрута,
		|	ВложенныйЗапрос.Этап,
		|	ВложенныйЗапрос.АктивнаяУспешноНеУдачно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИтерацииЗадач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЭтапыИЗадачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеБП.Исполнитель КАК Исполнитель,
		|	ВсеБП.Подразделение КАК Подразделение,
		|	ВсеБП.КартаМаршрута КАК КартаМаршрута,
		|	ВсеБП.Этап КАК Этап,
		|	ВсеБП.АктивнаяУспешноНеУдачно КАК АктивнаяУспешноНеУдачно,
		|	ВсеБП.Количество КАК Количество,
		|	ВсеБП.ВремяВыполненияВДнях КАК ВремяВыполненияВДнях,
		|	ВсеБП.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВсеУспешные
		|ИЗ
		|	ВсеБП КАК ВсеБП
		|ГДЕ
		|	ВсеБП.АктивнаяУспешноНеУдачно = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеБП.Исполнитель КАК Исполнитель,
		|	ВсеБП.Подразделение КАК Подразделение,
		|	ВсеБП.КартаМаршрута КАК КартаМаршрута,
		|	ВсеБП.Этап КАК Этап,
		|	ВсеБП.АктивнаяУспешноНеУдачно КАК АктивнаяУспешноНеУдачно,
		|	ВсеБП.Количество КАК Количество,
		|	ВсеБП.ВремяВыполненияВДнях КАК ВремяВыполненияВДнях,
		|	ВсеБП.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВсеНеУдачные
		|ИЗ
		|	ВсеБП КАК ВсеБП
		|ГДЕ
		|	ВсеБП.АктивнаяУспешноНеУдачно = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеБП.Исполнитель КАК Исполнитель,
		|	ВсеБП.Подразделение КАК Подразделение,
		|	ВсеБП.КартаМаршрута КАК КартаМаршрута,
		|	ВсеБП.Этап КАК Этап,
		|	ВсеБП.АктивнаяУспешноНеУдачно КАК АктивнаяУспешноНеУдачно,
		|	ВсеБП.Количество КАК Количество,
		|	ВсеБП.ВремяВыполненияВДнях КАК ВремяВыполненияВДнях,
		|	ВсеБП.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВсеАктивные
		|ИЗ
		|	ВсеБП КАК ВсеБП
		|ГДЕ
		|	ВсеБП.АктивнаяУспешноНеУдачно = 2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсеБП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Пользователь,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.КартаМаршрута,
		|	ВложенныйЗапрос.Этап,
		|	СУММА(ВложенныйЗапрос.КоличествоЗадач) КАК КоличествоЗадач
		|ПОМЕСТИТЬ ЭтапыКоличествоЗадачВрем
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗадачаИсполнителя.Исполнитель КАК Пользователь,
		|		ЗадачаИсполнителя.БизнесПроцесс.Подразделение КАК Подразделение,
		|		ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута КАК КартаМаршрута,
		|		ЭтапыТочекМаршрута.Этап КАК Этап,
		|		1 КАК КоличествоЗадач
		|	ИЗ
		|		Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|			ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		|			ПО (ЭтапыТочекМаршрута.ВидТочкиМаршрута = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыТочекМаршрута.Действие))
		|				И ЗадачаИсполнителя.CRM_ТочкаМаршрута = ЭтапыТочекМаршрута.ТочкаМаршрута
		|	ГДЕ
		|		ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
		|		И ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|		И НЕ ЗадачаИсполнителя.ПометкаУдаления
		|		И НЕ ЗадачаИсполнителя.CRM_Переадресована
		|		И ЗадачаИсполнителя.БизнесПроцесс.Стартован
		|		И НЕ ЗадачаИсполнителя.БизнесПроцесс.Завершен
		|		И ВЫБОР
		|				КОГДА НЕ ЗадачаИсполнителя.Выполнена
		|					ТОГДА ЗадачаИсполнителя.СрокИсполнения <= &ГоризонтВоронки
		|							И ЗадачаИсполнителя.Дата <= &КонецПериода
		|				ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения МЕЖДУ &НачалоПериода И &КонецПериода
		|			КОНЕЦ
		|	    {ГДЕ ЗадачаИсполнителя.БизнесПроцесс КАК ОтборБизнесПроцесс}
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_БизнесПроцесс.Ответственный,
		|		CRM_БизнесПроцесс.Подразделение,
		|		CRM_БизнесПроцесс.КартаМаршрута,
		|		ЭтапыТочекМаршрута.Этап,
		|		1
		|	ИЗ
		|		ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		|			ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
		|			ПО ЭтапыТочекМаршрута.КартаМаршрута = CRM_БизнесПроцесс.КартаМаршрута
		|	ГДЕ
		|		НЕ CRM_БизнесПроцесс.ПометкаУдаления
		|		И CRM_БизнесПроцесс.Завершен
		|		И CRM_БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|		И CRM_БизнесПроцесс.ДатаЗавершения МЕЖДУ &НачалоПериода И &КонецПериода) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Пользователь,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.КартаМаршрута,
		|	ВложенныйЗапрос.Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ИтогоСделок) КАК ИтогоСделок
		|ПОМЕСТИТЬ ЭтапыКоличествоСделок
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗадачаИсполнителя.БизнесПроцесс КАК ИтогоСделок
		|	ИЗ
		|		Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|	ГДЕ
		|		ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
		|		И ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|		И НЕ ЗадачаИсполнителя.ПометкаУдаления
		|		И НЕ ЗадачаИсполнителя.CRM_Переадресована
		|		И ЗадачаИсполнителя.БизнесПроцесс.Стартован
		|		И НЕ ЗадачаИсполнителя.БизнесПроцесс.Завершен
		|		И ВЫБОР
		|				КОГДА НЕ ЗадачаИсполнителя.Выполнена
		|					ТОГДА ЗадачаИсполнителя.СрокИсполнения <= &ГоризонтВоронки
		|							И ЗадачаИсполнителя.Дата <= &КонецПериода
		|				ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения МЕЖДУ &НачалоПериода И &КонецПериода
		|			КОНЕЦ
		|	    {ГДЕ ЗадачаИсполнителя.БизнесПроцесс КАК ОтборБизнесПроцесс}
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_БизнесПроцесс.Ссылка
		|	ИЗ
		|		БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
		|	ГДЕ
		|		НЕ CRM_БизнесПроцесс.ПометкаУдаления
		|		И CRM_БизнесПроцесс.Завершен
		|		И CRM_БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
		|		И CRM_БизнесПроцесс.ДатаЗавершения МЕЖДУ &НачалоПериода И &КонецПериода) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЭтапыТочекМаршрута
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭтапыКоличествоЗадачВрем.Пользователь КАК Пользователь,
		|	ЭтапыКоличествоЗадачВрем.Подразделение КАК Подразделение,
		|	ЭтапыКоличествоЗадачВрем.КартаМаршрута КАК КартаМаршрута,
		|	ЭтапыКоличествоСделок.ИтогоСделок КАК ИтогоСделок,
		|	ЭтапыКоличествоЗадачВрем.Этап КАК Этап,
		|	ЭтапыКоличествоЗадачВрем.КоличествоЗадач КАК КоличествоЗадач
		|ПОМЕСТИТЬ ЭтапыКоличествоЗадач
		|ИЗ
		|	ЭтапыКоличествоЗадачВрем КАК ЭтапыКоличествоЗадачВрем
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыКоличествоСделок КАК ЭтапыКоличествоСделок
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЭтапыКоличествоЗадачВрем
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЭтапыКоличествоСделок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭтапыКоличествоЗадач.Пользователь КАК Пользователь,
		|	ЭтапыКоличествоЗадач.Подразделение КАК Подразделение,
		|	ЭтапыКоличествоЗадач.КартаМаршрута КАК КартаМаршрута,
		|	ЭтапыКоличествоЗадач.ИтогоСделок КАК ИтогоСделок,
		|	ЭтапыКоличествоЗадач.Этап КАК Этап,
		|	ЭтапыКоличествоЗадач.КоличествоЗадач КАК КоличествоЗадач,
		|	ЕСТЬNULL(ВсеАктивные.ВремяВыполненияВДнях, 0) КАК ВремяВыполненияВДняхАктивные,
		|	ЕСТЬNULL(ВсеАктивные.Количество, 0) КАК КоличествоАктивные,
		|	ЕСТЬNULL(ВсеАктивные.Сумма, 0) КАК СуммаАктивные
		|ПОМЕСТИТЬ ЭтапыКоличествоЗадачАктивные
		|ИЗ
		|	ЭтапыКоличествоЗадач КАК ЭтапыКоличествоЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеАктивные КАК ВсеАктивные
		|		ПО ЭтапыКоличествоЗадач.Пользователь = ВсеАктивные.Исполнитель
		|			И ЭтапыКоличествоЗадач.Подразделение = ВсеАктивные.Подразделение
		|			И ЭтапыКоличествоЗадач.КартаМаршрута = ВсеАктивные.КартаМаршрута
		|			И ЭтапыКоличествоЗадач.Этап = ВсеАктивные.Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсеАктивные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЭтапыКоличествоЗадач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭтапыКоличествоЗадачАктивные.Пользователь КАК Пользователь,
		|	ЭтапыКоличествоЗадачАктивные.Подразделение КАК Подразделение,
		|	ЭтапыКоличествоЗадачАктивные.КартаМаршрута КАК КартаМаршрута,
		|	ЭтапыКоличествоЗадачАктивные.ИтогоСделок КАК ИтогоСделок,
		|	ЭтапыКоличествоЗадачАктивные.Этап КАК Этап,
		|	ЭтапыКоличествоЗадачАктивные.КоличествоЗадач КАК КоличествоЗадач,
		|	ЭтапыКоличествоЗадачАктивные.ВремяВыполненияВДняхАктивные,
		|	ЭтапыКоличествоЗадачАктивные.КоличествоАктивные КАК КоличествоАктивные,
		|	ЭтапыКоличествоЗадачАктивные.СуммаАктивные КАК СуммаАктивные,
		|	ЕСТЬNULL(ВсеУспешные.ВремяВыполненияВДнях, 0) КАК ВремяВыполненияВДняхУспешно,
		|	ЕСТЬNULL(ВсеУспешные.Количество, 0) КАК КоличествоУспешные,
		|	ЕСТЬNULL(ВсеУспешные.Сумма, 0) КАК СуммаУспешные
		|ПОМЕСТИТЬ ЭтапыКоличествоЗадачАктивныеУспешные
		|ИЗ
		|	ЭтапыКоличествоЗадачАктивные КАК ЭтапыКоличествоЗадачАктивные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеУспешные КАК ВсеУспешные
		|		ПО ЭтапыКоличествоЗадачАктивные.Пользователь = ВсеУспешные.Исполнитель
		|			И ЭтапыКоличествоЗадачАктивные.Подразделение = ВсеУспешные.Подразделение
		|			И ЭтапыКоличествоЗадачАктивные.КартаМаршрута = ВсеУспешные.КартаМаршрута
		|			И ЭтапыКоличествоЗадачАктивные.Этап = ВсеУспешные.Этап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЭтапыКоличествоЗадачАктивные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсеУспешные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭтапыКоличествоЗадачАктивныеУспешные.Пользователь КАК Пользователь,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.Подразделение КАК Подразделение,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.Подразделение.CRM_Офис КАК Офис,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.КартаМаршрута КАК КартаМаршрута,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.ИтогоСделок КАК ИтогоСделок,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.Этап КАК Этап,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.КоличествоЗадач КАК КоличествоЗадач,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.КоличествоАктивные КАК КоличествоАктивные,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.СуммаАктивные КАК СуммаАктивные,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.КоличествоУспешные КАК КоличествоУспешно,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.СуммаУспешные КАК СуммаУспешно,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.ВремяВыполненияВДняхУспешно,
		|	ЭтапыКоличествоЗадачАктивныеУспешные.ВремяВыполненияВДняхАктивные,
		|	ЕСТЬNULL(ВсеНеУдачные.Количество, 0) КАК КоличествоНеудачно,
		|	ЕСТЬNULL(ВсеНеУдачные.Сумма, 0) КАК СуммаНеудачно,
		|	ЕСТЬNULL(ВсеНеУдачные.ВремяВыполненияВДнях, 0) КАК ВремяВыполненияВДняхНеудачно,
		|	АктивныеУспешныеНеудачныеБизнесПроцессы.Активные КАК АктивныеИтог,
		|	АктивныеУспешныеНеудачныеБизнесПроцессы.Успешно КАК УспешноИтог,
		|	АктивныеУспешныеНеудачныеБизнесПроцессы.Неудачно КАК НеудачноИтог,
		|	АктивныеУспешныеНеудачныеБизнесПроцессы.АктивныеДлительность КАК АктивныеДлительность,
		|	АктивныеУспешныеНеудачныеБизнесПроцессы.УспешноДлительность КАК УспешноДлительность,
		|	АктивныеУспешныеНеудачныеБизнесПроцессы.НеудачноДлительность КАК НеудачноДлительность,
		|	АктивныеУспешныеНеудачныеБизнесПроцессы.АктивныеСумма КАК АктивныеСуммаИтог,
		|	АктивныеУспешныеНеудачныеБизнесПроцессы.УспешноСумма КАК УспешноСуммаИтог,
		|	АктивныеУспешныеНеудачныеБизнесПроцессы.НеудачноСумма КАК НеудачноСуммаИтог
		|ПОМЕСТИТЬ ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные
		|ИЗ
		|	ЭтапыКоличествоЗадачАктивныеУспешные КАК ЭтапыКоличествоЗадачАктивныеУспешные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеНеУдачные КАК ВсеНеУдачные
		|		ПО ЭтапыКоличествоЗадачАктивныеУспешные.Пользователь = ВсеНеУдачные.Исполнитель
		|			И ЭтапыКоличествоЗадачАктивныеУспешные.Подразделение = ВсеНеУдачные.Подразделение
		|			И ЭтапыКоличествоЗадачАктивныеУспешные.КартаМаршрута = ВсеНеУдачные.КартаМаршрута
		|			И ЭтапыКоличествоЗадачАктивныеУспешные.Этап = ВсеНеУдачные.Этап
		|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеУспешныеНеудачныеБизнесПроцессы КАК АктивныеУспешныеНеудачныеБизнесПроцессы
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ АктивныеУспешныеНеудачныеБизнесПроцессы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВсеНеУдачные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ЭтапыКоличествоЗадачАктивныеУспешные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		
	КонецЕсли;
	
	Если Форма.ЕстьЭтапыПоДокументам Тогда
		
		СоответствияПараметровЗапросаПоДокументам = Новый Соответствие;
		
		ТекстЗапросаПоДокументам = "";
		
		Для Каждого ЭтапВоронки ИЗ Форма.ЭтапыТекущейВоронки Цикл
			Если ЭтапВоронки.Этап.ВидЭтапа = Перечисления.CRM_ВидыЭтаповВоронкиПродаж.ПоДокументам Тогда
				
				ИмяПараметраЭтапа = "_"+СтрЗаменить(ЭтапВоронки.Этап.УникальныйИдентификатор(),"-","_");
				СоответствияПараметровЗапросаПоДокументам.Вставить(ИмяПараметраЭтапа,ЭтапВоронки.Этап);
				
				СписокИменИтоговыхТаблиц = Новый СписокЗначений;
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = "";
				
				Для Каждого ЭлементЭтапа ИЗ ЭтапВоронки.Состав Цикл
					
					КартаМаршрутаЭлемента	= ЭлементЭтапа.КартаМаршрута;
					ЭтапЭлемента			= ЭтапВоронки.Этап;
					МассивТипов				= ЭлементЭтапа.ТочкаМаршрута.ТипЗначения.Типы();
					
					
					Для Каждого ТипДокумента ИЗ МассивТипов Цикл
						
						МетаданныеДокумента		= Метаданные.НайтиПоТипу(ТипДокумента);
						ПолноеИмяДокумента		= МетаданныеДокумента.ПолноеИмя();
						ПредставлениеТаблицы	= СтрЗаменить(ПолноеИмяДокумента,"Документ.","");
						
						Если ТипДокумента = Тип("ДокументСсылка.CRM_РассылкаЭлектронныхПисем") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	CRM_РассылкаЭлектронныхПисем.Ссылка КАК Рассылка,
							|	ПредметыПапкиВзаимодействий.Взаимодействие КАК Письмо
							|ПОМЕСТИТЬ РассылкаПисьма
							|ИЗ
							|	Документ.CRM_РассылкаЭлектронныхПисем КАК CRM_РассылкаЭлектронныхПисем
							|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
							|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
							|			ПО (ПредметыПапкиВзаимодействий.Взаимодействие = ЭлектронноеПисьмоИсходящее.Ссылка)
							|		ПО CRM_РассылкаЭлектронныхПисем.Ссылка = ПредметыПапкиВзаимодействий.Предмет
							|ГДЕ
							|	НЕ CRM_РассылкаЭлектронныхПисем.ПометкаУдаления
							|	И CRM_РассылкаЭлектронныхПисем.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|
							|{ГДЕ CRM_РассылкаЭлектронныхПисем.Ссылка КАК ОтборДокумент}
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	1 КАК КоличествоЗадач,
							|	РассылкаПисьма.Рассылка.Ответственный КАК Пользователь,
							|	РассылкаПисьма.Рассылка.ПодразделениеЗаказчик КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	РассылкаПисьма.Письмо КАК ИтогоСделок,
							|	&"+ИмяПараметраЭтапа+" КАК Этап
							|ПОМЕСТИТЬ КоличествоРассылка
							|ИЗ
							|	РассылкаПисьма КАК РассылкаПисьма
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	КоличествоРассылка.Пользователь,
							|	КоличествоРассылка.Подразделение,
							|	КоличествоРассылка.Этап,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоРассылка.ИтогоСделок) КАК ИтогоСделок,
							|	СУММА(КоличествоРассылка.КоличествоЗадач) КАК КоличествоЗадач,
							|	КоличествоРассылка.КартаМаршрута
							|ПОМЕСТИТЬ КоличествоРассылкаСгруппировано
							|ИЗ
							|	КоличествоРассылка КАК КоличествоРассылка
							|
							|СГРУППИРОВАТЬ ПО
							|	КоличествоРассылка.Пользователь,
							|	КоличествоРассылка.Подразделение,
							|	КоличествоРассылка.КартаМаршрута,
							|	КоличествоРассылка.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоличествоРассылка
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	РассылкаПисьма.Рассылка.Ответственный КАК Пользователь,
							|	РассылкаПисьма.Рассылка.ПодразделениеЗаказчик КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	0 КАК Сумма,
							|	1 КАК АктивнаяУспешноНеУдачно,
							|	РассылкаПисьма.Письмо КАК Ссылка
							|ПОМЕСТИТЬ ВсеСостоянияРассылка
							|ИЗ
							|	РассылкаПисьма КАК РассылкаПисьма
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ РассылкаПисьма
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСостоянияРассылка.Пользователь,
							|	ВсеСостоянияРассылка.Подразделение,
							|	ВсеСостоянияРассылка.КартаМаршрута,
							|	ВсеСостоянияРассылка.Этап,
							|	ВсеСостоянияРассылка.АктивнаяУспешноНеУдачно,
							|	СУММА(ВсеСостоянияРассылка.Сумма) КАК Сумма,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеСостоянияРассылка.Ссылка) КАК Количество
							|ПОМЕСТИТЬ ВсеРассылкаСгруппированные
							|ИЗ
							|	ВсеСостоянияРассылка КАК ВсеСостоянияРассылка
							|
							|СГРУППИРОВАТЬ ПО
							|	ВсеСостоянияРассылка.Пользователь,
							|	ВсеСостоянияРассылка.Подразделение,
							|	ВсеСостоянияРассылка.КартаМаршрута,
							|	ВсеСостоянияРассылка.Этап,
							|	ВсеСостоянияРассылка.АктивнаяУспешноНеУдачно
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеСостоянияРассылка
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеРассылкаСгруппированные.Пользователь,
							|	ВсеРассылкаСгруппированные.Подразделение,
							|	ВсеРассылкаСгруппированные.КартаМаршрута,
							|	ВсеРассылкаСгруппированные.Этап,
							|	ВсеРассылкаСгруппированные.Сумма,
							|	ВсеРассылкаСгруппированные.Количество
							|ПОМЕСТИТЬ РассылкаВсеУспешные
							|ИЗ
							|	ВсеРассылкаСгруппированные КАК ВсеРассылкаСгруппированные
							|ГДЕ
							|	ВсеРассылкаСгруппированные.АктивнаяУспешноНеУдачно = 1
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеРассылкаСгруппированные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	КоличествоРассылкаСгруппировано.Пользователь,
							|	КоличествоРассылкаСгруппировано.Подразделение,
							|	КоличествоРассылкаСгруппировано.КартаМаршрута,
							|	КоличествоРассылкаСгруппировано.Этап,
							|	КоличествоРассылкаСгруппировано.ИтогоСделок,
							|	КоличествоРассылкаСгруппировано.КоличествоЗадач,
							|	ЕСТЬNULL(РассылкаВсеУспешные.Количество, 0) КАК КоличествоУспешно,
							|	ЕСТЬNULL(РассылкаВсеУспешные.Сумма, 0) КАК СуммаУспешно,
							|	0 КАК КоличествоНеудачно,
							|	0 КАК СуммаНеудачно,
							|	0 КАК КоличествоАктивные,
							|	0 КАК СуммаАктивные,
							|	0 КАК АктивныеИтог,
							|	0 КАК УспешноИтог,
							|	0 КАК НеудачноИтог,
							|	0 КАК АктивныеСуммаИтог,
							|	0 КАК УспешноСуммаИтог,
							|	0 КАК НеудачноСуммаИтог
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"CRM_РассылкаЭлектронныхПисемУспешныеНеудачныеАктивные
							|ИЗ
							|	КоличествоРассылкаСгруппировано КАК КоличествоРассылкаСгруппировано
							|		ЛЕВОЕ СОЕДИНЕНИЕ РассылкаВсеУспешные КАК РассылкаВсеУспешные
							|		ПО КоличествоРассылкаСгруппировано.Пользователь = РассылкаВсеУспешные.Пользователь
							|			И КоличествоРассылкаСгруппировано.Подразделение = РассылкаВсеУспешные.Подразделение
							|			И КоличествоРассылкаСгруппировано.КартаМаршрута = РассылкаВсеУспешные.КартаМаршрута
							|			И КоличествоРассылкаСгруппировано.Этап = РассылкаВсеУспешные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоличествоРассылкаСгруппировано
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ РассылкаВсеУспешные
							|;
							|";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"CRM_РассылкаЭлектронныхПисемУспешныеНеудачныеАктивные");
							
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.CRM_Телемаркетинг") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	1 КАК КоличествоЗадач,
							|	CRM_ТелемаркетингУчастники.Ссылка.Ответственный КАК Пользователь,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	1 КАК ИтогоСделок,
							|	CRM_ТелемаркетингУчастники.Ссылка.ПодразделениеЗаказчик КАК Подразделение,
							|	&"+ИмяПараметраЭтапа+" КАК Этап
							|ПОМЕСТИТЬ ТелемаркетингКоличество
							|ИЗ
							|	Документ.CRM_Телемаркетинг.Участники КАК CRM_ТелемаркетингУчастники
							|ГДЕ
							|	(CRM_ТелемаркетингУчастники.Обработан
							|			ИЛИ CRM_ТелемаркетингУчастники.НеДозвонились)
							|	И НЕ CRM_ТелемаркетингУчастники.Ссылка.ПометкаУдаления
							|	И CRM_ТелемаркетингУчастники.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|
							|{ГДЕ CRM_ТелемаркетингУчастники.Ссылка КАК ОтборДокумент}
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	СУММА(ТелемаркетингКоличество.КоличествоЗадач) КАК КоличествоЗадач,
							|	ТелемаркетингКоличество.Пользователь,
							|	ТелемаркетингКоличество.КартаМаршрута,
							|	СУММА(ТелемаркетингКоличество.ИтогоСделок) КАК ИтогоСделок,
							|	ТелемаркетингКоличество.Подразделение,
							|	ТелемаркетингКоличество.Этап
							|ПОМЕСТИТЬ ТелемаркетингКоличествоСгруппировано
							|ИЗ
							|	ТелемаркетингКоличество КАК ТелемаркетингКоличество
							|
							|СГРУППИРОВАТЬ ПО
							|	ТелемаркетингКоличество.Пользователь,
							|	ТелемаркетингКоличество.Подразделение,
							|	ТелемаркетингКоличество.КартаМаршрута,
							|	ТелемаркетингКоличество.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ТелемаркетингКоличество
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	CRM_ТелемаркетингУчастники.Ссылка.Ответственный КАК Пользователь,
							|	CRM_ТелемаркетингУчастники.Ссылка.ПодразделениеЗаказчик КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	0 КАК Сумма,
							|	ВЫБОР
							|		КОГДА CRM_ТелемаркетингУчастники.Обработан
							|			ТОГДА 1
							|		КОГДА CRM_ТелемаркетингУчастники.НеДозвонились
							|			ТОГДА 0
							|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
							|	CRM_ТелемаркетингУчастники.Ссылка
							|ПОМЕСТИТЬ ТелемаркетингВсеСостояния
							|ИЗ
							|	Документ.CRM_Телемаркетинг.Участники КАК CRM_ТелемаркетингУчастники
							|ГДЕ
							|	НЕ CRM_ТелемаркетингУчастники.Ссылка.ПометкаУдаления
							|	И CRM_ТелемаркетингУчастники.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|	И (CRM_ТелемаркетингУчастники.Обработан
							|			ИЛИ CRM_ТелемаркетингУчастники.НеДозвонились)
							|
							|{ГДЕ CRM_ТелемаркетингУчастники.Ссылка КАК ОтборДокумент}
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ТелемаркетингВсеСостояния.Пользователь,
							|	ТелемаркетингВсеСостояния.Подразделение,
							|	ТелемаркетингВсеСостояния.КартаМаршрута,
							|	ТелемаркетингВсеСостояния.Этап,
							|	СУММА(ТелемаркетингВсеСостояния.Сумма) КАК Сумма,
							|	ТелемаркетингВсеСостояния.АктивнаяУспешноНеУдачно,
							|	КОЛИЧЕСТВО(ТелемаркетингВсеСостояния.Ссылка) КАК Количество
							|ПОМЕСТИТЬ ТелемаркетингВсеСостоянияСгруппировано
							|ИЗ
							|	ТелемаркетингВсеСостояния КАК ТелемаркетингВсеСостояния
							|
							|СГРУППИРОВАТЬ ПО
							|	ТелемаркетингВсеСостояния.Пользователь,
							|	ТелемаркетингВсеСостояния.Подразделение,
							|	ТелемаркетингВсеСостояния.КартаМаршрута,
							|	ТелемаркетингВсеСостояния.Этап,
							|	ТелемаркетингВсеСостояния.АктивнаяУспешноНеУдачно
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ТелемаркетингВсеСостояния
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ТелемаркетингВсеСостоянияСгруппировано.Пользователь,
							|	ТелемаркетингВсеСостоянияСгруппировано.Подразделение,
							|	ТелемаркетингВсеСостоянияСгруппировано.КартаМаршрута,
							|	ТелемаркетингВсеСостоянияСгруппировано.Этап,
							|	ТелемаркетингВсеСостоянияСгруппировано.Сумма,
							|	ТелемаркетингВсеСостоянияСгруппировано.Количество
							|ПОМЕСТИТЬ ТелемаркетингВсеНеУдачные
							|ИЗ
							|	ТелемаркетингВсеСостоянияСгруппировано КАК ТелемаркетингВсеСостоянияСгруппировано
							|ГДЕ
							|	ТелемаркетингВсеСостоянияСгруппировано.АктивнаяУспешноНеУдачно = 0
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ТелемаркетингВсеСостоянияСгруппировано.Пользователь,
							|	ТелемаркетингВсеСостоянияСгруппировано.Подразделение,
							|	ТелемаркетингВсеСостоянияСгруппировано.КартаМаршрута,
							|	ТелемаркетингВсеСостоянияСгруппировано.Этап,
							|	ТелемаркетингВсеСостоянияСгруппировано.Сумма,
							|	ТелемаркетингВсеСостоянияСгруппировано.Количество
							|ПОМЕСТИТЬ ТелемаркетингВсеУспешные
							|ИЗ
							|	ТелемаркетингВсеСостоянияСгруппировано КАК ТелемаркетингВсеСостоянияСгруппировано
							|ГДЕ
							|	ТелемаркетингВсеСостоянияСгруппировано.АктивнаяУспешноНеУдачно = 1
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ТелемаркетингВсеСостоянияСгруппировано
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ТелемаркетингКоличествоСгруппировано.Пользователь,
							|	ТелемаркетингКоличествоСгруппировано.Подразделение,
							|	ТелемаркетингКоличествоСгруппировано.КартаМаршрута,
							|	ТелемаркетингКоличествоСгруппировано.ИтогоСделок,
							|	ТелемаркетингКоличествоСгруппировано.Этап,
							|	ТелемаркетингКоличествоСгруппировано.КоличествоЗадач,
							|	ЕСТЬNULL(ТелемаркетингВсеУспешные.Количество, 0) КАК КоличествоУспешно,
							|	ЕСТЬNULL(ТелемаркетингВсеУспешные.Сумма, 0) КАК СуммаУспешно
							|ПОМЕСТИТЬ ТелемаркетингУспешные
							|ИЗ
							|	ТелемаркетингКоличествоСгруппировано КАК ТелемаркетингКоличествоСгруппировано
							|		ЛЕВОЕ СОЕДИНЕНИЕ ТелемаркетингВсеУспешные КАК ТелемаркетингВсеУспешные
							|		ПО ТелемаркетингКоличествоСгруппировано.Пользователь = ТелемаркетингВсеУспешные.Пользователь
							|			И ТелемаркетингКоличествоСгруппировано.Подразделение = ТелемаркетингВсеУспешные.Подразделение
							|			И ТелемаркетингКоличествоСгруппировано.КартаМаршрута = ТелемаркетингВсеУспешные.КартаМаршрута
							|			И ТелемаркетингКоличествоСгруппировано.Этап = ТелемаркетингВсеУспешные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ТелемаркетингКоличествоСгруппировано
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ТелемаркетингВсеУспешные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ТелемаркетингУспешные.Пользователь,
							|	ТелемаркетингУспешные.Подразделение,
							|	ТелемаркетингУспешные.КартаМаршрута,
							|	ТелемаркетингУспешные.ИтогоСделок,
							|	ТелемаркетингУспешные.Этап,
							|	ТелемаркетингУспешные.КоличествоЗадач,
							|	ТелемаркетингУспешные.КоличествоУспешно,
							|	ТелемаркетингУспешные.СуммаУспешно,
							|	ЕСТЬNULL(ТелемаркетингВсеНеУдачные.Количество, 0) КАК КоличествоНеудачно,
							|	ЕСТЬNULL(ТелемаркетингВсеНеУдачные.Сумма, 0) КАК СуммаНеудачно,
							|	0 КАК КоличествоАктивные,
							|	0 КАК СуммаАктивные,
							|	0 КАК АктивныеИтог,
							|	0 КАК УспешноИтог,
							|	0 КАК НеудачноИтог,
							|	0 КАК АктивныеСуммаИтог,
							|	0 КАК УспешноСуммаИтог,
							|	0 КАК НеудачноСуммаИтог
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"ТелемаркетингУспешныеНеудачныеАктивные
							|ИЗ
							|	ТелемаркетингУспешные КАК ТелемаркетингУспешные
							|		ЛЕВОЕ СОЕДИНЕНИЕ ТелемаркетингВсеНеУдачные КАК ТелемаркетингВсеНеУдачные
							|		ПО ТелемаркетингУспешные.Пользователь = ТелемаркетингВсеНеУдачные.Пользователь
							|			И ТелемаркетингУспешные.Подразделение = ТелемаркетингВсеНеУдачные.Подразделение
							|			И ТелемаркетингУспешные.КартаМаршрута = ТелемаркетингВсеНеУдачные.КартаМаршрута
							|			И ТелемаркетингУспешные.Этап = ТелемаркетингВсеНеУдачные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ТелемаркетингУспешные
							|;
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ТелемаркетингВсеНеУдачные
							|;
							|";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"ТелемаркетингУспешныеНеудачныеАктивные");
							
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	КоммерческоеПредложениеКлиентуЗапасы.Ссылка
							|ПОМЕСТИТЬ КоммерческиеПредложения
							|ИЗ
							|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиентуЗапасы
							|ГДЕ
							|	НЕ КоммерческоеПредложениеКлиентуЗапасы.Ссылка.ПометкаУдаления
							|	И КоммерческоеПредложениеКлиентуЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|	И КоммерческоеПредложениеКлиентуЗапасы.CRM_Утвержден
							|
							|{ГДЕ КоммерческоеПредложениеКлиентуЗапасы.Ссылка.Ссылка КАК ОтборДокумент}
							|
							|СГРУППИРОВАТЬ ПО
							|	КоммерческоеПредложениеКлиентуЗапасы.Ссылка
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	1 КАК КоличествоЗадач,
							|	КоммерческиеПредложения.Ссылка.Менеджер КАК Пользователь,
							|	КоммерческиеПредложения.Ссылка.CRM_Подразделение КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	КоммерческиеПредложения.Ссылка КАК ИтогоСделок
							|ПОМЕСТИТЬ КоличествоКП
							|ИЗ
							|	КоммерческиеПредложения КАК КоммерческиеПредложения
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	СУММА(КоличествоКП.КоличествоЗадач) КАК КоличествоЗадач,
							|	КоличествоКП.Пользователь,
							|	КоличествоКП.Подразделение,
							|	КоличествоКП.КартаМаршрута,
							|	КоличествоКП.Этап,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоКП.ИтогоСделок) КАК ИтогоСделок
							|ПОМЕСТИТЬ КоличествоКПСгруппировано
							|ИЗ
							|	КоличествоКП КАК КоличествоКП
							|
							|СГРУППИРОВАТЬ ПО
							|	КоличествоКП.Пользователь,
							|	КоличествоКП.Подразделение,
							|	КоличествоКП.КартаМаршрута,
							|	КоличествоКП.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоличествоКП
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	КоммерческиеПредложения.Ссылка.Менеджер КАК Пользователь,
							|	КоммерческиеПредложения.Ссылка.CRM_Подразделение КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	ВЫБОР
							|		КОГДА КоммерческиеПредложения.Ссылка.Кратность = 0
							|			ТОГДА КоммерческиеПредложения.Ссылка.СуммаДокумента * КоммерческиеПредложения.Ссылка.Курс / 1
							|		ИНАЧЕ КоммерческиеПредложения.Ссылка.СуммаДокумента * КоммерческиеПредложения.Ссылка.Курс / КоммерческиеПредложения.Ссылка.Кратность
							|	КОНЕЦ КАК Сумма,
							|	1 КАК АктивнаяУспешноНеУдачно,
							|	КоммерческиеПредложения.Ссылка КАК Количество
							|ПОМЕСТИТЬ ВсеСостоянияКП
							|ИЗ
							|	КоммерческиеПредложения КАК КоммерческиеПредложения
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоммерческиеПредложения
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСостоянияКП.Пользователь,
							|	ВсеСостоянияКП.Подразделение,
							|	ВсеСостоянияКП.КартаМаршрута,
							|	ВсеСостоянияКП.Этап,
							|	СУММА(ВсеСостоянияКП.Сумма) КАК Сумма,
							|	ВсеСостоянияКП.АктивнаяУспешноНеУдачно КАК АктивнаяУспешноНеУдачно,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеСостоянияКП.Количество) КАК Количество
							|ПОМЕСТИТЬ ВсеКПСгруппированные
							|ИЗ
							|	ВсеСостоянияКП КАК ВсеСостоянияКП
							|
							|СГРУППИРОВАТЬ ПО
							|	ВсеСостоянияКП.Пользователь,
							|	ВсеСостоянияКП.Подразделение,
							|	ВсеСостоянияКП.КартаМаршрута,
							|	ВсеСостоянияКП.Этап,
							|	ВсеСостоянияКП.АктивнаяУспешноНеУдачно
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеСостоянияКП
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеКПСгруппированные.Пользователь,
							|	ВсеКПСгруппированные.Подразделение,
							|	ВсеКПСгруппированные.КартаМаршрута,
							|	ВсеКПСгруппированные.Этап,
							|	ВсеКПСгруппированные.Сумма,
							|	ВсеКПСгруппированные.АктивнаяУспешноНеУдачно,
							|	ВсеКПСгруппированные.Количество
							|ПОМЕСТИТЬ КПВсеУспешные
							|ИЗ
							|	ВсеКПСгруппированные КАК ВсеКПСгруппированные
							|ГДЕ
							|	ВсеКПСгруппированные.АктивнаяУспешноНеУдачно = 1
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеКПСгруппированные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	КоличествоКПСгруппировано.Пользователь,
							|	КоличествоКПСгруппировано.Подразделение,
							|	КоличествоКПСгруппировано.КартаМаршрута,
							|	КоличествоКПСгруппировано.Этап,
							|	КоличествоКПСгруппировано.КоличествоЗадач,
							|	КоличествоКПСгруппировано.ИтогоСделок,
							|	ЕСТЬNULL(КПВсеУспешные.Количество, 0) КАК КоличествоУспешно,
							|	ЕСТЬNULL(КПВсеУспешные.Сумма, 0) КАК СуммаУспешно,
							|	0 КАК КоличествоНеудачно,
							|	0 КАК СуммаНеудачно,
							|	0 КАК КоличествоАктивные,
							|	0 КАК СуммаАктивные,
							|	0 КАК АктивныеИтог,
							|	0 КАК УспешноИтог,
							|	0 КАК НеудачноИтог,
							|	0 КАК АктивныеСуммаИтог,
							|	0 КАК УспешноСуммаИтог,
							|	0 КАК НеудачноСуммаИтог
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"КПУспешныеНеудачныеАктивные
							|ИЗ
							|	КоличествоКПСгруппировано КАК КоличествоКПСгруппировано
							|		ЛЕВОЕ СОЕДИНЕНИЕ КПВсеУспешные КАК КПВсеУспешные
							|		ПО КоличествоКПСгруппировано.Пользователь = КПВсеУспешные.Пользователь
							|			И КоличествоКПСгруппировано.Подразделение = КПВсеУспешные.Подразделение
							|			И КоличествоКПСгруппировано.КартаМаршрута = КПВсеУспешные.КартаМаршрута
							|			И КоличествоКПСгруппировано.Этап = КПВсеУспешные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоличествоКПСгруппировано
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КПВсеУспешные
							|;
							|";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"КПУспешныеНеудачныеАктивные");
							
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СообщениеSMS") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	1 КАК КоличествоЗадач,
							|	СообщениеSMSАдресаты.Ссылка.Ответственный КАК Пользователь,
							|	СообщениеSMSАдресаты.Ссылка.CRM_ПодразделениеЗаказчик КАК Подразделение,
							|	1 КАК ИтогоСделок,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап
							|ПОМЕСТИТЬ КоличествоСМС
							|ИЗ
							|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
							|ГДЕ
							|	НЕ СообщениеSMSАдресаты.Ссылка.ПометкаУдаления
							|	И СообщениеSMSАдресаты.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|	И СообщениеSMSАдресаты.Ссылка.sms4bТипСообщения = ЗНАЧЕНИЕ(Перечисление.sms4ВходящееИсходящееSMS.Исходящее)
							|	И НЕ СообщениеSMSАдресаты.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументаСообщениеSMS.Черновик)
							|
							|{ГДЕ СообщениеSMSАдресаты.Ссылка КАК ОтборДокумент}
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	СУММА(КоличествоСМС.КоличествоЗадач) КАК КоличествоЗадач,
							|	КоличествоСМС.Пользователь,
							|	КоличествоСМС.КартаМаршрута,
							|	СУММА(КоличествоСМС.ИтогоСделок) КАК ИтогоСделок,
							|	КоличествоСМС.Подразделение,
							|	КоличествоСМС.Этап
							|ПОМЕСТИТЬ КоличествоСМССгруппировано
							|ИЗ
							|	КоличествоСМС КАК КоличествоСМС
							|
							|СГРУППИРОВАТЬ ПО
							|	КоличествоСМС.Пользователь,
							|	КоличествоСМС.Подразделение,
							|	КоличествоСМС.КартаМаршрута,
							|	КоличествоСМС.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоличествоСМС
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	СообщениеSMSАдресаты.Ссылка.Ответственный КАК Пользователь,
							|	СообщениеSMSАдресаты.Ссылка.CRM_ПодразделениеЗаказчик КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	0 КАК Сумма,
							|	ВЫБОР
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.Исходящее)
							|			ТОГДА 1
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.ОтправляетсяПровайдером)
							|			ТОГДА 1
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.Доставлено)
							|			ТОГДА 1
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.ОтправленоПровайдером)
							|			ТОГДА 1
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеУдалосьПередатьПровайдеру)
							|			ТОГДА 0
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеОтправленоПровайдером)
							|			ТОГДА 0
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеДоставлено)
							|			ТОГДА 0
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеОпознаноПровайдером)
							|			ТОГДА 0
							|		ИНАЧЕ 0
							|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
							|	СообщениеSMSАдресаты.Ссылка
							|ПОМЕСТИТЬ ВсеСостоянияСМС
							|ИЗ
							|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
							|ГДЕ
							|	НЕ СообщениеSMSАдресаты.Ссылка.ПометкаУдаления
							|	И СообщениеSMSАдресаты.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|	И СообщениеSMSАдресаты.Ссылка.sms4bТипСообщения = ЗНАЧЕНИЕ(Перечисление.sms4ВходящееИсходящееSMS.Исходящее)
							|	И НЕ СообщениеSMSАдресаты.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументаСообщениеSMS.Черновик)
							|
							|{ГДЕ СообщениеSMSАдресаты.Ссылка КАК ОтборДокумент}
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСостоянияСМС.Пользователь,
							|	ВсеСостоянияСМС.Подразделение,
							|	ВсеСостоянияСМС.КартаМаршрута,
							|	ВсеСостоянияСМС.Этап,
							|	СУММА(ВсеСостоянияСМС.Сумма) КАК Сумма,
							|	ВсеСостоянияСМС.АктивнаяУспешноНеУдачно,
							|	КОЛИЧЕСТВО(ВсеСостоянияСМС.Ссылка) КАК Количество
							|ПОМЕСТИТЬ ВсеСМССгруппированные
							|ИЗ
							|	ВсеСостоянияСМС КАК ВсеСостоянияСМС
							|
							|СГРУППИРОВАТЬ ПО
							|	ВсеСостоянияСМС.Пользователь,
							|	ВсеСостоянияСМС.Подразделение,
							|	ВсеСостоянияСМС.КартаМаршрута,
							|	ВсеСостоянияСМС.Этап,
							|	ВсеСостоянияСМС.АктивнаяУспешноНеУдачно
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеСостоянияСМС
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСМССгруппированные.Пользователь,
							|	ВсеСМССгруппированные.Подразделение,
							|	ВсеСМССгруппированные.КартаМаршрута,
							|	ВсеСМССгруппированные.Этап,
							|	ВсеСМССгруппированные.Сумма,
							|	ВсеСМССгруппированные.АктивнаяУспешноНеУдачно,
							|	ВсеСМССгруппированные.Количество
							|ПОМЕСТИТЬ СМСВсеАктивные
							|ИЗ
							|	ВсеСМССгруппированные КАК ВсеСМССгруппированные
							|ГДЕ
							|	ВсеСМССгруппированные.АктивнаяУспешноНеУдачно = 2
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСМССгруппированные.Пользователь,
							|	ВсеСМССгруппированные.Подразделение,
							|	ВсеСМССгруппированные.КартаМаршрута,
							|	ВсеСМССгруппированные.Этап,
							|	ВсеСМССгруппированные.Сумма,
							|	ВсеСМССгруппированные.АктивнаяУспешноНеУдачно,
							|	ВсеСМССгруппированные.Количество
							|ПОМЕСТИТЬ СМСВсеНеУдачные
							|ИЗ
							|	ВсеСМССгруппированные КАК ВсеСМССгруппированные
							|ГДЕ
							|	ВсеСМССгруппированные.АктивнаяУспешноНеУдачно = 0
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСМССгруппированные.Пользователь,
							|	ВсеСМССгруппированные.Подразделение,
							|	ВсеСМССгруппированные.КартаМаршрута,
							|	ВсеСМССгруппированные.Этап,
							|	ВсеСМССгруппированные.Сумма,
							|	ВсеСМССгруппированные.АктивнаяУспешноНеУдачно,
							|	ВсеСМССгруппированные.Количество
							|ПОМЕСТИТЬ СМСВсеУспешные
							|ИЗ
							|	ВсеСМССгруппированные КАК ВсеСМССгруппированные
							|ГДЕ
							|	ВсеСМССгруппированные.АктивнаяУспешноНеУдачно = 1
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеСМССгруппированные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	КоличествоСМССгруппировано.Пользователь,
							|	КоличествоСМССгруппировано.Подразделение,
							|	КоличествоСМССгруппировано.КартаМаршрута,
							|	КоличествоСМССгруппировано.Этап,
							|	КоличествоСМССгруппировано.ИтогоСделок,
							|	КоличествоСМССгруппировано.КоличествоЗадач,
							|	ЕСТЬNULL(СМСВсеУспешные.Количество, 0) КАК КоличествоУспешно,
							|	ЕСТЬNULL(СМСВсеУспешные.Сумма, 0) КАК СуммаУспешно
							|ПОМЕСТИТЬ СМСУспешные
							|ИЗ
							|	КоличествоСМССгруппировано КАК КоличествоСМССгруппировано
							|		ЛЕВОЕ СОЕДИНЕНИЕ СМСВсеУспешные КАК СМСВсеУспешные
							|		ПО КоличествоСМССгруппировано.Пользователь = СМСВсеУспешные.Пользователь
							|			И КоличествоСМССгруппировано.Подразделение = СМСВсеУспешные.Подразделение
							|			И КоличествоСМССгруппировано.КартаМаршрута = СМСВсеУспешные.КартаМаршрута
							|			И КоличествоСМССгруппировано.Этап = СМСВсеУспешные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоличествоСМССгруппировано
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ СМСВсеУспешные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	СМСУспешные.Пользователь,
							|	СМСУспешные.Подразделение,
							|	СМСУспешные.КартаМаршрута,
							|	СМСУспешные.Этап,
							|	СМСУспешные.ИтогоСделок,
							|	СМСУспешные.КоличествоЗадач,
							|	СМСУспешные.КоличествоУспешно,
							|	СМСУспешные.СуммаУспешно,
							|	ЕСТЬNULL(СМСВсеНеУдачные.Количество, 0) КАК КоличествоНеудачно,
							|	ЕСТЬNULL(СМСВсеНеУдачные.Сумма, 0) КАК СуммаНеудачно
							|ПОМЕСТИТЬ СМСУспешныеНеудачные
							|ИЗ
							|	СМСУспешные КАК СМСУспешные
							|		ЛЕВОЕ СОЕДИНЕНИЕ СМСВсеНеУдачные КАК СМСВсеНеУдачные
							|		ПО СМСУспешные.Пользователь = СМСВсеНеУдачные.Пользователь
							|			И СМСУспешные.Подразделение = СМСВсеНеУдачные.Подразделение
							|			И СМСУспешные.КартаМаршрута = СМСВсеНеУдачные.КартаМаршрута
							|			И СМСУспешные.Этап = СМСВсеНеУдачные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ СМСВсеНеУдачные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ СМСУспешные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	СМСУспешныеНеудачные.Пользователь,
							|	СМСУспешныеНеудачные.Подразделение,
							|	СМСУспешныеНеудачные.КартаМаршрута,
							|	СМСУспешныеНеудачные.Этап,
							|	СМСУспешныеНеудачные.ИтогоСделок,
							|	СМСУспешныеНеудачные.КоличествоЗадач,
							|	СМСУспешныеНеудачные.КоличествоУспешно,
							|	СМСУспешныеНеудачные.СуммаУспешно,
							|	СМСУспешныеНеудачные.КоличествоНеудачно,
							|	СМСУспешныеНеудачные.СуммаНеудачно,
							|	ЕСТЬNULL(СМСВсеАктивные.Количество, 0) КАК КоличествоАктивные,
							|	ЕСТЬNULL(СМСВсеАктивные.Сумма, 0) КАК СуммаАктивные,
							|	0 КАК АктивныеИтог,
							|	0 КАК УспешноИтог,
							|	0 КАК НеудачноИтог,
							|	0 КАК АктивныеСуммаИтог,
							|	0 КАК УспешноСуммаИтог,
							|	0 КАК НеудачноСуммаИтог
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"СМСУспешныеНеудачныеАктивные
							|ИЗ
							|	СМСУспешныеНеудачные КАК СМСУспешныеНеудачные
							|		ЛЕВОЕ СОЕДИНЕНИЕ СМСВсеАктивные КАК СМСВсеАктивные
							|		ПО СМСУспешныеНеудачные.Пользователь = СМСВсеАктивные.Пользователь
							|			И СМСУспешныеНеудачные.Подразделение = СМСВсеАктивные.Подразделение
							|			И СМСУспешныеНеудачные.КартаМаршрута = СМСВсеАктивные.КартаМаршрута
							|			И СМСУспешныеНеудачные.Этап = СМСВсеАктивные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ СМСУспешныеНеудачные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ СМСВсеАктивные
							|;
							|";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СМСУспешныеНеудачныеАктивные");
							
						// +CRM не переносить в объединенные решения
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.CRM_СчетНаОплатуПокупателю") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	1 КАК КоличествоЗадач,
							|	CRM_СчетНаОплатуПокупателю.Ответственный КАК Пользователь,
							|	CRM_СчетНаОплатуПокупателю.Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	CRM_СчетНаОплатуПокупателю.Ссылка КАК ИтогоСделок
							|ПОМЕСТИТЬ КоличествоСчет
							|ИЗ
							|	Документ.CRM_СчетНаОплатуПокупателю КАК CRM_СчетНаОплатуПокупателю
							|ГДЕ
							|	НЕ CRM_СчетНаОплатуПокупателю.ПометкаУдаления
							|	И CRM_СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|	И CRM_СчетНаОплатуПокупателю.%СуммаДокумента > 0
							|
							|{ГДЕ CRM_СчетНаОплатуПокупателю.Ссылка КАК ОтборДокумент}
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	СУММА(КоличествоСчет.КоличествоЗадач) КАК КоличествоЗадач,
							|	КоличествоСчет.Пользователь,
							|	КоличествоСчет.Подразделение,
							|	КоличествоСчет.КартаМаршрута,
							|	КоличествоСчет.Этап,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоСчет.ИтогоСделок) КАК ИтогоСделок
							|ПОМЕСТИТЬ КоличествоСчетСгруппировано
							|ИЗ
							|	КоличествоСчет КАК КоличествоСчет
							|
							|СГРУППИРОВАТЬ ПО
							|	КоличествоСчет.Пользователь,
							|	КоличествоСчет.Подразделение,
							|	КоличествоСчет.КартаМаршрута,
							|	КоличествоСчет.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоличествоСчет
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	CRM_СчетНаОплатуПокупателю.Ответственный КАК Пользователь,
							|	CRM_СчетНаОплатуПокупателю.Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	ВЫБОР
							|		КОГДА CRM_СчетНаОплатуПокупателю.Кратность = 0
							|			ТОГДА CRM_СчетНаОплатуПокупателю.%СуммаДокумента * CRM_СчетНаОплатуПокупателю.Курс / 1
							|		ИНАЧЕ CRM_СчетНаОплатуПокупателю.%СуммаДокумента * CRM_СчетНаОплатуПокупателю.Курс / CRM_СчетНаОплатуПокупателю.Кратность
							|	КОНЕЦ КАК Сумма,
							|	1 КАК АктивнаяУспешноНеУдачно,
							|	CRM_СчетНаОплатуПокупателю.Ссылка
							|ПОМЕСТИТЬ ВсеСостоянияСчета
							|ИЗ
							|	Документ.CRM_СчетНаОплатуПокупателю КАК CRM_СчетНаОплатуПокупателю
							|ГДЕ
							|	НЕ CRM_СчетНаОплатуПокупателю.ПометкаУдаления
							|	И CRM_СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|	И CRM_СчетНаОплатуПокупателю.%СуммаДокумента > 0
							|
							|{ГДЕ CRM_СчетНаОплатуПокупателю.Ссылка КАК ОтборДокумент}
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСостоянияСчета.Пользователь,
							|	ВсеСостоянияСчета.Подразделение,
							|	ВсеСостоянияСчета.КартаМаршрута,
							|	ВсеСостоянияСчета.Этап,
							|	СУММА(ВсеСостоянияСчета.Сумма) КАК Сумма,
							|	ВсеСостоянияСчета.АктивнаяУспешноНеУдачно,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеСостоянияСчета.Ссылка) КАК Количество
							|ПОМЕСТИТЬ ВсеСчетаСгруппированные
							|ИЗ
							|	ВсеСостоянияСчета КАК ВсеСостоянияСчета
							|
							|СГРУППИРОВАТЬ ПО
							|	ВсеСостоянияСчета.Пользователь,
							|	ВсеСостоянияСчета.Подразделение,
							|	ВсеСостоянияСчета.КартаМаршрута,
							|	ВсеСостоянияСчета.Этап,
							|	ВсеСостоянияСчета.АктивнаяУспешноНеУдачно
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеСостоянияСчета
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСчетаСгруппированные.Пользователь,
							|	ВсеСчетаСгруппированные.Подразделение,
							|	ВсеСчетаСгруппированные.КартаМаршрута,
							|	ВсеСчетаСгруппированные.Этап,
							|	ВсеСчетаСгруппированные.Сумма,
							|	ВсеСчетаСгруппированные.АктивнаяУспешноНеУдачно,
							|	ВсеСчетаСгруппированные.Количество
							|ПОМЕСТИТЬ СчетаВсеУспешные
							|ИЗ
							|	ВсеСчетаСгруппированные КАК ВсеСчетаСгруппированные
							|ГДЕ
							|	ВсеСчетаСгруппированные.АктивнаяУспешноНеУдачно = 1
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеСчетаСгруппированные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	КоличествоСчетСгруппировано.Пользователь,
							|	КоличествоСчетСгруппировано.Подразделение,
							|	КоличествоСчетСгруппировано.КартаМаршрута,
							|	КоличествоСчетСгруппировано.Этап,
							|	КоличествоСчетСгруппировано.ИтогоСделок,
							|	КоличествоСчетСгруппировано.КоличествоЗадач,
							|	ЕСТЬNULL(СчетаВсеУспешные.Количество, 0) КАК КоличествоУспешно,
							|	ЕСТЬNULL(СчетаВсеУспешные.Сумма, 0) КАК СуммаУспешно,
							|	0 КАК КоличествоНеудачно,
							|	0 КАК СуммаНеудачно,
							|	0 КАК КоличествоАктивные,
							|	0 КАК СуммаАктивные,
							|	0 КАК АктивныеИтог,
							|	0 КАК УспешноИтог,
							|	0 КАК НеудачноИтог,
							|	0 КАК АктивныеСуммаИтог,
							|	0 КАК УспешноСуммаИтог,
							|	0 КАК НеудачноСуммаИтог
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"СчетаУспешныеНеудачныеАктивные%Постфикс
							|ИЗ
							|	КоличествоСчетСгруппировано КАК КоличествоСчетСгруппировано
							|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаВсеУспешные КАК СчетаВсеУспешные
							|		ПО КоличествоСчетСгруппировано.Пользователь = СчетаВсеУспешные.Пользователь
							|			И КоличествоСчетСгруппировано.Подразделение = СчетаВсеУспешные.Подразделение
							|			И КоличествоСчетСгруппировано.КартаМаршрута = СчетаВсеУспешные.КартаМаршрута
							|			И КоличествоСчетСгруппировано.Этап = СчетаВсеУспешные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоличествоСчетСгруппировано
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ СчетаВсеУспешные
							|;
							|";
							
							Если ЭлементЭтапа.ВариантСчетаНаОплату = 0 Тогда
								
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%СуммаДокумента","СуммаДокумента");
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%Постфикс","");
								
								СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СчетаУспешныеНеудачныеАктивные");
								
							ИначеЕсли ЭлементЭтапа.ВариантСчетаНаОплату = 1 Тогда
								
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%СуммаДокумента","СуммаОплаты");
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%Постфикс","_1");
								
								СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СчетаУспешныеНеудачныеАктивные_1");
								
							ИначеЕсли ЭлементЭтапа.ВариантСчетаНаОплату = 2 Тогда
								
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%СуммаДокумента","СуммаОтгрузки");
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%Постфикс","_2");
								
								СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СчетаУспешныеНеудачныеАктивные_2");
								
							КонецЕсли;
						// -CRM не переносить в объединенные решения
							
						Иначе
							
							Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
								РеквизитОтветственный = ПредставлениеТаблицы+".Ответственный";
							Иначе
								РеквизитОтветственный = "ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
							КонецЕсли;
							
							Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Подразделение", МетаданныеДокумента) Тогда
								
								РеквизитПодразделение = ПредставлениеТаблицы+".Подразделение";
								
							ИначеЕсли CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
								
								РеквизитПодразделение = ПредставлениеТаблицы+".Ответственный.Подразделение";
								
							Иначе
								РеквизитПодразделение = "ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
							КонецЕсли;
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	1 КАК КоличествоЗадач,
							|	"+РеквизитОтветственный+" КАК Пользователь,
							|	"+РеквизитПодразделение+" КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	"+ПредставлениеТаблицы+".Ссылка КАК ИтогоСделок,
							|	&"+ИмяПараметраЭтапа+" КАК Этап
							|ПОМЕСТИТЬ Количество"+ПредставлениеТаблицы+"
							|ИЗ
							|	Документ."+ПредставлениеТаблицы+" КАК "+ПредставлениеТаблицы+"
							|ГДЕ
							|	НЕ "+ПредставлениеТаблицы+".ПометкаУдаления
							|	И "+ПредставлениеТаблицы+".Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|
							|{ГДЕ "+ПредставлениеТаблицы+".Ссылка КАК ОтборДокумент}
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	Количество"+ПредставлениеТаблицы+".Пользователь,
							|	Количество"+ПредставлениеТаблицы+".Подразделение,
							|	Количество"+ПредставлениеТаблицы+".КартаМаршрута,
							|	Количество"+ПредставлениеТаблицы+".Этап,
							|	СУММА(Количество"+ПредставлениеТаблицы+".КоличествоЗадач) КАК КоличествоЗадач,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Количество"+ПредставлениеТаблицы+".ИтогоСделок) КАК ИтогоСделок
							|ПОМЕСТИТЬ Количество"+ПредставлениеТаблицы+"Сгруппировано
							|ИЗ
							|	Количество"+ПредставлениеТаблицы+" КАК Количество"+ПредставлениеТаблицы+"
							|
							|СГРУППИРОВАТЬ ПО
							|	Количество"+ПредставлениеТаблицы+".Пользователь,
							|	Количество"+ПредставлениеТаблицы+".Подразделение,
							|	Количество"+ПредставлениеТаблицы+".КартаМаршрута,
							|	Количество"+ПредставлениеТаблицы+".Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ Количество"+ПредставлениеТаблицы+"
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	"+РеквизитОтветственный+" КАК Пользователь,
							|	"+РеквизитПодразделение+" КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	0 КАК Сумма,
							|	1 КАК АктивнаяУспешноНеУдачно,
							|	"+ПредставлениеТаблицы+".Ссылка
							|ПОМЕСТИТЬ ВсеСостояния"+ПредставлениеТаблицы+"
							|ИЗ
							|	Документ."+ПредставлениеТаблицы+" КАК "+ПредставлениеТаблицы+"
							|ГДЕ
							|	НЕ "+ПредставлениеТаблицы+".ПометкаУдаления
							|	И "+ПредставлениеТаблицы+".Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСостояния"+ПредставлениеТаблицы+".Пользователь,
							|	ВсеСостояния"+ПредставлениеТаблицы+".Подразделение,
							|	ВсеСостояния"+ПредставлениеТаблицы+".КартаМаршрута,
							|	ВсеСостояния"+ПредставлениеТаблицы+".Этап,
							|	СУММА(ВсеСостояния"+ПредставлениеТаблицы+".Сумма) КАК Сумма,
							|	ВсеСостояния"+ПредставлениеТаблицы+".АктивнаяУспешноНеУдачно,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеСостояния"+ПредставлениеТаблицы+".Ссылка) КАК Количество
							|ПОМЕСТИТЬ Все"+ПредставлениеТаблицы+"Сгруппированные
							|ИЗ
							|	ВсеСостояния"+ПредставлениеТаблицы+" КАК ВсеСостояния"+ПредставлениеТаблицы+"
							|
							|СГРУППИРОВАТЬ ПО
							|	ВсеСостояния"+ПредставлениеТаблицы+".Пользователь,
							|	ВсеСостояния"+ПредставлениеТаблицы+".Подразделение,
							|	ВсеСостояния"+ПредставлениеТаблицы+".КартаМаршрута,
							|	ВсеСостояния"+ПредставлениеТаблицы+".Этап,
							|	ВсеСостояния"+ПредставлениеТаблицы+".АктивнаяУспешноНеУдачно
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеСостояния"+ПредставлениеТаблицы+"
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Пользователь,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Подразделение,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.КартаМаршрута,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Этап,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Сумма,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Количество
							|ПОМЕСТИТЬ "+ПредставлениеТаблицы+"ВсеУспешные
							|ИЗ
							|	Все"+ПредставлениеТаблицы+"Сгруппированные КАК Все"+ПредставлениеТаблицы+"Сгруппированные
							|ГДЕ
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.АктивнаяУспешноНеУдачно = 1
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ Все"+ПредставлениеТаблицы+"Сгруппированные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.Пользователь,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.Подразделение,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.КартаМаршрута,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.Этап,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.ИтогоСделок,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.КоличествоЗадач,
							|	ЕСТЬNULL("+ПредставлениеТаблицы+"ВсеУспешные.Количество, 0) КАК КоличествоУспешно,
							|	ЕСТЬNULL("+ПредставлениеТаблицы+"ВсеУспешные.Сумма, 0) КАК СуммаУспешно,
							|	0 КАК КоличествоНеудачно,
							|	0 КАК СуммаНеудачно,
							|	0 КАК КоличествоАктивные,
							|	0 КАК СуммаАктивные,
							|	0 КАК АктивныеИтог,
							|	0 КАК УспешноИтог,
							|	0 КАК НеудачноИтог,
							|	0 КАК АктивныеСуммаИтог,
							|	0 КАК УспешноСуммаИтог,
							|	0 КАК НеудачноСуммаИтог
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+ПредставлениеТаблицы+"УспешныеНеудачныеАктивные
							|ИЗ
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано КАК Количество"+ПредставлениеТаблицы+"Сгруппировано
							|		ЛЕВОЕ СОЕДИНЕНИЕ "+ПредставлениеТаблицы+"ВсеУспешные КАК "+ПредставлениеТаблицы+"ВсеУспешные
							|		ПО Количество"+ПредставлениеТаблицы+"Сгруппировано.Пользователь = "+ПредставлениеТаблицы+"ВсеУспешные.Пользователь
							|			И Количество"+ПредставлениеТаблицы+"Сгруппировано.Подразделение = "+ПредставлениеТаблицы+"ВсеУспешные.Подразделение
							|			И Количество"+ПредставлениеТаблицы+"Сгруппировано.КартаМаршрута = "+ПредставлениеТаблицы+"ВсеУспешные.КартаМаршрута
							|			И Количество"+ПредставлениеТаблицы+"Сгруппировано.Этап = "+ПредставлениеТаблицы+"ВсеУспешные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ Количество"+ПредставлениеТаблицы+"Сгруппировано
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ "+ПредставлениеТаблицы+"ВсеУспешные
							|;
							|";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+ПредставлениеТаблицы+"УспешныеНеудачныеАктивные");
							
						КонецЕсли;
						
					КонецЦикла;
				КонецЦикла;
				
				Если СписокИменИтоговыхТаблиц.Количество() > 1 Тогда
					
					ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.Пользователь КАК Пользователь,
					|	ВложенныйЗапрос.Подразделение КАК Подразделение,
					|	ВложенныйЗапрос.КартаМаршрута КАК КартаМаршрута,
					|	ВложенныйЗапрос.Этап КАК Этап,
					|	СУММА(ВложенныйЗапрос.ИтогоСделок) КАК ИтогоСделок,
					|	СУММА(ВложенныйЗапрос.КоличествоЗадач) КАК КоличествоЗадач,
					|	СУММА(ВложенныйЗапрос.КоличествоУспешно) КАК КоличествоУспешно,
					|	СУММА(ВложенныйЗапрос.СуммаУспешно) КАК СуммаУспешно,
					|	СУММА(ВложенныйЗапрос.КоличествоНеудачно) КАК КоличествоНеудачно,
					|	СУММА(ВложенныйЗапрос.СуммаНеудачно) КАК СуммаНеудачно,
					|	СУММА(ВложенныйЗапрос.КоличествоАктивные) КАК КоличествоАктивные,
					|	СУММА(ВложенныйЗапрос.СуммаАктивные) КАК СуммаАктивные,
					|	СУММА(ВложенныйЗапрос.АктивныеИтог) КАК АктивныеИтог,
					|	СУММА(ВложенныйЗапрос.УспешноИтог) КАК УспешноИтог,
					|	СУММА(ВложенныйЗапрос.НеудачноИтог) КАК НеудачноИтог,
					|	СУММА(ВложенныйЗапрос.АктивныеСуммаИтог) КАК АктивныеСуммаИтог,
					|	СУММА(ВложенныйЗапрос.УспешноСуммаИтог) КАК УспешноСуммаИтог,
					|	СУММА(ВложенныйЗапрос.НеудачноСуммаИтог) КАК НеудачноСуммаИтог
					|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"ДокументыИтоговаяТаблица
					|ИЗ
					|	(";
					
					ЭтоПервоеВхождение = Истина;
					Для Каждого ЭлементСписка ИЗ СписокИменИтоговыхТаблиц Цикл
						
						ПредставлениеИтоговойТаблицы = ЭлементСписка.Значение;
						
						Если ЭтоПервоеВхождение Тогда
							ЭтоПервоеВхождение = Ложь;
						Иначе
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|
							|ОБЪЕДИНИТЬ ВСЕ
							|";
							
						КонецЕсли;
						
						ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
						|ВЫБРАТЬ
						|	"+ПредставлениеИтоговойТаблицы+".Пользователь,
						|	"+ПредставлениеИтоговойТаблицы+".Подразделение,
						|	"+ПредставлениеИтоговойТаблицы+".КартаМаршрута,
						|	"+ПредставлениеИтоговойТаблицы+".Этап,
						|	"+ПредставлениеИтоговойТаблицы+".ИтогоСделок,
						|	"+ПредставлениеИтоговойТаблицы+".КоличествоЗадач,
						|	"+ПредставлениеИтоговойТаблицы+".КоличествоУспешно,
						|	"+ПредставлениеИтоговойТаблицы+".СуммаУспешно,
						|	"+ПредставлениеИтоговойТаблицы+".КоличествоНеудачно,
						|	"+ПредставлениеИтоговойТаблицы+".СуммаНеудачно,
						|	"+ПредставлениеИтоговойТаблицы+".КоличествоАктивные,
						|	"+ПредставлениеИтоговойТаблицы+".СуммаАктивные,
						|	"+ПредставлениеИтоговойТаблицы+".АктивныеИтог,
						|	"+ПредставлениеИтоговойТаблицы+".УспешноИтог,
						|	"+ПредставлениеИтоговойТаблицы+".НеудачноИтог,
						|	"+ПредставлениеИтоговойТаблицы+".АктивныеСуммаИтог,
						|	"+ПредставлениеИтоговойТаблицы+".УспешноСуммаИтог,
						|	"+ПредставлениеИтоговойТаблицы+".НеудачноСуммаИтог
						|ИЗ
						|	"+ПредставлениеИтоговойТаблицы+" КАК "+ПредставлениеИтоговойТаблицы;
					КонецЦикла;
					
					ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + ") КАК ВложенныйЗапрос
					|СГРУППИРОВАТЬ ПО
					|	ВложенныйЗапрос.Пользователь,
					|	ВложенныйЗапрос.Подразделение,
					|	ВложенныйЗапрос.КартаМаршрута,
					|	ВложенныйЗапрос.Этап";
					
				Иначе
					
					ПредставлениеИтоговойТаблицы = СписокИменИтоговыхТаблиц[0].Значение;
					
					ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
					|ВЫБРАТЬ
					|	"+ПредставлениеИтоговойТаблицы+".Пользователь,
					|	"+ПредставлениеИтоговойТаблицы+".Подразделение,
					|	"+ПредставлениеИтоговойТаблицы+".КартаМаршрута,
					|	"+ПредставлениеИтоговойТаблицы+".Этап,
					|	"+ПредставлениеИтоговойТаблицы+".ИтогоСделок,
					|	"+ПредставлениеИтоговойТаблицы+".КоличествоЗадач,
					|	"+ПредставлениеИтоговойТаблицы+".КоличествоУспешно,
					|	"+ПредставлениеИтоговойТаблицы+".СуммаУспешно,
					|	"+ПредставлениеИтоговойТаблицы+".КоличествоНеудачно,
					|	"+ПредставлениеИтоговойТаблицы+".СуммаНеудачно,
					|	"+ПредставлениеИтоговойТаблицы+".КоличествоАктивные,
					|	"+ПредставлениеИтоговойТаблицы+".СуммаАктивные,
					|	"+ПредставлениеИтоговойТаблицы+".АктивныеИтог,
					|	"+ПредставлениеИтоговойТаблицы+".УспешноИтог,
					|	"+ПредставлениеИтоговойТаблицы+".НеудачноИтог,
					|	"+ПредставлениеИтоговойТаблицы+".АктивныеСуммаИтог,
					|	"+ПредставлениеИтоговойТаблицы+".УспешноСуммаИтог,
					|	"+ПредставлениеИтоговойТаблицы+".НеудачноСуммаИтог
					|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"ДокументыИтоговаяТаблица
					|ИЗ
					|	"+ПредставлениеИтоговойТаблицы+" КАК "+ПредставлениеИтоговойТаблицы;
					
				КонецЕсли;
				
				Для Каждого ЭлементСписка ИЗ СписокИменИтоговыхТаблиц Цикл
					
					ПредставлениеИтоговойТаблицы = ЭлементСписка.Значение;
					ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ "+ПредставлениеИтоговойТаблицы;
				КонецЦикла;
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////";
				
				ТекстЗапросаПоДокументам = ТекстЗапросаПоДокументам + ТекстЗапросаЭтапаВоронкиПоДокументам;
				
				
			КонецЕсли;
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоДокументам;
		
	КонецЕсли;
	
	Если Форма.ЕстьЭтапыПоИнтересам Тогда
		
		ТекстЗапросаПоИнтересам = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		                          |ВоронкаСостав.Ссылка КАК Этап
		                          |ПОМЕСТИТЬ ЭтапыВоронки
		                          |ИЗ
		                          |Справочник.CRM_ВоронкиПродаж КАК ВоронкаСостав
		                          |ГДЕ
		                          |ВоронкаСостав.Ссылка.Родитель = &Воронка
		                          |И НЕ ВоронкаСостав.Ссылка.ПометкаУдаления
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		                          |	ВоронкаСостав.ТочкаМаршрута КАК ТочкаМаршрута,
		                          |	ВоронкаСостав.КартаМаршрута КАК КартаМаршрута,
		                          |	ВоронкаСостав.Ссылка КАК Этап
		                          |ПОМЕСТИТЬ ЭтапыТочекМаршрута
		                          |ИЗ
		                          |	Справочник.CRM_ВоронкиПродаж.Состав КАК ВоронкаСостав
		                          |ГДЕ
		                          |	ВоронкаСостав.Ссылка.Родитель = &Воронка
		                          |	И НЕ ВоронкаСостав.Ссылка.ПометкаУдаления
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ
		                          |	ВложенныйЗапрос.Пользователь,
		                          |	ВложенныйЗапрос.Подразделение,
		                          |	ВложенныйЗапрос.Офис,
		                          |	ВложенныйЗапрос.ТипУслуги,
		                          |	ВложенныйЗапрос.КартаМаршрута,
		                          |	ЭтапыТочекМаршрута.Этап,
		                          |	СУММА(ВложенныйЗапрос.ИтогоСделок) КАК ИтогоСделок,
		                          |	СУММА(ВложенныйЗапрос.КоличествоЗадач) КАК КоличествоЗадач
		                          |ПОМЕСТИТЬ ЭтапыКоличествоИнтересов
		                          |ИЗ
		                          |	ЭтапыВоронки КАК ЭтапыТочекМаршрута
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                          |			CRM_СостоянияИнтересов.Интерес.Ответственный КАК Пользователь,
		                          |			CRM_СостоянияИнтересов.Интерес.Подразделение КАК Подразделение,
		                          |			CRM_СостоянияИнтересов.Интерес.Офис КАК Офис,
		                          |			ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
		                          |			1 КАК КоличествоЗадач,
		                          |			0 КАК ИтогоСделок,
		                          |			ЭтапыТочекМаршрута.Этап КАК Этап,
		                          |			CRM_СостоянияИнтересов.Интерес.ТипУслуги КАК ТипУслуги,
		                          |			CRM_СостоянияИнтересов.Состояние КАК Состояние
		                          |		ИЗ
		                          |			РегистрСведений.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
		                          |				ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		                          |				ПО (ВЫБОР
		                          |						КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересПотерян)
		                          |							ТОГДА ВЫБОР
		                          |									КОГДА CRM_СостоянияИнтересов.ПредыдущееСостояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
		                          |										ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес)
		                          |									ИНАЧЕ CRM_СостоянияИнтересов.ПредыдущееСостояние
		                          |								КОНЕЦ
		                          |						ИНАЧЕ ВЫБОР
		                          |								КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
		                          |									ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес)
		                          |								ИНАЧЕ CRM_СостоянияИнтересов.Состояние
		                          |							КОНЕЦ
		                          |					КОНЕЦ = ЭтапыТочекМаршрута.ТочкаМаршрута)
		                          |		ГДЕ
		                          |			НЕ CRM_СостоянияИнтересов.Интерес.ПометкаУдаления
		                          |			И ВЫБОР
		                          |					КОГДА CRM_СостоянияИнтересов.Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		                          |						ТОГДА CRM_СостоянияИнтересов.Взаимодействие.ДатаЗавершенияВзаимодействия МЕЖДУ &НачалоПериода И &КонецПериода
		                          |					ИНАЧЕ CRM_СостоянияИнтересов.Взаимодействие.ПлановаяДатаЗавершение МЕЖДУ &НачалоПериода И &КонецПериода
		                          |				КОНЕЦ
		                          |		{ГДЕ
		                          |			CRM_СостоянияИнтересов.Интерес КАК ОтборИнтерес}) КАК ВложенныйЗапрос
		                          |		ПО (ВЫБОР
		                          |				КОГДА ВложенныйЗапрос.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересЗакрыт)
		                          |					ТОГДА ЭтапыТочекМаршрута.Этап.РеквизитДопУпорядочивания <= ВложенныйЗапрос.Этап.РеквизитДопУпорядочивания
		                          |				ИНАЧЕ ЭтапыТочекМаршрута.Этап = ВложенныйЗапрос.Этап
		                          |			КОНЕЦ)
		                          |
		                          |СГРУППИРОВАТЬ ПО
		                          |	ВложенныйЗапрос.Пользователь,
		                          |	ВложенныйЗапрос.Подразделение,
		                          |	ВложенныйЗапрос.Офис,
		                          |	ВложенныйЗапрос.ТипУслуги,
		                          |	ВложенныйЗапрос.КартаМаршрута,
		                          |	ЭтапыТочекМаршрута.Этап
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////"+
		                          ?(СтрНайти(ТекстЗапроса, "ПОМЕСТИТЬ КалендарныйГрафик")>0, "", "
								  |ВЫБРАТЬ
		                          |	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика,
		                          |	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньВключенВГрафик
		                          |ПОМЕСТИТЬ КалендарныйГрафик
		                          |ИЗ
		                          |	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		                          |ГДЕ
		                          |	КалендарныеГрафики.Календарь = &Календарь
		                          |	И КалендарныеГрафики.ДатаГрафика <= &ТекущаяДата
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////")+"
								  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
								  |	CRM_СостоянияИнтересов.Интерес.Ответственный КАК Пользователь,
								  |	CRM_СостоянияИнтересов.Интерес.Подразделение КАК Подразделение,
								  |	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
								  |	ВЫБОР
								  |		КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересЗакрыт)
								  |			ТОГДА 1
								  |		КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересПотерян)
								  |			ТОГДА 0
								  |		ИНАЧЕ 2
								  |	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
								  |	CRM_СостоянияИнтересов.Интерес.ОжидаемаяВыручка КАК Сумма,
								  |	CRM_СостоянияИнтересов.Интерес.Офис КАК Офис,
								  |	ВЫБОР
								  |		КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересПотерян)
								  |			ТОГДА ВЫБОР
								  |					КОГДА CRM_СостоянияИнтересов.ПредыдущееСостояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
								  |						ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес)
								  |					ИНАЧЕ CRM_СостоянияИнтересов.ПредыдущееСостояние
								  |				КОНЕЦ
								  |		ИНАЧЕ ВЫБОР
								  |				КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
								  |					ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес)
								  |				ИНАЧЕ CRM_СостоянияИнтересов.Состояние
								  |			КОНЕЦ
								  |	КОНЕЦ КАК Состояние,
								  |	ЭтапыТочекМаршрута.Этап,
								  |	0 КАК ВремяВыполненияВМинутах,
								  |	ДлительностьЭтапов.ВремяВыполненияВДнях КАК ВремяВыполненияВДнях,
								  |	1 КАК Количество,
								  |	CRM_СостоянияИнтересов.Интерес КАК Интерес,
								  |	CRM_СостоянияИнтересов.Интерес.ТипУслуги КАК ТипУслуги
								  |ПОМЕСТИТЬ ВсеИнтересыСостояния
								  |ИЗ
								  |	РегистрСведений.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
								  |		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
								  |		ПО (ВЫБОР
								  |				КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересПотерян)
								  |					ТОГДА ВЫБОР
								  |							КОГДА CRM_СостоянияИнтересов.ПредыдущееСостояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
								  |								ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес)
								  |							ИНАЧЕ CRM_СостоянияИнтересов.ПредыдущееСостояние
								  |						КОНЕЦ
								  |				ИНАЧЕ ВЫБОР
								  |						КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
								  |							ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес)
								  |						ИНАЧЕ CRM_СостоянияИнтересов.Состояние
								  |					КОНЕЦ
								  |			КОНЕЦ = ЭтапыТочекМаршрута.ТочкаМаршрута)
								  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
								  |			CRM_Взаимодействие.ДокументОснование КАК ДокументОснование,
								  |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КалендарныйГрафик.ДатаГрафика) КАК ВремяВыполненияВДнях
								  |		ИЗ
								  |			Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
								  |				ЛЕВОЕ СОЕДИНЕНИЕ КалендарныйГрафик КАК КалендарныйГрафик
								  |				ПО CRM_Взаимодействие.Дата <= КалендарныйГрафик.ДатаГрафика
								  |					И (ВЫБОР
								  |						КОГДА CRM_Взаимодействие.ДатаЗавершенияВзаимодействия = ДАТАВРЕМЯ(1, 1, 1)
								  |							ТОГДА &ТекущаяДата
								  |						ИНАЧЕ CRM_Взаимодействие.ДатаЗавершенияВзаимодействия
								  |					КОНЕЦ >= КалендарныйГрафик.ДатаГрафика)
								  |					И (КалендарныйГрафик.ДеньВключенВГрафик)
								  |		
								  |		СГРУППИРОВАТЬ ПО
								  |			CRM_Взаимодействие.ДокументОснование) КАК ДлительностьЭтапов
								  |		ПО CRM_СостоянияИнтересов.Интерес = ДлительностьЭтапов.ДокументОснование
								  |ГДЕ
								  |	ВЫБОР
								  |			КОГДА CRM_СостоянияИнтересов.Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
								  |				ТОГДА CRM_СостоянияИнтересов.Взаимодействие.ДатаЗавершенияВзаимодействия МЕЖДУ &НачалоПериода И &КонецПериода
								  |			ИНАЧЕ CRM_СостоянияИнтересов.Взаимодействие.ПлановаяДатаЗавершение МЕЖДУ &НачалоПериода И &КонецПериода
								  |		КОНЕЦ
								  |	И НЕ CRM_СостоянияИнтересов.Интерес.ПометкаУдаления
								  |{ГДЕ
								  |	CRM_СостоянияИнтересов.Интерес КАК ОтборИнтерес}
								  |;
								  |
								  |////////////////////////////////////////////////////////////////////////////////
								  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
								  |	CRM_СостоянияИнтересов.Интерес КАК Интерес,
								  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КалендарныйГрафик2.ДатаГрафика) КАК ДлительностьИнтереса
								  |ПОМЕСТИТЬ ВсеИнтересыКоличество
								  |ИЗ
								  |	РегистрСведений.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
								  |		ЛЕВОЕ СОЕДИНЕНИЕ КалендарныйГрафик КАК КалендарныйГрафик2
								  |		ПО CRM_СостоянияИнтересов.Интерес.Дата <= КалендарныйГрафик2.ДатаГрафика
								  |			И (ВЫБОР
								  |				КОГДА CRM_СостоянияИнтересов.Взаимодействие.ДатаЗавершенияВзаимодействия = ДАТАВРЕМЯ(1, 1, 1)
								  |					ТОГДА &ТекущаяДата
								  |				ИНАЧЕ CRM_СостоянияИнтересов.Взаимодействие.ДатаЗавершенияВзаимодействия
								  |			КОНЕЦ >= КалендарныйГрафик2.ДатаГрафика)
								  |			И (КалендарныйГрафик2.ДеньВключенВГрафик)
								  |ГДЕ
								  |	ВЫБОР
								  |			КОГДА CRM_СостоянияИнтересов.Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
								  |				ТОГДА CRM_СостоянияИнтересов.Взаимодействие.ДатаЗавершенияВзаимодействия МЕЖДУ &НачалоПериода И &КонецПериода
								  |			ИНАЧЕ CRM_СостоянияИнтересов.Взаимодействие.ПлановаяДатаЗавершение МЕЖДУ &НачалоПериода И &КонецПериода
								  |		КОНЕЦ
								  |	И НЕ CRM_СостоянияИнтересов.Интерес.ПометкаУдаления
								  |{ГДЕ
								  |	CRM_СостоянияИнтересов.Интерес КАК ОтборИнтерес}
								  |
								  |СГРУППИРОВАТЬ ПО
								  |	CRM_СостоянияИнтересов.Интерес
								  |;
								  |
								  |////////////////////////////////////////////////////////////////////////////////
								  |ВЫБРАТЬ
								  |	ВсеИнтересыСостояния.Пользователь,
								  |	ВсеИнтересыСостояния.Подразделение,
								  |	ВсеИнтересыСостояния.КартаМаршрута,
								  |	ВсеИнтересыСостояния.АктивнаяУспешноНеУдачно,
								  |	ВсеИнтересыСостояния.Сумма,
								  |	ВсеИнтересыСостояния.Офис,
								  |	ВсеИнтересыСостояния.Состояние,
								  |	ВсеИнтересыСостояния.Этап,
								  |	ВсеИнтересыСостояния.ВремяВыполненияВМинутах,
								  |	ВсеИнтересыСостояния.ТипУслуги,
								  |	ВсеИнтересыСостояния.Количество,
								  |	ВсеИнтересыСостояния.ВремяВыполненияВДнях,
								  |	ВсеИнтересыКоличество.ДлительностьИнтереса
								  |ПОМЕСТИТЬ ВсеИнтересы
								  |ИЗ
								  |	ВсеИнтересыСостояния КАК ВсеИнтересыСостояния
								  |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеИнтересыКоличество КАК ВсеИнтересыКоличество
								  |		ПО ВсеИнтересыСостояния.Интерес = ВсеИнтересыКоличество.Интерес
								  |;
								  |
								  |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 2
		                          |				ТОГДА 1
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК Активные,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 1
		                          |				ТОГДА 1
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК Успешно,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 0
		                          |				ТОГДА 1
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК Неудачно,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 2
		                          |				ТОГДА ВсеИнтересы.Сумма
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК АктивныеСумма,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 1
		                          |				ТОГДА ВсеИнтересы.Сумма
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК УспешноСумма,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 0
		                          |				ТОГДА ВсеИнтересы.Сумма
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК НеудачноСумма,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 2
		                          |				ТОГДА ВсеИнтересы.ДлительностьИнтереса
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК АктивныеДлительность,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 1
		                          |				ТОГДА ВсеИнтересы.ДлительностьИнтереса
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК УспешноДлительность,
		                          |	СУММА(ВЫБОР
		                          |			КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 0
		                          |				ТОГДА ВсеИнтересы.ДлительностьИнтереса
		                          |			ИНАЧЕ 0
		                          |		КОНЕЦ) КАК НеудачноДлительность
		                          |ПОМЕСТИТЬ АктивныеУспешныеНеудачныеИнтересы
		                          |ИЗ
		                          |	ВсеИнтересы КАК ВсеИнтересы
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ
		                          |	ЭтапыТочекМаршрута.Этап,
		                          |	ВсеИнтересы.Пользователь КАК Пользователь,
		                          |	ВсеИнтересы.Подразделение,
		                          |	ВсеИнтересы.КартаМаршрута,
		                          |	ВсеИнтересы.АктивнаяУспешноНеУдачно,
		                          |	СУММА(ВсеИнтересы.Количество) КАК Количество,
		                          |	СУММА(ВсеИнтересы.Сумма) КАК Сумма,
		                          |	СУММА(ВсеИнтересы.ДлительностьИнтереса) КАК ДлительностьИнтереса,
		                          |	СУММА(ВсеИнтересы.ВремяВыполненияВМинутах) КАК ВремяВыполненияВМинутах,
		                          |	СУММА(ВсеИнтересы.ВремяВыполненияВДнях) КАК ВремяВыполненияВДнях,
		                          |	ВсеИнтересы.Офис,
		                          |	ВсеИнтересы.ТипУслуги
		                          |ПОМЕСТИТЬ ЭтапыИИнтересы
		                          |ИЗ
		                          |	ЭтапыВоронки КАК ЭтапыТочекМаршрута
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеИнтересы КАК ВсеИнтересы
								  |		ПО (ВЫБОР
								  |				КОГДА ВсеИнтересы.АктивнаяУспешноНеУдачно = 1 И ВсеИнтересы.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересЗакрыт)
								  |					ТОГДА Истина
								  |				ИНАЧЕ ЭтапыТочекМаршрута.Этап = ВсеИнтересы.Этап
								  |			КОНЕЦ)
								  |
		                          |СГРУППИРОВАТЬ ПО
		                          |	ВсеИнтересы.Пользователь,
		                          |	ВсеИнтересы.Подразделение,
		                          |	ВсеИнтересы.Офис,
		                          |	ВсеИнтересы.ТипУслуги,
		                          |	ВсеИнтересы.КартаМаршрута,
		                          |	ЭтапыТочекМаршрута.Этап,
		                          |	ВсеИнтересы.АктивнаяУспешноНеУдачно
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ЭтапыТочекМаршрута
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ЭтапыВоронки
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ВсеИнтересы
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ
		                          |	ЭтапыИИнтересы.Пользователь,
		                          |	ЭтапыИИнтересы.Подразделение,
		                          |	ЭтапыИИнтересы.Офис,
		                          |	ЭтапыИИнтересы.КартаМаршрута,
		                          |	ЭтапыИИнтересы.Этап,
		                          |	ЭтапыИИнтересы.Количество,
		                          |	ЭтапыИИнтересы.Сумма,
		                          |	ЭтапыИИнтересы.ДлительностьИнтереса,
		                          |	ЭтапыИИнтересы.ВремяВыполненияВМинутах,
		                          |	ЭтапыИИнтересы.ВремяВыполненияВДнях,
		                          |	ЭтапыИИнтересы.ТипУслуги
		                          |ПОМЕСТИТЬ ВсеАктивныеИнтересы
		                          |ИЗ
		                          |	ЭтапыИИнтересы КАК ЭтапыИИнтересы
		                          |ГДЕ
		                          |	ЭтапыИИнтересы.АктивнаяУспешноНеУдачно = 2
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ
		                          |	ЭтапыИИнтересы.Пользователь,
		                          |	ЭтапыИИнтересы.Подразделение,
		                          |	ЭтапыИИнтересы.Офис,
		                          |	ЭтапыИИнтересы.КартаМаршрута,
		                          |	ЭтапыИИнтересы.Этап,
		                          |	ЭтапыИИнтересы.Количество,
		                          |	ЭтапыИИнтересы.Сумма,
		                          |	ЭтапыИИнтересы.ДлительностьИнтереса,
		                          |	ЭтапыИИнтересы.ВремяВыполненияВМинутах,
		                          |	ЭтапыИИнтересы.ВремяВыполненияВДнях,
		                          |	ЭтапыИИнтересы.ТипУслуги
		                          |ПОМЕСТИТЬ ВсеУспешныеИнтересы
		                          |ИЗ
		                          |	ЭтапыИИнтересы КАК ЭтапыИИнтересы
		                          |ГДЕ
		                          |	ЭтапыИИнтересы.АктивнаяУспешноНеУдачно = 1
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ
		                          |	ЭтапыИИнтересы.Пользователь,
		                          |	ЭтапыИИнтересы.Подразделение,
		                          |	ЭтапыИИнтересы.Офис,
		                          |	ЭтапыИИнтересы.КартаМаршрута,
		                          |	ЭтапыИИнтересы.Этап,
		                          |	ЭтапыИИнтересы.Количество,
		                          |	ЭтапыИИнтересы.Сумма,
		                          |	ЭтапыИИнтересы.ДлительностьИнтереса,
		                          |	ЭтапыИИнтересы.ВремяВыполненияВМинутах,
		                          |	ЭтапыИИнтересы.ВремяВыполненияВДнях,
		                          |	ЭтапыИИнтересы.ТипУслуги
		                          |ПОМЕСТИТЬ ВсеНеУдачныеИнтересы
		                          |ИЗ
		                          |	ЭтапыИИнтересы КАК ЭтапыИИнтересы
		                          |ГДЕ
		                          |	ЭтапыИИнтересы.АктивнаяУспешноНеУдачно = 0
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ЭтапыИИнтересы
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ
		                          |	ЭтапыКоличествоИнтересов.Пользователь,
		                          |	ЭтапыКоличествоИнтересов.Подразделение,
		                          |	ЭтапыКоличествоИнтересов.Офис,
		                          |	ЭтапыКоличествоИнтересов.ТипУслуги,
		                          |	ЭтапыКоличествоИнтересов.КартаМаршрута,
		                          |	ЭтапыКоличествоИнтересов.Этап,
		                          |	ЭтапыКоличествоИнтересов.КоличествоЗадач,
		                          |	ЭтапыКоличествоИнтересов.ИтогоСделок,
		                          |	ЕСТЬNULL(ВсеАктивныеИнтересы.Количество, 0) КАК КоличествоАктивные,
		                          |	ЕСТЬNULL(ВсеАктивныеИнтересы.ДлительностьИнтереса, 0) КАК ДлительностьИнтересаАктивные,
		                          |	ЕСТЬNULL(ВсеАктивныеИнтересы.ВремяВыполненияВДнях, 0) КАК ВремяВыполненияВДняхАктивные,
		                          |	ЕСТЬNULL(ВсеАктивныеИнтересы.Сумма, 0) КАК СуммаАктивные
		                          |ПОМЕСТИТЬ ЭтапыКоличествоИнтересовАктивные
		                          |ИЗ
		                          |	ЭтапыКоличествоИнтересов КАК ЭтапыКоличествоИнтересов
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеАктивныеИнтересы КАК ВсеАктивныеИнтересы
		                          |		ПО ЭтапыКоличествоИнтересов.Пользователь = ВсеАктивныеИнтересы.Пользователь
		                          |			И ЭтапыКоличествоИнтересов.Подразделение = ВсеАктивныеИнтересы.Подразделение
		                          |			И ЭтапыКоличествоИнтересов.КартаМаршрута = ВсеАктивныеИнтересы.КартаМаршрута
		                          |			И ЭтапыКоличествоИнтересов.Этап = ВсеАктивныеИнтересы.Этап
		                          |			И ЭтапыКоличествоИнтересов.ТипУслуги = ВсеАктивныеИнтересы.ТипУслуги
		                          |			И ЭтапыКоличествоИнтересов.Офис = ВсеАктивныеИнтересы.Офис
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ВсеАктивныеИнтересы
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ЭтапыКоличествоИнтересов
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ
		                          |	ЭтапыКоличествоИнтересовАктивные.Пользователь,
		                          |	ЭтапыКоличествоИнтересовАктивные.Подразделение,
		                          |	ЭтапыКоличествоИнтересовАктивные.Офис,
		                          |	ЭтапыКоличествоИнтересовАктивные.ТипУслуги,
		                          |	ЭтапыКоличествоИнтересовАктивные.КартаМаршрута,
		                          |	ЭтапыКоличествоИнтересовАктивные.Этап,
		                          |	ЭтапыКоличествоИнтересовАктивные.КоличествоЗадач,
		                          |	ЭтапыКоличествоИнтересовАктивные.ИтогоСделок,
		                          |	ЭтапыКоличествоИнтересовАктивные.КоличествоАктивные,
		                          |	ЭтапыКоличествоИнтересовАктивные.СуммаАктивные,
		                          |	ЭтапыКоличествоИнтересовАктивные.ДлительностьИнтересаАктивные,
		                          |	ЭтапыКоличествоИнтересовАктивные.ВремяВыполненияВДняхАктивные,
		                          |	ЕСТЬNULL(ВсеУспешныеИнтересы.Количество, 0) КАК КоличествоУспешно,
		                          |	ЕСТЬNULL(ВсеУспешныеИнтересы.ДлительностьИнтереса, 0) КАК ДлительностьИнтересаУспешно,
		                          |	ЕСТЬNULL(ВсеУспешныеИнтересы.ВремяВыполненияВДнях, 0) КАК ВремяВыполненияВДняхУспешно,
		                          |	ЕСТЬNULL(ВсеУспешныеИнтересы.Сумма, 0) КАК СуммаУспешно
		                          |ПОМЕСТИТЬ ЭтапыКоличествоИнтересовАктивныеУспешные
		                          |ИЗ
		                          |	ЭтапыКоличествоИнтересовАктивные КАК ЭтапыКоличествоИнтересовАктивные
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеУспешныеИнтересы КАК ВсеУспешныеИнтересы
		                          |		ПО ЭтапыКоличествоИнтересовАктивные.Пользователь = ВсеУспешныеИнтересы.Пользователь
		                          |			И ЭтапыКоличествоИнтересовАктивные.Подразделение = ВсеУспешныеИнтересы.Подразделение
		                          |			И ЭтапыКоличествоИнтересовАктивные.КартаМаршрута = ВсеУспешныеИнтересы.КартаМаршрута
		                          |			И ЭтапыКоличествоИнтересовАктивные.Этап = ВсеУспешныеИнтересы.Этап
		                          |			И ЭтапыКоличествоИнтересовАктивные.ТипУслуги = ВсеУспешныеИнтересы.ТипУслуги
		                          |			И ЭтапыКоличествоИнтересовАктивные.Офис = ВсеУспешныеИнтересы.Офис
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ВсеУспешныеИнтересы
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ЭтапыКоличествоИнтересовАктивные
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |ВЫБРАТЬ
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.Пользователь,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.Подразделение,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.Офис,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.ТипУслуги,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.КартаМаршрута,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.Этап,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.КоличествоЗадач,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.ИтогоСделок,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.КоличествоАктивные,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.СуммаАктивные,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.КоличествоУспешно,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.СуммаУспешно,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.ДлительностьИнтересаАктивные,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.ВремяВыполненияВДняхАктивные,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.ДлительностьИнтересаУспешно,
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные.ВремяВыполненияВДняхУспешно,
		                          |	ЕСТЬNULL(ВсеНеУдачныеИнтересы.Количество, 0) КАК КоличествоНеудачно,
		                          |	ЕСТЬNULL(ВсеНеУдачныеИнтересы.ДлительностьИнтереса, 0) КАК ДлительностьИнтересаНеудачно,
		                          |	ЕСТЬNULL(ВсеНеУдачныеИнтересы.ВремяВыполненияВДнях, 0) КАК ВремяВыполненияВДняхНеудачно,
		                          |	ЕСТЬNULL(ВсеНеУдачныеИнтересы.Сумма, 0) КАК СуммаНеудачно,
		                          |	ЕСТЬNULL(АктивныеУспешныеНеудачныеИнтересы.Активные, 0) КАК АктивныеИтог,
		                          |	ЕСТЬNULL(АктивныеУспешныеНеудачныеИнтересы.Успешно, 0) КАК УспешноИтог,
		                          |	ЕСТЬNULL(АктивныеУспешныеНеудачныеИнтересы.Неудачно, 0) КАК НеудачноИтог,
		                          |	ЕСТЬNULL(АктивныеУспешныеНеудачныеИнтересы.АктивныеДлительность, 0) КАК АктивныеДлительность,
		                          |	ЕСТЬNULL(АктивныеУспешныеНеудачныеИнтересы.УспешноДлительность, 0) КАК УспешноДлительность,
		                          |	ЕСТЬNULL(АктивныеУспешныеНеудачныеИнтересы.НеудачноДлительность, 0) КАК НеудачноДлительность,
		                          |	ЕСТЬNULL(АктивныеУспешныеНеудачныеИнтересы.АктивныеСумма, 0) КАК АктивныеСуммаИтог,
		                          |	ЕСТЬNULL(АктивныеУспешныеНеудачныеИнтересы.УспешноСумма, 0) КАК УспешноСуммаИтог,
		                          |	ЕСТЬNULL(АктивныеУспешныеНеудачныеИнтересы.НеудачноСумма, 0) КАК НеудачноСуммаИтог
		                          |ПОМЕСТИТЬ ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные
		                          |ИЗ
		                          |	ЭтапыКоличествоИнтересовАктивныеУспешные КАК ЭтапыКоличествоИнтересовАктивныеУспешные
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеНеУдачныеИнтересы КАК ВсеНеУдачныеИнтересы
		                          |		ПО ЭтапыКоличествоИнтересовАктивныеУспешные.Пользователь = ВсеНеУдачныеИнтересы.Пользователь
		                          |			И ЭтапыКоличествоИнтересовАктивныеУспешные.Подразделение = ВсеНеУдачныеИнтересы.Подразделение
		                          |			И ЭтапыКоличествоИнтересовАктивныеУспешные.КартаМаршрута = ВсеНеУдачныеИнтересы.КартаМаршрута
		                          |			И ЭтапыКоличествоИнтересовАктивныеУспешные.Этап = ВсеНеУдачныеИнтересы.Этап
		                          |			И ЭтапыКоличествоИнтересовАктивныеУспешные.ТипУслуги = ВсеНеУдачныеИнтересы.ТипУслуги
		                          |			И ЭтапыКоличествоИнтересовАктивныеУспешные.Офис = ВсеНеУдачныеИнтересы.Офис
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеУспешныеНеудачныеИнтересы КАК АктивныеУспешныеНеудачныеИнтересы
		                          |		ПО (ИСТИНА)
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ВсеНеУдачныеИнтересы
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ ЭтапыКоличествоИнтересовАктивныеУспешные
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////
		                          |УНИЧТОЖИТЬ АктивныеУспешныеНеудачныеИнтересы
		                          |;
		                          |
		                          |////////////////////////////////////////////////////////////////////////////////";
		
		ТекстЗапроса = ТекстЗапроса + "
		|"+ТекстЗапросаПоИнтересам;
	КонецЕсли;
	
	Если Форма.ЕстьЭтапыПоКартамМаршрута Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.Пользователь,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.Подразделение,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.Офис,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.КартаМаршрута,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.ИтогоСделок,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.Этап,
		|	ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПустаяСсылка) КАК ТипУслуги,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.КоличествоЗадач,
		|	0 КАК ВремяВыполненияВМинутах,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.КоличествоАктивные,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.СуммаАктивные,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.КоличествоУспешно,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.СуммаУспешно,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.КоличествоНеудачно,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.СуммаНеудачно,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.АктивныеИтог,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.УспешноИтог,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.НеудачноИтог,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.АктивныеДлительность,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.УспешноДлительность,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.НеудачноДлительность,
		|	0 КАК ДлительностьИнтересаАктивные,
		|	0 КАК ДлительностьИнтересаУспешно,
		|	0 КАК ДлительностьИнтересаНеудачно,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.ВремяВыполненияВДняхАктивные,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.ВремяВыполненияВДняхНеудачно,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.ВремяВыполненияВДняхУспешно,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.АктивныеСуммаИтог,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.УспешноСуммаИтог,
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные.НеудачноСуммаИтог
		|ИЗ
		|	ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные КАК ЭтапыКоличествоЗадачАктивныеУспешныеНеудачные";
	КонецЕсли;
	
	Если Форма.ЕстьЭтапыПоДокументам Тогда
		
		ЭтоПервыйПроход = НЕ Форма.ЕстьЭтапыПоКартамМаршрута;
		
		Для Каждого КлючИЗначение ИЗ СоответствияПараметровЗапросаПоДокументам Цикл
			
			Если ЭтоПервыйПроход Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|ВЫБРАТЬ
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.Пользователь,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.Подразделение,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.Подразделение.CRM_Офис КАК Офис,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КартаМаршрута,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.ИтогоСделок,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.Этап,
				|	ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПустаяСсылка) КАК ТипУслуги,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КоличествоЗадач,
				|	0 КАК ВремяВыполненияВМинутах,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КоличествоАктивные,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.СуммаАктивные,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КоличествоУспешно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.СуммаУспешно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КоличествоНеудачно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.СуммаНеудачно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.АктивныеИтог,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.УспешноИтог,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.НеудачноИтог,
				|	0 КАК АктивныеДлительность,
				|	0 КАК УспешноДлительность,
				|	0 КАК НеудачноДлительность,
				|	0 КАК ДлительностьИнтересаАктивные,
				|	0 КАК ДлительностьИнтересаУспешно,
				|	0 КАК ДлительностьИнтересаНеудачно,
				|	0 КАК ВремяВыполненияВДняхАктивные,
				|	0 КАК ВремяВыполненияВДняхНеудачно,
				|	0 КАК ВремяВыполненияВДняхУспешно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.АктивныеСуммаИтог,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.УспешноСуммаИтог,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.НеудачноСуммаИтог
				|ИЗ
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица КАК "+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица";
				
				ЭтоПервыйПроход = Ложь;
			Иначе
				ТекстЗапроса = ТекстЗапроса + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.Пользователь,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.Подразделение,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.Подразделение.CRM_Офис,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КартаМаршрута,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.ИтогоСделок,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.Этап,
				|	ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПустаяСсылка),
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КоличествоЗадач,
				|	0 КАК ВремяВыполненияВМинутах,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КоличествоАктивные,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.СуммаАктивные,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КоличествоУспешно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.СуммаУспешно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.КоличествоНеудачно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.СуммаНеудачно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.АктивныеИтог,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.УспешноИтог,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.НеудачноИтог,
				|	0 КАК АктивныеДлительность,
				|	0 КАК УспешноДлительность,
				|	0 КАК НеудачноДлительность,
				|	0 КАК ДлительностьИнтересаАктивные,
				|	0 КАК ДлительностьИнтересаУспешно,
				|	0 КАК ДлительностьИнтересаНеудачно,
				|	0 КАК ВремяВыполненияВДняхАктивные,
				|	0 КАК ВремяВыполненияВДняхНеудачно,
				|	0 КАК ВремяВыполненияВДняхУспешно,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.АктивныеСуммаИтог,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.УспешноСуммаИтог,
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица.НеудачноСуммаИтог
				|ИЗ
				|	"+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица КАК "+КлючИЗначение.Ключ+"ДокументыИтоговаяТаблица";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Форма.ЕстьЭтапыПоИнтересам Тогда
		
		Если Форма.ЕстьЭтапыПоКартамМаршрута ИЛИ Форма.ЕстьЭтапыПоДокументам Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.Пользователь,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.Подразделение,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.Офис,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.КартаМаршрута,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.ИтогоСделок,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.Этап,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.ТипУслуги,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.КоличествоЗадач,
		|	0 КАК ВремяВыполненияВМинутах,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.КоличествоАктивные,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.СуммаАктивные,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.КоличествоУспешно,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.СуммаУспешно,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.КоличествоНеудачно,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.СуммаНеудачно,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.АктивныеИтог,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.УспешноИтог,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.НеудачноИтог,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.АктивныеДлительность,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.УспешноДлительность,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.НеудачноДлительность,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.ДлительностьИнтересаАктивные,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.ДлительностьИнтересаУспешно,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.ДлительностьИнтересаНеудачно,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.ВремяВыполненияВДняхАктивные,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.ВремяВыполненияВДняхНеудачно,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.ВремяВыполненияВДняхУспешно,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.АктивныеСуммаИтог,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.УспешноСуммаИтог,
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные.НеудачноСуммаИтог
		|ИЗ
		|	ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные КАК ЭтапыКоличествоИнтересовАктивныеУспешныеНеудачные";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ВоронкаПродажПолучитьТекстЗапросаРасшифровки(ЭтапыТекущейВоронки, ЕстьЭтапыПоДокументам, ЕстьЭтапыПоИнтересам, ЕстьЭтапыПоКартамМаршрута) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВоронкаСостав.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВоронкаСостав.ТочкаМаршрута.Вид КАК ВидТочкиМаршрута,
	|	ВоронкаСостав.КартаМаршрута КАК КартаМаршрута,
	|	ВоронкаСостав.Ссылка КАК Этап
	|ПОМЕСТИТЬ ЭтапыТочекМаршрута
	|ИЗ
	|	Справочник.CRM_ВоронкиПродаж.Состав КАК ВоронкаСостав
	|ГДЕ
	|	ВоронкаСостав.Ссылка.Родитель = &Воронка
	|	И НЕ ВоронкаСостав.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
	|	ЗадачаИсполнителя.CRM_ТочкаМаршрута КАК CRM_ТочкаМаршрута,
	|	МАКСИМУМ(ЗадачаИсполнителя.CRM_Итерация) КАК CRM_Итерация
	|ПОМЕСТИТЬ ИтерацииЗадач
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
	|	И ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
	|	//%УСЛОВИЯ_ПО_ЗАДАЧАМ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадачаИсполнителя.БизнесПроцесс,
	|	ЗадачаИсполнителя.CRM_ТочкаМаршрута
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК ЗадачаКоличество,
	|	ЗадачаИсполнителя.Ссылка,
	|	ЗадачаИсполнителя.Исполнитель КАК Пользователь,
	|	ЗадачаИсполнителя.РезультатВыполнения КАК Описание,
	|	ЗадачаИсполнителя.БизнесПроцесс.ПричинаДосрочногоЗавершения КАК ПричинаОтказа,
	|	ЗадачаИсполнителя.ПринятаКИсполнению КАК ПринятаКИсполнению,
	|	ЗадачаИсполнителя.БизнесПроцесс.Подразделение КАК Подразделение,
	|	ЗадачаИсполнителя.БизнесПроцесс.Подразделение.CRM_Офис КАК Офис,
	|	ЗадачаИсполнителя.БизнесПроцесс.Партнер КАК Партнер,
	|	ЗадачаИсполнителя.БизнесПроцесс.КонтактноеЛицо КАК КонтактноеЛицо,
	|	ЗадачаИсполнителя.БизнесПроцесс.КонтактноеЛицо.CRM_РольКонтактногоЛица КАК РольКонтактногоЛица,
	|	ЗадачаИсполнителя.БизнесПроцесс.Проект КАК Проект,
	|	ЗадачаИсполнителя.БизнесПроцесс.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ ЗадачаИсполнителя.Выполнена
	|			ТОГДА 2
	|		КОГДА ЗадачаИсполнителя.CRM_Неудача
	|			ТОГДА 0
	|		КОГДА НЕ ЗадачаИсполнителя.CRM_Неудача
	|			ТОГДА 1
	|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
	|	ЭтапыТочекМаршрута.Этап КАК Этап,
	|	ЗадачаИсполнителя.БизнесПроцесс,
	|	ЗадачаИсполнителя.CRM_ТочкаМаршрута,
	|	ЗадачаИсполнителя.CRM_Итерация
	|ПОМЕСТИТЬ ЭтапыИЗадачи
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
	|		ПО ЗадачаИсполнителя.CRM_ТочкаМаршрута = ЭтапыТочекМаршрута.ТочкаМаршрута
	|ГДЕ
	|	ЗадачаИсполнителя.CRM_ТочкаМаршрута <> ЗНАЧЕНИЕ(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка)
	|	И ЗадачаИсполнителя.БизнесПроцесс.КартаМаршрута В(&КартыМаршрута)
	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
	|	//%УСЛОВИЯ_ПО_ЗАДАЧАМ
	|	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыИЗадачи.ЗадачаКоличество,
	|	ЭтапыИЗадачи.Ссылка КАК ЗадачаСсылка,
	|	ЭтапыИЗадачи.Пользователь,
	|	ЭтапыИЗадачи.Описание,
	|	ЭтапыИЗадачи.ПричинаОтказа,
	|	ЭтапыИЗадачи.ПринятаКИсполнению,
	|	ЭтапыИЗадачи.Подразделение,
	|	ЭтапыИЗадачи.Офис,
	|	ЭтапыИЗадачи.Партнер,
	|	ЭтапыИЗадачи.КонтактноеЛицо,
	|	ЭтапыИЗадачи.РольКонтактногоЛица,
	|	ЭтапыИЗадачи.Проект,
	|	ЭтапыИЗадачи.Сумма,
	|	ЭтапыИЗадачи.АктивнаяУспешноНеУдачно,
	|	ЭтапыИЗадачи.Этап
	|ПОМЕСТИТЬ ВсеЗадачи
	|ИЗ
	|	ИтерацииЗадач КАК ИтерацииЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыИЗадачи КАК ЭтапыИЗадачи
	|		ПО ИтерацииЗадач.БизнесПроцесс = ЭтапыИЗадачи.БизнесПроцесс
	|			И ИтерацииЗадач.CRM_ТочкаМаршрута = ЭтапыИЗадачи.CRM_ТочкаМаршрута
	|			И ИтерацииЗадач.CRM_Итерация = ЭтапыИЗадачи.CRM_Итерация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИтерацииЗадач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЭтапыИЗадачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЭтапыТочекМаршрута
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВсеЗадачи.ЗадачаКоличество,
	|	ВсеЗадачи.ЗадачаСсылка,
	|	ВсеЗадачи.Пользователь,
	|	ВсеЗадачи.Описание,
	|	ВсеЗадачи.ПричинаОтказа,
	|	ВсеЗадачи.ПринятаКИсполнению,
	|	ВсеЗадачи.Подразделение,
	|	ВсеЗадачи.Партнер,
	|	ВсеЗадачи.КонтактноеЛицо,
	|	ВсеЗадачи.РольКонтактногоЛица,
	|	ВсеЗадачи.Проект,
	|	ВсеЗадачи.Сумма,
	|	ВсеЗадачи.АктивнаяУспешноНеУдачно КАК Успешно,
	|	ВсеЗадачи.Этап
	|ИЗ
	|	ВсеЗадачи КАК ВсеЗадачи";
	
	Если ЕстьЭтапыПоДокументам Тогда
		
		СоответствияПараметровЗапросаПоДокументам = Новый Соответствие;
		
		ТекстЗапросаПоДокументам = "";
		
		Для Каждого ЭтапВоронки ИЗ ЭтапыТекущейВоронки Цикл
			Если ЭтапВоронки.Этап.ВидЭтапа = Перечисления.CRM_ВидыЭтаповВоронкиПродаж.ПоДокументам Тогда
				
				ИмяПараметраЭтапа = "_"+СтрЗаменить(ЭтапВоронки.Этап.УникальныйИдентификатор(),"-","_");
				СоответствияПараметровЗапросаПоДокументам.Вставить(ИмяПараметраЭтапа,ЭтапВоронки.Этап);
				
				СписокИменИтоговыхТаблиц = Новый СписокЗначений;
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = "";
				
				Для Каждого ЭлементЭтапа ИЗ ЭтапВоронки.Состав Цикл
						
					ЭтапЭлемента			= ЭтапВоронки.Этап;
					МассивТипов				= ЭлементЭтапа.ТочкаМаршрута.ТипЗначения.Типы();
					
					Для Каждого ТипДокумента ИЗ МассивТипов Цикл
						
						МетаданныеДокумента		= Метаданные.НайтиПоТипу(ТипДокумента);
						ПолноеИмяДокумента		= МетаданныеДокумента.ПолноеИмя();
						ПредставлениеТаблицы	= СтрЗаменить(ПолноеИмяДокумента,"Документ.","");
						
						Если ТипДокумента = Тип("ДокументСсылка.CRM_РассылкаЭлектронныхПисем") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	1 КАК ЗадачаКоличество,
							|	ЭлектронноеПисьмоИсходящее.Ссылка,
							|	ПредметыПапкиВзаимодействий.Предмет.Ответственный КАК Пользователь,
							|	ЭлектронноеПисьмоИсходящее.Тема КАК Описание,
							|	ЗНАЧЕНИЕ(Справочник.CRM_ПричиныОтказов.ПустаяСсылка) КАК ПричинаОтказа,
							|	ИСТИНА КАК ПринятаКИсполнению,
							|	ПредметыПапкиВзаимодействий.Предмет.ПодразделениеЗаказчик КАК Подразделение,
							|	ПредметыПапкиВзаимодействий.Предмет.ПодразделениеЗаказчик.CRM_Офис КАК Офис,
							|	ВЫБОР
							|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ЕСТЬ NULL 
							|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
							|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ССЫЛКА Справочник.Партнеры
							|			ТОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт
							|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
							|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
							|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
							|	КОНЕЦ КАК Партнер,
							|	ВЫБОР
							|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ЕСТЬ NULL 
							|			ТОГДА ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
							|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
							|			ТОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт
							|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ССЫЛКА Справочник.Партнеры
							|			ТОГДА ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
							|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
							|	КОНЕЦ КАК КонтактноеЛицо,
							|	ВЫБОР
							|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ЕСТЬ NULL 
							|			ТОГДА ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПустаяСсылка)
							|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
							|			ТОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт.CRM_РольКонтактногоЛица
							|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПустаяСсылка)
							|	КОНЕЦ КАК РольКонтактногоЛица,
							|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект,
							|	0 КАК Сумма,
							|	1 КАК АктивнаяУспешноНеУдачно,
							|	&"+ИмяПараметраЭтапа+" КАК Этап
							|	
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"РассылкаЭлектронныхПисем
							|ИЗ
							|	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
							|		ПО ЭлектронноеПисьмоИсходящее.Ссылка = ПредметыПапкиВзаимодействий.Взаимодействие
							|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее.ПолучателиПисьма КАК ЭлектронноеПисьмоИсходящееПолучателиПисьма
							|		ПО ЭлектронноеПисьмоИсходящее.Ссылка = ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка
							|			И (ЭлектронноеПисьмоИсходящееПолучателиПисьма.НомерСтроки = 1)
							|ГДЕ
							|	ПредметыПапкиВзаимодействий.Предмет ССЫЛКА Документ.CRM_РассылкаЭлектронныхПисем
							|	И НЕ ПредметыПапкиВзаимодействий.Предмет = ЗНАЧЕНИЕ(Документ.CRM_РассылкаЭлектронныхПисем.ПустаяСсылка)
							|	И НЕ ПредметыПапкиВзаимодействий.Предмет.ПометкаУдаления
							|	И ПредметыПапкиВзаимодействий.Предмет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"РассылкаЭлектронныхПисем");
							
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.CRM_Телемаркетинг") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	1 КАК ЗадачаКоличество,
							|	CRM_ТелемаркетингУчастники.Ссылка КАК ЗадачаСсылка,
							|	CRM_ТелемаркетингУчастники.Ссылка.Ответственный КАК Пользователь,
							|	CRM_ТелемаркетингУчастники.Ссылка.Тема КАК Описание,
							|	ЗНАЧЕНИЕ(Справочник.CRM_ПричиныОтказов.ПустаяСсылка) КАК ПричинаОтказа,
							|	ИСТИНА КАК ПринятаКИсполнению,
							|	CRM_ТелемаркетингУчастники.Ссылка.ПодразделениеЗаказчик КАК Подразделение,
							|	CRM_ТелемаркетингУчастники.Ссылка.ПодразделениеЗаказчик.CRM_Офис КАК Офис,
							|	CRM_ТелемаркетингУчастники.Партнер,
							|	CRM_ТелемаркетингУчастники.КонтактноеЛицо,
							|	CRM_ТелемаркетингУчастники.КонтактноеЛицо.CRM_РольКонтактногоЛица КАК РольКонтактногоЛица,
							|	CRM_ТелемаркетингУчастники.Ссылка.Проект,
							|	0 КАК Сумма,
							|	ВЫБОР
							|		КОГДА CRM_ТелемаркетингУчастники.Обработан
							|			ТОГДА 1
							|		КОГДА CRM_ТелемаркетингУчастники.НеДозвонились
							|			ТОГДА 0
							|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
							|	&"+ИмяПараметраЭтапа+" КАК Этап
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"Телемаркетинг
							|ИЗ
							|	Документ.CRM_Телемаркетинг.Участники КАК CRM_ТелемаркетингУчастники
							|ГДЕ
							|	(CRM_ТелемаркетингУчастники.Обработан
							|			ИЛИ CRM_ТелемаркетингУчастники.НеДозвонились)
							|	И НЕ CRM_ТелемаркетингУчастники.Ссылка.ПометкаУдаления
							|	И CRM_ТелемаркетингУчастники.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"Телемаркетинг");
							
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	КоммерческоеПредложениеКлиентуЗапасы.Ссылка,
							|	СУММА(1) КАК Количество
							|ПОМЕСТИТЬ КоммерческиеПредложения
							|ИЗ
							|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиентуЗапасы
							|ГДЕ
							|	НЕ КоммерческоеПредложениеКлиентуЗапасы.Ссылка.ПометкаУдаления
							|	И КоммерческоеПредложениеКлиентуЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|	И КоммерческоеПредложениеКлиентуЗапасы.CRM_Утвержден
							|
							|СГРУППИРОВАТЬ ПО
							|	КоммерческоеПредложениеКлиентуЗапасы.Ссылка
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	1 КАК ЗадачаКоличество,
							|	КоммерческиеПредложения.Ссылка КАК ЗадачаСсылка,
							|	КоммерческиеПредложения.Ссылка.Менеджер КАК Пользователь,
							|	"""" КАК Описание,
							|	КоммерческиеПредложения.Ссылка.CRM_ПричинаОтказа КАК ПричинаОтказа,
							|	ИСТИНА КАК ПринятаКИсполнению,
							|	КоммерческиеПредложения.Ссылка.CRM_Подразделение КАК Подразделение,
							|	КоммерческиеПредложения.Ссылка.Партнер КАК Партнер,
							|	КоммерческиеПредложения.Ссылка.КонтактноеЛицо КАК КонтактноеЛицо,
							|	КоммерческиеПредложения.Ссылка.КонтактноеЛицо.CRM_РольКонтактногоЛица КАК РольКонтактногоЛица,
							|	КоммерческиеПредложения.Ссылка.CRM_Проект КАК Проект,
							|	ВЫБОР
							|		КОГДА КоммерческиеПредложения.Ссылка.Кратность = 0
							|			ТОГДА КоммерческиеПредложения.Ссылка.СуммаДокумента * КоммерческиеПредложения.Ссылка.Курс / 1
							|		ИНАЧЕ КоммерческиеПредложения.Ссылка.СуммаДокумента * КоммерческиеПредложения.Ссылка.Курс / КоммерческиеПредложения.Ссылка.Кратность
							|	КОНЕЦ КАК Сумма,
							|	1 КАК АктивнаяУспешноНеУдачно,
							|	&"+ИмяПараметраЭтапа+" КАК Этап
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"КоммерческиеПредложения
							|ИЗ
							|	КоммерческиеПредложения КАК КоммерческиеПредложения
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ КоммерческиеПредложения
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"КоммерческиеПредложения");
							
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СообщениеSMS") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	1 КАК ЗадачаКоличество,
							|	СообщениеSMSАдресаты.Ссылка КАК ЗадачаСсылка,
							|	СообщениеSMSАдресаты.Ссылка.Ответственный КАК Пользователь,
							|	СообщениеSMSАдресаты.Ссылка.Тема КАК Описание,
							|	ЗНАЧЕНИЕ(Справочник.CRM_ПричиныОтказов.ПустаяСсылка) КАК ПричинаОтказа,
							|	ИСТИНА КАК ПринятаКИсполнению,
							|	СообщениеSMSАдресаты.Ссылка.CRM_ПодразделениеЗаказчик КАК Подразделение,
							|	ВЫБОР
							|		КОГДА СообщениеSMSАдресаты.Контакт ССЫЛКА Справочник.Партнеры
							|			ТОГДА СообщениеSMSАдресаты.Контакт
							|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
							|	КОНЕЦ КАК Партнер,
							|	ВЫБОР
							|		КОГДА СообщениеSMSАдресаты.Контакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
							|			ТОГДА СообщениеSMSАдресаты.Контакт
							|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
							|	КОНЕЦ КАК КонтактноеЛицо,
							|	ВЫБОР
							|		КОГДА СообщениеSMSАдресаты.Контакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
							|			ТОГДА СообщениеSMSАдресаты.Контакт.CRM_РольКонтактногоЛица
							|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицПартнеров.ПустаяСсылка)
							|	КОНЕЦ КАК РольКонтактногоЛица,
							|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект,
							|	0 КАК Сумма,
							|	ВЫБОР
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.Исходящее)
							|			ТОГДА 1
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.ОтправляетсяПровайдером)
							|			ТОГДА 1
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.Доставлено)
							|			ТОГДА 1
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.ОтправленоПровайдером)
							|			ТОГДА 1
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеУдалосьПередатьПровайдеру)
							|			ТОГДА 0
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеОтправленоПровайдером)
							|			ТОГДА 0
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеДоставлено)
							|			ТОГДА 0
							|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеОпознаноПровайдером)
							|			ТОГДА 0
							|		ИНАЧЕ 0
							|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
							|	&"+ИмяПараметраЭтапа+" КАК Этап
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"СМС
							|ИЗ
							|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
							|ГДЕ
							|	НЕ СообщениеSMSАдресаты.Ссылка.ПометкаУдаления
							|	И СообщениеSMSАдресаты.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|	И СообщениеSMSАдресаты.Ссылка.sms4bТипСообщения = ЗНАЧЕНИЕ(Перечисление.sms4ВходящееИсходящееSMS.Исходящее)
							|	И НЕ СообщениеSMSАдресаты.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументаСообщениеSMS.Черновик)
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СМС");
							
						// +CRM не переносить в объединенные решения
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.CRM_СчетНаОплатуПокупателю") Тогда
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	CRM_СчетНаОплатуПокупателю.Ответственный КАК Пользователь,
							|	CRM_СчетНаОплатуПокупателю.Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&Этап КАК Этап,
							|	ВЫБОР
							|		КОГДА CRM_СчетНаОплатуПокупателю.Кратность = 0
							|			ТОГДА CRM_СчетНаОплатуПокупателю.СуммаДокумента * CRM_СчетНаОплатуПокупателю.Курс / 1
							|		ИНАЧЕ CRM_СчетНаОплатуПокупателю.СуммаДокумента * CRM_СчетНаОплатуПокупателю.Курс / CRM_СчетНаОплатуПокупателю.Кратность
							|	КОНЕЦ КАК Сумма,
							|	1 КАК АктивнаяУспешноНеУдачно,
							|	CRM_СчетНаОплатуПокупателю.Ссылка
							|ПОМЕСТИТЬ ВсеСостоянияСчета
							|ИЗ
							|	Документ.CRM_СчетНаОплатуПокупателю КАК CRM_СчетНаОплатуПокупателю
							|ГДЕ
							|	НЕ CRM_СчетНаОплатуПокупателю.ПометкаУдаления
							|	И CRM_СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|	И CRM_СчетНаОплатуПокупателю.СуммаДокумента > 0
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////";
							//
							//
							//|ВЫБРАТЬ
							//|	CRM_СчетНаОплатуПокупателю.Ответственный КАК Пользователь,
							//|	CRM_СчетНаОплатуПокупателю.Подразделение,
							//|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							//|	&Этап КАК Этап,
							//|	ВЫБОР
							//|		КОГДА CRM_СчетНаОплатуПокупателю.Кратность = 0
							//|			ТОГДА CRM_СчетНаОплатуПокупателю.%СуммаДокумента * CRM_СчетНаОплатуПокупателю.Курс / 1
							//|		ИНАЧЕ CRM_СчетНаОплатуПокупателю.%СуммаДокумента * CRM_СчетНаОплатуПокупателю.Курс / CRM_СчетНаОплатуПокупателю.Кратность
							//|	КОНЕЦ КАК Сумма,
							//|	1 КАК АктивнаяУспешноНеУдачно,
							//|	CRM_СчетНаОплатуПокупателю.Ссылка
							//|ПОМЕСТИТЬ ВсеСостоянияСчета
							//|ИЗ
							//|	Документ.CRM_СчетНаОплатуПокупателю КАК CRM_СчетНаОплатуПокупателю
							//|ГДЕ
							//|	НЕ CRM_СчетНаОплатуПокупателю.ПометкаУдаления
							//|	И CRM_СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
							//|	И CRM_СчетНаОплатуПокупателю.%СуммаДокумента > 0
							//|;
							//|
							//|////////////////////////////////////////////////////////////////////////////////";
							
							Если ЭлементЭтапа.ВариантСчетаНаОплату = 0 Тогда
								
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%СуммаДокумента","СуммаДокумента");
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%Постфикс","");
								
								СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СчетаУспешныеНеудачныеАктивные");
								
							ИначеЕсли ЭлементЭтапа.ВариантСчетаНаОплату = 1 Тогда
								
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%СуммаДокумента","СуммаОплаты");
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%Постфикс","_1");
								
								СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СчетаУспешныеНеудачныеАктивные_1");
								
							ИначеЕсли ЭлементЭтапа.ВариантСчетаНаОплату = 2 Тогда
								
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%СуммаДокумента","СуммаОтгрузки");
								ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%Постфикс","_2");
								
								СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СчетаУспешныеНеудачныеАктивные_2");
								
							КонецЕсли;
						// -CRM не переносить в объединенные решения
							
						Иначе
							
							Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
								РеквизитОтветственный = ПредставлениеТаблицы+".Ответственный";
							Иначе
								РеквизитОтветственный = "ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
							КонецЕсли;
							
							Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Подразделение", МетаданныеДокумента) Тогда
								
								РеквизитПодразделение = ПредставлениеТаблицы+".Подразделение";
								
							ИначеЕсли CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
								
								РеквизитПодразделение = ПредставлениеТаблицы+".Ответственный.Подразделение";
								
							Иначе
								РеквизитПодразделение = "ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
							КонецЕсли;
							
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|ВЫБРАТЬ
							|	1 КАК КоличествоЗадач,
							|	"+РеквизитОтветственный+" КАК Пользователь,
							|	"+РеквизитПодразделение+" КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	"+ПредставлениеТаблицы+".Ссылка КАК ИтогоСделок,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	0 КАК ВремяВыполненияВМинутах
							|ПОМЕСТИТЬ Количество"+ПредставлениеТаблицы+"
							|ИЗ
							|	Документ."+ПредставлениеТаблицы+" КАК "+ПредставлениеТаблицы+"
							|ГДЕ
							|	НЕ "+ПредставлениеТаблицы+".ПометкаУдаления
							|	И "+ПредставлениеТаблицы+".Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	Количество"+ПредставлениеТаблицы+".Пользователь,
							|	Количество"+ПредставлениеТаблицы+".Подразделение,
							|	Количество"+ПредставлениеТаблицы+".КартаМаршрута,
							|	Количество"+ПредставлениеТаблицы+".Этап,
							|	СУММА(Количество"+ПредставлениеТаблицы+".КоличествоЗадач) КАК КоличествоЗадач,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Количество"+ПредставлениеТаблицы+".ИтогоСделок) КАК ИтогоСделок,
							|	СУММА(Количество"+ПредставлениеТаблицы+".ВремяВыполненияВМинутах) КАК ВремяВыполненияВМинутах
							|ПОМЕСТИТЬ Количество"+ПредставлениеТаблицы+"Сгруппировано
							|ИЗ
							|	Количество"+ПредставлениеТаблицы+" КАК Количество"+ПредставлениеТаблицы+"
							|
							|СГРУППИРОВАТЬ ПО
							|	Количество"+ПредставлениеТаблицы+".Пользователь,
							|	Количество"+ПредставлениеТаблицы+".Подразделение,
							|	Количество"+ПредставлениеТаблицы+".КартаМаршрута,
							|	Количество"+ПредставлениеТаблицы+".Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ Количество"+ПредставлениеТаблицы+"
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	"+РеквизитОтветственный+" КАК Пользователь,
							|	"+РеквизитПодразделение+" КАК Подразделение,
							|	ЗНАЧЕНИЕ(Справочник.CRM_КартыМаршрутов.ПустаяСсылка) КАК КартаМаршрута,
							|	&"+ИмяПараметраЭтапа+" КАК Этап,
							|	0 КАК Сумма,
							|	1 КАК АктивнаяУспешноНеУдачно,
							|	"+ПредставлениеТаблицы+".Ссылка
							|ПОМЕСТИТЬ ВсеСостояния"+ПредставлениеТаблицы+"
							|ИЗ
							|	Документ."+ПредставлениеТаблицы+" КАК "+ПредставлениеТаблицы+"
							|ГДЕ
							|	НЕ "+ПредставлениеТаблицы+".ПометкаУдаления
							|	И "+ПредставлениеТаблицы+".Дата МЕЖДУ &НачалоПериода И &КонецПериода
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	ВсеСостояния"+ПредставлениеТаблицы+".Пользователь,
							|	ВсеСостояния"+ПредставлениеТаблицы+".Подразделение,
							|	ВсеСостояния"+ПредставлениеТаблицы+".КартаМаршрута,
							|	ВсеСостояния"+ПредставлениеТаблицы+".Этап,
							|	СУММА(ВсеСостояния"+ПредставлениеТаблицы+".Сумма) КАК Сумма,
							|	ВсеСостояния"+ПредставлениеТаблицы+".АктивнаяУспешноНеУдачно,
							|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеСостояния"+ПредставлениеТаблицы+".Ссылка) КАК Количество
							|ПОМЕСТИТЬ Все"+ПредставлениеТаблицы+"Сгруппированные
							|ИЗ
							|	ВсеСостояния"+ПредставлениеТаблицы+" КАК ВсеСостояния"+ПредставлениеТаблицы+"
							|
							|СГРУППИРОВАТЬ ПО
							|	ВсеСостояния"+ПредставлениеТаблицы+".Пользователь,
							|	ВсеСостояния"+ПредставлениеТаблицы+".Подразделение,
							|	ВсеСостояния"+ПредставлениеТаблицы+".КартаМаршрута,
							|	ВсеСостояния"+ПредставлениеТаблицы+".Этап,
							|	ВсеСостояния"+ПредставлениеТаблицы+".АктивнаяУспешноНеУдачно
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ ВсеСостояния"+ПредставлениеТаблицы+"
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Пользователь,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Подразделение,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.КартаМаршрута,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Этап,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Сумма,
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.Количество
							|ПОМЕСТИТЬ "+ПредставлениеТаблицы+"ВсеУспешные
							|ИЗ
							|	Все"+ПредставлениеТаблицы+"Сгруппированные КАК Все"+ПредставлениеТаблицы+"Сгруппированные
							|ГДЕ
							|	Все"+ПредставлениеТаблицы+"Сгруппированные.АктивнаяУспешноНеУдачно = 1
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ Все"+ПредставлениеТаблицы+"Сгруппированные
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.Пользователь,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.Подразделение,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.КартаМаршрута,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.Этап,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.ИтогоСделок,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.КоличествоЗадач,
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано.ВремяВыполненияВМинутах,
							|	ЕСТЬNULL("+ПредставлениеТаблицы+"ВсеУспешные.Количество, 0) КАК КоличествоУспешно,
							|	ЕСТЬNULL("+ПредставлениеТаблицы+"ВсеУспешные.Сумма, 0) КАК СуммаУспешно,
							|	0 КАК КоличествоНеудачно,
							|	0 КАК СуммаНеудачно,
							|	0 КАК КоличествоАктивные,
							|	0 КАК СуммаАктивные,
							|	0 КАК АктивныеИтог,
							|	0 КАК УспешноИтог,
							|	0 КАК НеудачноИтог,
							|	0 КАК АктивныеСуммаИтог,
							|	0 КАК УспешноСуммаИтог,
							|	0 КАК НеудачноСуммаИтог
							|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+ПредставлениеТаблицы+"УспешныеНеудачныеАктивные
							|ИЗ
							|	Количество"+ПредставлениеТаблицы+"Сгруппировано КАК Количество"+ПредставлениеТаблицы+"Сгруппировано
							|		ЛЕВОЕ СОЕДИНЕНИЕ "+ПредставлениеТаблицы+"ВсеУспешные КАК "+ПредставлениеТаблицы+"ВсеУспешные
							|		ПО Количество"+ПредставлениеТаблицы+"Сгруппировано.Пользователь = "+ПредставлениеТаблицы+"ВсеУспешные.Пользователь
							|			И Количество"+ПредставлениеТаблицы+"Сгруппировано.Подразделение = "+ПредставлениеТаблицы+"ВсеУспешные.Подразделение
							|			И Количество"+ПредставлениеТаблицы+"Сгруппировано.КартаМаршрута = "+ПредставлениеТаблицы+"ВсеУспешные.КартаМаршрута
							|			И Количество"+ПредставлениеТаблицы+"Сгруппировано.Этап = "+ПредставлениеТаблицы+"ВсеУспешные.Этап
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ Количество"+ПредставлениеТаблицы+"Сгруппировано
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|УНИЧТОЖИТЬ "+ПредставлениеТаблицы+"ВсеУспешные
							|;
							|";
							
							СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+ПредставлениеТаблицы+"УспешныеНеудачныеАктивные");
							
						КонецЕсли;
						
					КонецЦикла;
				КонецЦикла;
				
				Если СписокИменИтоговыхТаблиц.Количество() > 1 Тогда
				
					ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.Пользователь КАК Пользователь,
					|	ВложенныйЗапрос.Подразделение КАК Подразделение,
					|	ВложенныйЗапрос.КартаМаршрута КАК КартаМаршрута,
					|	ВложенныйЗапрос.Этап КАК Этап,
					|	СУММА(ВложенныйЗапрос.ИтогоСделок) КАК ИтогоСделок,
					|	СУММА(ВложенныйЗапрос.КоличествоЗадач) КАК КоличествоЗадач,
					|	СУММА(ВложенныйЗапрос.ВремяВыполненияВМинутах) КАК ВремяВыполненияВМинутах,
					|	СУММА(ВложенныйЗапрос.КоличествоУспешно) КАК КоличествоУспешно,
					|	СУММА(ВложенныйЗапрос.СуммаУспешно) КАК СуммаУспешно,
					|	СУММА(ВложенныйЗапрос.КоличествоНеудачно) КАК КоличествоНеудачно,
					|	СУММА(ВложенныйЗапрос.СуммаНеудачно) КАК СуммаНеудачно,
					|	СУММА(ВложенныйЗапрос.КоличествоАктивные) КАК КоличествоАктивные,
					|	СУММА(ВложенныйЗапрос.СуммаАктивные) КАК СуммаАктивные,
					|	СУММА(ВложенныйЗапрос.АктивныеИтог) КАК АктивныеИтог,
					|	СУММА(ВложенныйЗапрос.УспешноИтог) КАК УспешноИтог,
					|	СУММА(ВложенныйЗапрос.НеудачноИтог) КАК НеудачноИтог,
					|	СУММА(ВложенныйЗапрос.АктивныеСуммаИтог) КАК АктивныеСуммаИтог,
					|	СУММА(ВложенныйЗапрос.УспешноСуммаИтог) КАК УспешноСуммаИтог,
					|	СУММА(ВложенныйЗапрос.НеудачноСуммаИтог) КАК НеудачноСуммаИтог
					|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"ДокументыИтоговаяТаблица
					|ИЗ
					|	(";
					
					ЭтоПервоеВхождение = Истина;
					Для Каждого ЭлементСписка ИЗ СписокИменИтоговыхТаблиц Цикл
						
						ПредставлениеИтоговойТаблицы = ЭлементСписка.Значение;
						
						Если ЭтоПервоеВхождение Тогда
							ЭтоПервоеВхождение = Ложь;
						Иначе
							ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
							|
							|ОБЪЕДИНИТЬ ВСЕ
							|";
							
						КонецЕсли;
						
						ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
						|ВЫБРАТЬ
						|	"+ПредставлениеИтоговойТаблицы+".Пользователь,
						|	"+ПредставлениеИтоговойТаблицы+".Подразделение,
						|	"+ПредставлениеИтоговойТаблицы+".КартаМаршрута,
						|	"+ПредставлениеИтоговойТаблицы+".Этап,
						|	"+ПредставлениеИтоговойТаблицы+".ИтогоСделок,
						|	"+ПредставлениеИтоговойТаблицы+".КоличествоЗадач,
						|	"+ПредставлениеИтоговойТаблицы+".ВремяВыполненияВМинутах,
						|	"+ПредставлениеИтоговойТаблицы+".КоличествоУспешно,
						|	"+ПредставлениеИтоговойТаблицы+".СуммаУспешно,
						|	"+ПредставлениеИтоговойТаблицы+".КоличествоНеудачно,
						|	"+ПредставлениеИтоговойТаблицы+".СуммаНеудачно,
						|	"+ПредставлениеИтоговойТаблицы+".КоличествоАктивные,
						|	"+ПредставлениеИтоговойТаблицы+".СуммаАктивные,
						|	"+ПредставлениеИтоговойТаблицы+".АктивныеИтог,
						|	"+ПредставлениеИтоговойТаблицы+".УспешноИтог,
						|	"+ПредставлениеИтоговойТаблицы+".НеудачноИтог,
						|	"+ПредставлениеИтоговойТаблицы+".АктивныеСуммаИтог,
						|	"+ПредставлениеИтоговойТаблицы+".УспешноСуммаИтог,
						|	"+ПредставлениеИтоговойТаблицы+".НеудачноСуммаИтог
						|ИЗ
						|	"+ПредставлениеИтоговойТаблицы+" КАК "+ПредставлениеИтоговойТаблицы;
					КонецЦикла;
					
					ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + ") КАК ВложенныйЗапрос
					|СГРУППИРОВАТЬ ПО
					|	ВложенныйЗапрос.Пользователь,
					|	ВложенныйЗапрос.Подразделение,
					|	ВложенныйЗапрос.КартаМаршрута,
					|	ВложенныйЗапрос.Этап";
					
				Иначе
					
					ПредставлениеИтоговойТаблицы = СписокИменИтоговыхТаблиц[0].Значение;
					
					ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
					|ВЫБРАТЬ
					|	"+ПредставлениеИтоговойТаблицы+".Пользователь,
					|	"+ПредставлениеИтоговойТаблицы+".Подразделение,
					|	"+ПредставлениеИтоговойТаблицы+".КартаМаршрута,
					|	"+ПредставлениеИтоговойТаблицы+".Этап,
					|	"+ПредставлениеИтоговойТаблицы+".ИтогоСделок,
					|	"+ПредставлениеИтоговойТаблицы+".КоличествоЗадач,
					|	"+ПредставлениеИтоговойТаблицы+".ВремяВыполненияВМинутах,
					|	"+ПредставлениеИтоговойТаблицы+".КоличествоУспешно,
					|	"+ПредставлениеИтоговойТаблицы+".СуммаУспешно,
					|	"+ПредставлениеИтоговойТаблицы+".КоличествоНеудачно,
					|	"+ПредставлениеИтоговойТаблицы+".СуммаНеудачно,
					|	"+ПредставлениеИтоговойТаблицы+".КоличествоАктивные,
					|	"+ПредставлениеИтоговойТаблицы+".СуммаАктивные,
					|	"+ПредставлениеИтоговойТаблицы+".АктивныеИтог,
					|	"+ПредставлениеИтоговойТаблицы+".УспешноИтог,
					|	"+ПредставлениеИтоговойТаблицы+".НеудачноИтог,
					|	"+ПредставлениеИтоговойТаблицы+".АктивныеСуммаИтог,
					|	"+ПредставлениеИтоговойТаблицы+".УспешноСуммаИтог,
					|	"+ПредставлениеИтоговойТаблицы+".НеудачноСуммаИтог
					|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"ДокументыИтоговаяТаблица
					|ИЗ
					|	"+ПредставлениеИтоговойТаблицы+" КАК "+ПредставлениеИтоговойТаблицы;
					
				КонецЕсли;
				
				Для Каждого ЭлементСписка ИЗ СписокИменИтоговыхТаблиц Цикл
					
					ПредставлениеИтоговойТаблицы = ЭлементСписка.Значение;
					ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ "+ПредставлениеИтоговойТаблицы;
				КонецЦикла;
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////";
				
				ТекстЗапросаПоДокументам = ТекстЗапросаПоДокументам + ТекстЗапросаЭтапаВоронкиПоДокументам;
				
				
			КонецЕсли;
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПоДокументам;
		
	КонецЕсли;
	
	
	
	
КонецФункции

Функция ВоронкаПродажПолучитьТекстЗапросаРасшифрокиПоДокументам(ЭтапВоронки) Экспорт
	
	ТекстЗапроса = "";
	
	ИмяПараметраЭтапа = "_"+СтрЗаменить(ЭтапВоронки.УникальныйИдентификатор(),"-","_");
	
	СписокИменИтоговыхТаблиц = Новый СписокЗначений;
	
	ТекстЗапросаЭтапаВоронкиПоДокументам = "";
	
	Для Каждого ЭлементЭтапа ИЗ ЭтапВоронки.Состав Цикл
			
		КартаМаршрутаЭлемента	= ЭлементЭтапа.КартаМаршрута;
		МассивТипов				= ЭлементЭтапа.ТочкаМаршрута.ТипЗначения.Типы();
		
		Для Каждого ТипДокумента ИЗ МассивТипов Цикл
			
			МетаданныеДокумента		= Метаданные.НайтиПоТипу(ТипДокумента);
			ПолноеИмяДокумента		= МетаданныеДокумента.ПолноеИмя();
			СинонимДокумента		= МетаданныеДокумента.Синоним;
			ПредставлениеТаблицы	= СтрЗаменить(ПолноеИмяДокумента,"Документ.","");
			
			Если ТипДокумента = Тип("ДокументСсылка.CRM_РассылкаЭлектронныхПисем") Тогда
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
				|ВЫБРАТЬ
				|	&Этап КАК Этап,
				|	ПредметыПапкиВзаимодействий.Предмет.Ответственный КАК Пользователь,
				|	ПредметыПапкиВзаимодействий.Предмет.ПодразделениеЗаказчик КАК Подразделение,
				|	ПредметыПапкиВзаимодействий.Предмет.ПодразделениеЗаказчик.CRM_Офис КАК Офис,
				|	ПредметыПапкиВзаимодействий.Предмет КАК Документ,
				|	ВЫБОР
				|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ЕСТЬ NULL 
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
				|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ССЫЛКА Справочник.Партнеры
				|			ТОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт
				|		КОГДА ЭлектронноеПисьмоИсходящееПолучателиПисьма.Контакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
				|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
				|	КОНЕЦ КАК Клиент,
				|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект,
				|	1 КАК Количество,
				|	0 КАК Сумма,
				|	&ВалютаРегламентированногоУчета КАК Валюта,
				|	ЭлектронноеПисьмоИсходящее.Дата КАК Дата,
				|	1 КАК АктивнаяУспешноНеУдачно,
				|	ПредметыПапкиВзаимодействий.Предмет.Комментарий КАК Описание,
				|	"""+СинонимДокумента+""" КАК Процесс,
				|	"""" КАК РезультатВыполнения,
				|	ПредметыПапкиВзаимодействий.Предмет.Проведен КАК Проведен,
				|	ВЫБОР
				|		КОГДА ПредметыПапкиВзаимодействий.Предмет.Проведен
				|			ТОГДА ""Проведен""
				|		ИНАЧЕ ""Не проведен""
				|	КОНЕЦ КАК Состояние
				|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"РассылкаЭлектронныхПисем
				|ИЗ
				|	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
				|		ПО ЭлектронноеПисьмоИсходящее.Ссылка = ПредметыПапкиВзаимодействий.Взаимодействие
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее.ПолучателиПисьма КАК ЭлектронноеПисьмоИсходящееПолучателиПисьма
				|		ПО ЭлектронноеПисьмоИсходящее.Ссылка = ЭлектронноеПисьмоИсходящееПолучателиПисьма.Ссылка
				|			И (ЭлектронноеПисьмоИсходящееПолучателиПисьма.НомерСтроки = 1)
				|ГДЕ
				|	ПредметыПапкиВзаимодействий.Предмет ССЫЛКА Документ.CRM_РассылкаЭлектронныхПисем
				|	И НЕ ПредметыПапкиВзаимодействий.Предмет = ЗНАЧЕНИЕ(Документ.CRM_РассылкаЭлектронныхПисем.ПустаяСсылка)
				|	И НЕ ПредметыПапкиВзаимодействий.Предмет.ПометкаУдаления
				|	И ПредметыПапкиВзаимодействий.Предмет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////";
				
				СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"РассылкаЭлектронныхПисем");
				
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.CRM_Телемаркетинг") Тогда
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
				|ВЫБРАТЬ
				|	&Этап КАК Этап,
				|	CRM_ТелемаркетингУчастники.Ссылка.Ответственный КАК Пользователь,
				|	CRM_ТелемаркетингУчастники.Ссылка.ПодразделениеЗаказчик КАК Подразделение,
				|	CRM_ТелемаркетингУчастники.Ссылка.ПодразделениеЗаказчик.CRM_Офис КАК Офис,
				|	CRM_ТелемаркетингУчастники.Ссылка КАК Документ,
				|	CRM_ТелемаркетингУчастники.Партнер КАК Клиент,
				|	CRM_ТелемаркетингУчастники.Ссылка.Проект,
				|	1 КАК Количество,
				|	0 КАК Сумма,
				|	&ВалютаРегламентированногоУчета КАК Валюта,
				|	CRM_ТелемаркетингУчастники.Ссылка.Дата КАК Дата,
				|	ВЫБОР
				|		КОГДА CRM_ТелемаркетингУчастники.Обработан
				|			ТОГДА 1
				|		КОГДА CRM_ТелемаркетингУчастники.НеДозвонились
				|			ТОГДА 0
				|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
				|	CRM_ТелемаркетингУчастники.Ссылка.Комментарий КАК Описание,
				|	"""+СинонимДокумента+""" КАК Процесс,
				|	"""" КАК РезультатВыполнения,
				|	CRM_ТелемаркетингУчастники.Ссылка.Проведен КАК Проведен,
				|	ВЫБОР
				|		КОГДА CRM_ТелемаркетингУчастники.Ссылка.Проведен
				|			ТОГДА ""Проведен""
				|		ИНАЧЕ ""Не проведен""
				|	КОНЕЦ КАК Состояние
				|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"Телемаркетинг
				|ИЗ
				|	Документ.CRM_Телемаркетинг.Участники КАК CRM_ТелемаркетингУчастники
				|ГДЕ
				|	(CRM_ТелемаркетингУчастники.Обработан
				|			ИЛИ CRM_ТелемаркетингУчастники.НеДозвонились)
				|	И НЕ CRM_ТелемаркетингУчастники.Ссылка.ПометкаУдаления
				|	И CRM_ТелемаркетингУчастники.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////";
				
				СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"Телемаркетинг");
				
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
				|ВЫБРАТЬ
				|	КоммерческоеПредложениеКлиентуЗапасы.Ссылка,
				|	СУММА(1) КАК Количество
				|ПОМЕСТИТЬ КоммерческиеПредложения
				|ИЗ
				|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиентуЗапасы
				|ГДЕ
				|	НЕ КоммерческоеПредложениеКлиентуЗапасы.Ссылка.ПометкаУдаления
				|	И КоммерческоеПредложениеКлиентуЗапасы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
				|	И КоммерческоеПредложениеКлиентуЗапасы.CRM_Утвержден
				|
				|СГРУППИРОВАТЬ ПО
				|	КоммерческоеПредложениеКлиентуЗапасы.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	&Этап КАК Этап,
				|	КоммерческиеПредложения.Ссылка.Менеджер КАК Пользователь,
				|	КоммерческиеПредложения.Ссылка.CRM_Подразделение КАК Подразделение,
				|	КоммерческиеПредложения.Ссылка.CRM_Подразделение.CRM_Офис КАК Офис,
				|	КоммерческиеПредложения.Ссылка КАК Документ,
				|	КоммерческиеПредложения.Ссылка.Партнер КАК Клиент,
				|	КоммерческиеПредложения.Ссылка.CRM_Проект КАК Проект,
				|	1 КАК Количество,"+
				?(НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),
				"
				|	КоммерческиеПредложения.Ссылка.СуммаДокумента КАК Сумма,",
				"
				|	ВЫБОР
				|		КОГДА КоммерческиеПредложения.Ссылка.Кратность = 0
				|			ТОГДА КоммерческиеПредложения.Ссылка.СуммаДокумента * КоммерческиеПредложения.Ссылка.Курс / 1
				|		ИНАЧЕ КоммерческиеПредложения.Ссылка.СуммаДокумента * КоммерческиеПредложения.Ссылка.Курс / КоммерческиеПредложения.Ссылка.Кратность
				|	КОНЕЦ КАК Сумма,")+"
				|	&ВалютаРегламентированногоУчета КАК Валюта,
				|	КоммерческиеПредложения.Ссылка.Дата КАК Дата,
				|	1 КАК АктивнаяУспешноНеУдачно,
				|	КоммерческиеПредложения.Ссылка.Комментарий КАК Описание,
				|	"""+СинонимДокумента+""" КАК Процесс,
				|	"""" КАК РезультатВыполнения,
				|	КоммерческиеПредложения.Ссылка.Проведен КАК Проведен,
				|	ВЫБОР
				|		КОГДА КоммерческиеПредложения.Ссылка.Проведен
				|			ТОГДА ""Проведен""
				|		ИНАЧЕ ""Не проведен""
				|	КОНЕЦ КАК Состояние
				|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"КоммерческиеПредложения
				|ИЗ
				|	КоммерческиеПредложения КАК КоммерческиеПредложения
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ КоммерческиеПредложения
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////";
				
				СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"КоммерческиеПредложения");
				
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СообщениеSMS") Тогда
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
				|ВЫБРАТЬ
				|	&Этап КАК Этап,
				|	СообщениеSMSАдресаты.Ссылка.Ответственный КАК Пользователь,
				|	СообщениеSMSАдресаты.Ссылка.CRM_ПодразделениеЗаказчик КАК Подразделение,
				|	СообщениеSMSАдресаты.Ссылка.CRM_ПодразделениеЗаказчик.CRM_Офис КАК Офис,
				|	СообщениеSMSАдресаты.Ссылка КАК Документ,
				|	ВЫБОР
				|		КОГДА СообщениеSMSАдресаты.Контакт ССЫЛКА Справочник.Партнеры
				|			ТОГДА СообщениеSMSАдресаты.Контакт
				|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
				|	КОНЕЦ КАК Клиент,
				|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект,
				|	1 КАК Количество,
				|	0 КАК Сумма,
				|	&ВалютаРегламентированногоУчета КАК Валюта,
				|	СообщениеSMSАдресаты.Ссылка.Дата КАК Дата,
				|	ВЫБОР
				|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.Исходящее)
				|			ТОГДА 1
				|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.ОтправляетсяПровайдером)
				|			ТОГДА 1
				|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.Доставлено)
				|			ТОГДА 1
				|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.ОтправленоПровайдером)
				|			ТОГДА 1
				|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеУдалосьПередатьПровайдеру)
				|			ТОГДА 0
				|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеОтправленоПровайдером)
				|			ТОГДА 0
				|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеДоставлено)
				|			ТОГДА 0
				|		КОГДА СообщениеSMSАдресаты.СостояниеСообщения = ЗНАЧЕНИЕ(Перечисление.СостоянияСообщенияSMS.НеОпознаноПровайдером)
				|			ТОГДА 0
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
				|	СообщениеSMSАдресаты.Ссылка.Комментарий КАК Описание,
				|	"""+СинонимДокумента+""" КАК Процесс,
				|	"""" КАК РезультатВыполнения,
				|	СообщениеSMSАдресаты.Ссылка.Проведен КАК Проведен,
				|	ВЫБОР
				|		КОГДА СообщениеSMSАдресаты.Ссылка.Проведен
				|			ТОГДА ""Проведен""
				|		ИНАЧЕ ""Не проведен""
				|	КОНЕЦ КАК Состояние
				|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"СМС
				|ИЗ
				|	Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
				|ГДЕ
				|	НЕ СообщениеSMSАдресаты.Ссылка.ПометкаУдаления
				|	И СообщениеSMSАдресаты.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
				|	И СообщениеSMSАдресаты.Ссылка.sms4bТипСообщения = ЗНАЧЕНИЕ(Перечисление.sms4ВходящееИсходящееSMS.Исходящее)
				|	И НЕ СообщениеSMSАдресаты.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументаСообщениеSMS.Черновик)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////";
				
				СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СМС");
				
			// +CRM не переносить в объединенные решения
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.CRM_СчетНаОплатуПокупателю") Тогда
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
				|ВЫБРАТЬ
				|	&Этап КАК Этап,
				|	CRM_СчетНаОплатуПокупателю.Ответственный КАК Пользователь,
				|	CRM_СчетНаОплатуПокупателю.Подразделение КАК Подразделение,
				|	CRM_СчетНаОплатуПокупателю.Подразделение.CRM_Офис КАК Офис,
				|	CRM_СчетНаОплатуПокупателю.Ссылка КАК Документ,
				|	CRM_СчетНаОплатуПокупателю.Партнер КАК Клиент,
				|	CRM_СчетНаОплатуПокупателю.Проект КАК Проект,
				|	1 КАК Количество,
				|	ВЫБОР
				|		КОГДА CRM_СчетНаОплатуПокупателю.Кратность = 0
				|			ТОГДА CRM_СчетНаОплатуПокупателю.%СуммаДокумента * CRM_СчетНаОплатуПокупателю.Курс / 1
				|		ИНАЧЕ CRM_СчетНаОплатуПокупателю.%СуммаДокумента * CRM_СчетНаОплатуПокупателю.Курс / CRM_СчетНаОплатуПокупателю.Кратность
				|	КОНЕЦ КАК Сумма,
				|	&ВалютаРегламентированногоУчета КАК Валюта,
				|	CRM_СчетНаОплатуПокупателю.Дата КАК Дата,
				|	1 КАК АктивнаяУспешноНеУдачно,
				|	CRM_СчетНаОплатуПокупателю.Комментарий КАК Описание,
				|	"""+СинонимДокумента+""" КАК Процесс,
				|	"""" КАК РезультатВыполнения,
				|	CRM_СчетНаОплатуПокупателю.Проведен КАК Проведен,
				|	ВЫБОР
				|		КОГДА CRM_СчетНаОплатуПокупателю.Проведен
				|			ТОГДА ""Проведен""
				|		ИНАЧЕ ""Не проведен""
				|	КОНЕЦ КАК Состояние
				|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+"СчетНаОплатуПокупателю%Постфикс
				|ИЗ
				|	Документ.CRM_СчетНаОплатуПокупателю КАК CRM_СчетНаОплатуПокупателю
				|ГДЕ
				|	НЕ CRM_СчетНаОплатуПокупателю.ПометкаУдаления
				|	И CRM_СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода
				|	И CRM_СчетНаОплатуПокупателю.%СуммаДокумента > 0
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////";
				
				Если ЭлементЭтапа.ВариантСчетаНаОплату = 0 Тогда
					
					ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%СуммаДокумента","СуммаДокумента");
					ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%Постфикс","");
					
					СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СчетНаОплатуПокупателю");
					
				ИначеЕсли ЭлементЭтапа.ВариантСчетаНаОплату = 1 Тогда
					
					ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%СуммаДокумента","СуммаОплаты");
					ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%Постфикс","_1");
					
					СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СчетНаОплатуПокупателю_1");
					
				ИначеЕсли ЭлементЭтапа.ВариантСчетаНаОплату = 2 Тогда
					
					ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%СуммаДокумента","СуммаОтгрузки");
					ТекстЗапросаЭтапаВоронкиПоДокументам = СтрЗаменить(ТекстЗапросаЭтапаВоронкиПоДокументам,"%Постфикс","_2");
					
					СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+"СчетНаОплатуПокупателю_2");
					
				КонецЕсли;
			// -CRM не переносить в объединенные решения
				
			Иначе
				Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
					РеквизитОтветственный = ПредставлениеТаблицы+".Ответственный";
				Иначе
					РеквизитОтветственный = "ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
				КонецЕсли;
				
				Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Подразделение", МетаданныеДокумента) Тогда
					
					РеквизитПодразделение = ПредставлениеТаблицы+".Подразделение";
					РеквизитОфис = ПредставлениеТаблицы+".Подразделение.CRM_Офис";
					
				ИначеЕсли CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
					
					РеквизитПодразделение = ПредставлениеТаблицы+".Ответственный.Подразделение";
					РеквизитОфис = ПредставлениеТаблицы+".Ответственный.Подразделение.CRM_Офис";
					
				Иначе
					РеквизитПодразделение = "ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
					РеквизитОфис = "ЗНАЧЕНИЕ(Справочник.CRM_ОфисыКомпании.ПустаяСсылка)";
				КонецЕсли;
				
				Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Партнер", МетаданныеДокумента) Тогда
					РеквизитПартнер = ПредставлениеТаблицы+".Партнер";
				Иначе
					РеквизитПартнер = "ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)";
				КонецЕсли;
				
				Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Проект", МетаданныеДокумента) Тогда
					РеквизитПроект = ПредставлениеТаблицы+".Проект";
				Иначе
					РеквизитПроект = "ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
				КонецЕсли;
				
				Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("СуммаДокумента", МетаданныеДокумента) Тогда
					РеквизитСуммаДокумента = ПредставлениеТаблицы+".СуммаДокумента";
				Иначе
					РеквизитСуммаДокумента = "0";
				КонецЕсли;
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
				|ВЫБРАТЬ
				|	&Этап КАК Этап,
				|	"+РеквизитОтветственный+" КАК Пользователь,
				|	"+РеквизитПодразделение+" КАК Подразделение,
				|	"+РеквизитОфис+" КАК Офис,
				|	"+ПредставлениеТаблицы+".Ссылка КАК Документ,
				|	"+РеквизитПартнер+" КАК Клиент,
				|	"+РеквизитПроект+" КАК Проект,
				|	1 КАК Количество,
				|	"+РеквизитСуммаДокумента+" КАК Сумма,
				|	&ВалютаРегламентированногоУчета КАК Валюта,
				|	"+ПредставлениеТаблицы+".Дата КАК Дата,
				|	1 КАК АктивнаяУспешноНеУдачно,
				|	"+ПредставлениеТаблицы+".Комментарий КАК Описание,
				|	"""+СинонимДокумента+""" КАК Процесс,
				|	"""" КАК РезультатВыполнения,
				|	"+ПредставлениеТаблицы+".Проведен КАК Проведен,
				|	ВЫБОР
				|		КОГДА "+ПредставлениеТаблицы+".Проведен
				|			ТОГДА ""Проведен""
				|		ИНАЧЕ ""Не проведен""
				|	КОНЕЦ КАК Состояние
				|ПОМЕСТИТЬ "+ИмяПараметраЭтапа+ПредставлениеТаблицы+"
				|ИЗ
				|	Документ."+ПредставлениеТаблицы+" КАК "+ПредставлениеТаблицы+"
				|ГДЕ
				|	НЕ "+ПредставлениеТаблицы+".ПометкаУдаления
				|	И "+ПредставлениеТаблицы+".Дата МЕЖДУ &НачалоПериода И &КонецПериода
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////";
				
				СписокИменИтоговыхТаблиц.Добавить(ИмяПараметраЭтапа+ПредставлениеТаблицы);
			КонецЕсли;
			
		КонецЦИкла;
	КонецЦИкла;
	
	Если СписокИменИтоговыхТаблиц.Количество() > 1 Тогда
		
		ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Этап КАК Этап,
		|	ВложенныйЗапрос.Пользователь КАК Пользователь,
		|	ВложенныйЗапрос.Подразделение КАК Подразделение,
		|	ВложенныйЗапрос.Офис КАК Офис,
		|	ВложенныйЗапрос.Документ КАК Документ,
		|	ВложенныйЗапрос.Клиент КАК Клиент,
		|	ВложенныйЗапрос.Проект КАК Проект,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	ВложенныйЗапрос.Сумма КАК Сумма,
		|	ВложенныйЗапрос.Валюта КАК Валюта,
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ВложенныйЗапрос.Описание КАК Описание,
		|	ВложенныйЗапрос.Процесс КАК Процесс,
		|	ВложенныйЗапрос.РезультатВыполнения КАК РезультатВыполнения,
		|	ВложенныйЗапрос.Проведен КАК Проведен,
		|	ВложенныйЗапрос.Состояние КАК Состояние,
		|	ВложенныйЗапрос.Светофор КАК Светофор
		|ИЗ
		|	(";
		
		ЭтоПервоеВхождение = Истина;
		Для Каждого ЭлементСписка ИЗ СписокИменИтоговыхТаблиц Цикл
			
			ПредставлениеИтоговойТаблицы = ЭлементСписка.Значение;
			
			Если ЭтоПервоеВхождение Тогда
				ЭтоПервоеВхождение = Ложь;
			Иначе
				ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|";
				
			КонецЕсли;
			
			ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
			|ВЫБРАТЬ
			|	"+ПредставлениеИтоговойТаблицы+".Этап,
			|	"+ПредставлениеИтоговойТаблицы+".Пользователь,
			|	"+ПредставлениеИтоговойТаблицы+".Подразделение,
			|	"+ПредставлениеИтоговойТаблицы+".Офис,
			|	"+ПредставлениеИтоговойТаблицы+".Документ,
			|	"+ПредставлениеИтоговойТаблицы+".Клиент,
			|	"+ПредставлениеИтоговойТаблицы+".Проект,
			|	"+ПредставлениеИтоговойТаблицы+".Количество,
			|	"+ПредставлениеИтоговойТаблицы+".Сумма,
			|	"+ПредставлениеИтоговойТаблицы+".Валюта,
			|	"+ПредставлениеИтоговойТаблицы+".Дата,
			|	"+ПредставлениеИтоговойТаблицы+".АктивнаяУспешноНеУдачно,
			|	"+ПредставлениеИтоговойТаблицы+".Описание,
			|	"+ПредставлениеИтоговойТаблицы+".Процесс,
			|	"+ПредставлениеИтоговойТаблицы+".РезультатВыполнения,
			|	"+ПредставлениеИтоговойТаблицы+".Проведен,
			|	"+ПредставлениеИтоговойТаблицы+".Состояние,
			|	"""" КАК Светофор
			|ИЗ
			|	"+ПредставлениеИтоговойТаблицы+" КАК "+ПредставлениеИтоговойТаблицы;
		КонецЦИкла;
		
		ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + ") КАК ВложенныйЗапрос
		|ГДЕ
		//|	ВложенныйЗапрос.АктивнаяУспешноНеУдачно = &АктивнаяУспешноНеУдачно";
		|	ВложенныйЗапрос.АктивнаяУспешноНеУдачно //%УСЛОВИЯ_ПО_СОСТОЯНИЯМ";
	Иначе
		ПредставлениеИтоговойТаблицы = СписокИменИтоговыхТаблиц[0].Значение;
		
		ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
		|ВЫБРАТЬ
		|	"+ПредставлениеИтоговойТаблицы+".Этап,
		|	"+ПредставлениеИтоговойТаблицы+".Пользователь,
		|	"+ПредставлениеИтоговойТаблицы+".Подразделение,
		|	"+ПредставлениеИтоговойТаблицы+".Офис,
		|	"+ПредставлениеИтоговойТаблицы+".Документ,
		|	"+ПредставлениеИтоговойТаблицы+".Клиент,
		|	"+ПредставлениеИтоговойТаблицы+".Проект,
		|	"+ПредставлениеИтоговойТаблицы+".Количество,
		|	"+ПредставлениеИтоговойТаблицы+".Сумма,
		|	"+ПредставлениеИтоговойТаблицы+".Валюта,
		|	"+ПредставлениеИтоговойТаблицы+".Дата,
		|	"+ПредставлениеИтоговойТаблицы+".Описание,
		|	"+ПредставлениеИтоговойТаблицы+".Процесс,
		|	"+ПредставлениеИтоговойТаблицы+".РезультатВыполнения,
		|	"+ПредставлениеИтоговойТаблицы+".Проведен,
		|	"+ПредставлениеИтоговойТаблицы+".Состояние,
		|	"""" КАК Светофор
		|ИЗ
		|	"+ПредставлениеИтоговойТаблицы+" КАК "+ПредставлениеИтоговойТаблицы+"
		|ГДЕ
		//|	"+ПредставлениеИтоговойТаблицы+".АктивнаяУспешноНеУдачно = &АктивнаяУспешноНеУдачно";
		|	"+ПредставлениеИтоговойТаблицы+".АктивнаяУспешноНеУдачно //%УСЛОВИЯ_ПО_СОСТОЯНИЯМ";
		
	КонецЕсли;
	
	Для Каждого ЭлементСписка ИЗ СписокИменИтоговыхТаблиц Цикл
		
		ПредставлениеИтоговойТаблицы = ЭлементСписка.Значение;
		ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ "+ПредставлениеИтоговойТаблицы;
	КонецЦикла;
	
	ТекстЗапросаЭтапаВоронкиПоДокументам = ТекстЗапросаЭтапаВоронкиПоДокументам + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	Возврат ТекстЗапросаЭтапаВоронкиПоДокументам;
	
КонецФункции

Функция ВоронкаПродажПолучитьТекстЗапросаРасшифрокиПоСостояниямИнтересов() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВоронкаСостав.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВоронкаСостав.КартаМаршрута КАК КартаМаршрута,
	|	ВоронкаСостав.Ссылка КАК Этап
	|ПОМЕСТИТЬ ЭтапыТочекМаршрута
	|ИЗ
	|	Справочник.CRM_ВоронкиПродаж.Состав КАК ВоронкаСостав
	|ГДЕ
	|	ВоронкаСостав.Ссылка.Родитель = &Воронка
	|	И НЕ ВоронкаСостав.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_СостоянияИнтересов.Интерес.Ответственный КАК Пользователь,
	|	CRM_СостоянияИнтересов.Интерес.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересЗакрыт)
	|			ТОГДА 1
	|		КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересПотерян)
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
	|	1 КАК Количество,
	|	CRM_СостоянияИнтересов.Интерес.ОжидаемаяВыручка КАК Сумма,
	|	CRM_СостоянияИнтересов.Интерес.Офис КАК Офис,
	|	CRM_СостоянияИнтересов.Интерес.ТипУслуги КАК ТипУслуги,
	|	ЭтапыТочекМаршрута.Этап,
	//|	&ВалютаРегламентированногоУчета КАК Валюта,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект,
	|	CRM_СостоянияИнтересов.Интерес.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА CRM_СостоянияИнтересов.Интерес.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА CRM_СостоянияИнтересов.Интерес.ПотенциальныйКлиент
	|		ИНАЧЕ CRM_СостоянияИнтересов.Интерес.Партнер
	|	КОНЕЦ КАК Клиент,
	|	ВЫБОР
	|		КОГДА CRM_СостоянияИнтересов.Интерес.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка)
	|		ИНАЧЕ CRM_СостоянияИнтересов.Интерес.Партнер.БизнесРегион
	|	КОНЕЦ КАК БизнесРегион,
	|	CRM_СостоянияИнтересов.Интерес КАК Документ
	|ПОМЕСТИТЬ ВсеИнтересы
	|ИЗ
	|	РегистрСведений.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
	|		ПО (ВЫБОР
	|				КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересПотерян)
	|					ТОГДА ВЫБОР
	|							КОГДА CRM_СостоянияИнтересов.ПредыдущееСостояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес)
	|							ИНАЧЕ CRM_СостоянияИнтересов.ПредыдущееСостояние
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА CRM_СостоянияИнтересов.Состояние = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	|							ТОГДА ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПервичныйИнтерес)
	|						ИНАЧЕ CRM_СостоянияИнтересов.Состояние
	|					КОНЕЦ
	|			КОНЕЦ = ЭтапыТочекМаршрута.ТочкаМаршрута)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА CRM_СостоянияИнтересов.Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
	|				ТОГДА CRM_СостоянияИнтересов.Взаимодействие.ДатаЗавершенияВзаимодействия МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИНАЧЕ CRM_СостоянияИнтересов.Взаимодействие.ПлановаяДатаЗавершение МЕЖДУ &НачалоПериода И &КонецПериода
	|		КОНЕЦ
	|	И НЕ CRM_СостоянияИнтересов.Интерес.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеИнтересы.Этап,
	|	ВсеИнтересы.Пользователь,
	|	ВсеИнтересы.Подразделение,
	|	ВсеИнтересы.Документ,
	|	ВсеИнтересы.ТипУслуги,
	|	ВсеИнтересы.Клиент,
	|	ВсеИнтересы.БизнесРегион,
	|	ВсеИнтересы.Проект,
	|	ВсеИнтересы.Количество,
	|	ВсеИнтересы.Сумма,
	//|	ВсеИнтересы.Валюта,
	|	ВсеИнтересы.Дата
	|ИЗ
	|	ВсеИнтересы КАК ВсеИнтересы
	|ГДЕ
	|	//%УСЛОВИЯ_ПО_СОСТОЯНИЯМ
	//|	ВсеИнтересы.АктивнаяУспешноНеУдачно = &АктивнаяУспешноНеУдачно
	|	И ВсеИнтересы.Этап = &Этап";
		
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВоронкаПродажПолучитьТекстЗапросаРасшифрокиПоЭтапам() Экспорт
	
	ТекстЗапроса = "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ВоронкаПродажПолучитьТекстЗапросаФильтраДокументов(Форма) Экспорт
	
	ТекстЗапросаПоДокументам = "";
	Если Форма.ЕстьЭтапыПоДокументам Тогда
		
		СоответствияПараметровЗапросаПоДокументам = Новый Соответствие;
		
		
		Для Каждого ЭтапВоронки ИЗ Форма.ЭтапыТекущейВоронки Цикл
			Если ЭтапВоронки.Этап.ВидЭтапа = Перечисления.CRM_ВидыЭтаповВоронкиПродаж.ПоДокументам Тогда
				
				ИмяПараметраЭтапа = "_"+СтрЗаменить(ЭтапВоронки.Этап.УникальныйИдентификатор(),"-","_");
				СоответствияПараметровЗапросаПоДокументам.Вставить(ИмяПараметраЭтапа,ЭтапВоронки.Этап);
				
				СписокИменИтоговыхТаблиц = Новый СписокЗначений;
				
				ТекстЗапросаЭтапаВоронкиПоДокументам = "";
				
				Для Каждого ЭлементЭтапа ИЗ ЭтапВоронки.Состав Цикл
					
					КартаМаршрутаЭлемента	= ЭлементЭтапа.КартаМаршрута;
					ЭтапЭлемента			= ЭтапВоронки.Этап;
					МассивТипов				= ЭлементЭтапа.ТочкаМаршрута.ТипЗначения.Типы();
					
					
					Для Каждого ТипДокумента ИЗ МассивТипов Цикл
						
						МетаданныеДокумента		= Метаданные.НайтиПоТипу(ТипДокумента);
						ПолноеИмяДокумента		= МетаданныеДокумента.ПолноеИмя();
						ПредставлениеТаблицы	= СтрЗаменить(ПолноеИмяДокумента,"Документ.","");
						Если СтрНайти(ТекстЗапросаПоДокументам, ПредставлениеТаблицы) > 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Если ТипДокумента = Тип("ДокументСсылка.CRM_РассылкаЭлектронныхПисем") Тогда
							
							ТекстЗапросаПоДокументам = ТекстЗапросаПоДокументам+ ?(ЗначениеЗаполнено(ТекстЗапросаПоДокументам),
							"
							|ОБЪЕДИНИТЬ ВСЕ
							|","") 
																				+"ВЫБРАТЬ
							                                                      |	CRM_РассылкаЭлектронныхПисем.Ссылка,
							                                                      |	CRM_РассылкаЭлектронныхПисемПолучатели.Партнер КАК Партнер,
							                                                      |	CRM_РассылкаЭлектронныхПисемПолучатели.Партнер.БизнесРегион КАК БизнесРегион,
							                                                      |	CRM_РассылкаЭлектронныхПисемПолучатели.Партнер ССЫЛКА Справочник.Партнеры
							                                                      |			И CRM_РассылкаЭлектронныхПисемПолучатели.Партнер.ДатаРегистрации > &ДатаНачала
							                                                      |		ИЛИ CRM_РассылкаЭлектронныхПисемПолучатели.Партнер ССЫЛКА Справочник.CRM_ПотенциальныеКлиенты
							                                                      |			И CRM_РассылкаЭлектронныхПисемПолучатели.Партнер <> ЗНАЧЕНИЕ(Справочник.CRM_ПотенциальныеКлиенты.ПустаяССылка) КАК НовыйКлиент,
							                                                      |	ПартнерыСегмента.Сегмент,
							                                                      |	CRM_РассылкаЭлектронныхПисем.Дата
							                                                      |ИЗ
							                                                      |	Документ.CRM_РассылкаЭлектронныхПисем КАК CRM_РассылкаЭлектронныхПисем
							                                                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_РассылкаЭлектронныхПисем.Получатели КАК CRM_РассылкаЭлектронныхПисемПолучатели
							                                                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
							                                                      |			ПО CRM_РассылкаЭлектронныхПисемПолучатели.Партнер = ПартнерыСегмента.Партнер
							                                                      |		ПО (CRM_РассылкаЭлектронныхПисемПолучатели.Ссылка = CRM_РассылкаЭлектронныхПисем.Ссылка)";
							
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.CRM_Мероприятие") Тогда
							
							ТекстЗапросаПоДокументам = ТекстЗапросаПоДокументам+ ?(ЗначениеЗаполнено(ТекстЗапросаПоДокументам),
							"
							|ОБЪЕДИНИТЬ ВСЕ
							|","") 
																				+"ВЫБРАТЬ
							                                                      |	CRM_Мероприятие.Ссылка,
							                                                      |	CRM_МероприятиеСторонниеЛица.Партнер,
							                                                      |	CRM_МероприятиеСторонниеЛица.Партнер.БизнесРегион КАК БизнесРегион,
							                                                      |	CRM_МероприятиеСторонниеЛица.Партнер ССЫЛКА Справочник.Партнеры
							                                                      |		И CRM_МероприятиеСторонниеЛица.Партнер.ДатаРегистрации > &ДатаНачала КАК НовыйКлиент,
							                                                      |	ПартнерыСегмента.Сегмент,
							                                                      |	CRM_Мероприятие.Дата
							                                                      |ИЗ
							                                                      |	Документ.CRM_Мероприятие КАК CRM_Мероприятие
							                                                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_Мероприятие.СторонниеЛица КАК CRM_МероприятиеСторонниеЛица
							                                                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
							                                                      |			ПО CRM_МероприятиеСторонниеЛица.Партнер = ПартнерыСегмента.Партнер
							                                                      |		ПО (CRM_МероприятиеСторонниеЛица.Ссылка = CRM_Мероприятие.Ссылка)";
							
						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.CRM_Телемаркетинг") Тогда
							
							ТекстЗапросаПоДокументам = ТекстЗапросаПоДокументам+ ?(ЗначениеЗаполнено(ТекстЗапросаПоДокументам),
							"
							|ОБЪЕДИНИТЬ ВСЕ
							|","") 
																				+"ВЫБРАТЬ
							                                                      |	CRM_Телемаркетинг.Ссылка,
							                                                      |	CRM_ТелемаркетингУчастники.Партнер,
							                                                      |	CRM_ТелемаркетингУчастники.Партнер.БизнесРегион КАК БизнесРегион,
							                                                      |	CRM_ТелемаркетингУчастники.Партнер ССЫЛКА Справочник.Партнеры
							                                                      |			И CRM_ТелемаркетингУчастники.Партнер.ДатаРегистрации > &ДатаНачала
							                                                      |		ИЛИ CRM_ТелемаркетингУчастники.Партнер ССЫЛКА Справочник.CRM_ПотенциальныеКлиенты
							                                                      |			И CRM_ТелемаркетингУчастники.Партнер <> ЗНАЧЕНИЕ(Справочник.CRM_ПотенциальныеКлиенты.ПустаяССылка) КАК НовыйКлиент,
							                                                      |	ПартнерыСегмента.Сегмент,
							                                                      |	CRM_Телемаркетинг.Дата
							                                                      |ИЗ
							                                                      |	Документ.CRM_Телемаркетинг КАК CRM_Телемаркетинг
							                                                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_Телемаркетинг.Участники КАК CRM_ТелемаркетингУчастники
							                                                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
							                                                      |			ПО CRM_ТелемаркетингУчастники.Партнер = ПартнерыСегмента.Партнер
							                                                      |		ПО (CRM_ТелемаркетингУчастники.Ссылка = CRM_Телемаркетинг.Ссылка)";

						ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СообщениеSMS") Тогда
							
							ТекстЗапросаПоДокументам = ТекстЗапросаПоДокументам+ ?(ЗначениеЗаполнено(ТекстЗапросаПоДокументам),
							"
							|ОБЪЕДИНИТЬ ВСЕ
							|","") 
																				+"ВЫБРАТЬ
							                                                      |	СообщениеSMS.Ссылка,
							                                                      |	ВЫБОР
							                                                      |		КОГДА СообщениеSMSАдресаты.Контакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
							                                                      |			ТОГДА СообщениеSMSАдресаты.Контакт.Владелец
							                                                      |		ИНАЧЕ СообщениеSMSАдресаты.Контакт
							                                                      |	КОНЕЦ КАК Партнер,
							                                                      |	СообщениеSMSАдресаты.Контакт.БизнесРегион КАК БизнесРегион,
							                                                      |	СообщениеSMSАдресаты.Контакт ССЫЛКА Справочник.Партнеры
							                                                      |			И СообщениеSMSАдресаты.Контакт.ДатаРегистрации > &ДатаНачала
							                                                      |		ИЛИ СообщениеSMSАдресаты.Контакт ССЫЛКА Справочник.CRM_ПотенциальныеКлиенты
							                                                      |			И СообщениеSMSАдресаты.Контакт <> ЗНАЧЕНИЕ(Справочник.CRM_ПотенциальныеКлиенты.ПустаяССылка)
							                                                      |		ИЛИ СообщениеSMSАдресаты.Контакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
							                                                      |			И СообщениеSMSАдресаты.Контакт.Владелец.ДатаРегистрации > &ДатаНачала КАК НовыйКлиент,
							                                                      |	ПартнерыСегмента.Сегмент,
							                                                      |	СообщениеSMS.Дата
							                                                      |ИЗ
							                                                      |	Документ.СообщениеSMS КАК СообщениеSMS
							                                                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СообщениеSMS.Адресаты КАК СообщениеSMSАдресаты
							                                                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
							                                                      |			ПО СообщениеSMSАдресаты.Контакт = ПартнерыСегмента.Партнер
							                                                      |		ПО (СообщениеSMSАдресаты.Ссылка = СообщениеSMS.Ссылка)";
							
						Иначе
							
							Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Партнер", МетаданныеДокумента) Тогда
								РеквизитПартнер = ПредставлениеТаблицы+".Партнер";
								РеквизитБизнесРегион = ПредставлениеТаблицы+".Партнер.БизнесРегион";
								РеквизитНовыйКлиент = РеквизитПартнер+" ССЫЛКА Справочник.Партнеры
									|			И "+РеквизитПартнер+".ДатаРегистрации > &ДатаНачала";
							Иначе
								РеквизитПартнер = "ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)";
								РеквизитБизнесРегион = "ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка)";
								РеквизитНовыйКлиент = "ЛОЖЬ";
							КонецЕсли;
							
				
							ТекстЗапросаПоДокументам = ТекстЗапросаПоДокументам+ ?(ЗначениеЗаполнено(ТекстЗапросаПоДокументам),
							"
							|ОБЪЕДИНИТЬ ВСЕ
							|","") + "ВЫБРАТЬ
							|	"+ПредставлениеТаблицы+".Ссылка,
							|	"+РеквизитПартнер+" КАК Партнер,
							|	"+РеквизитБизнесРегион+" КАК БизнесРегион,
							|	"+РеквизитНовыйКлиент+" КАК НовыйКлиент,
							|	ПартнерыСегмента.Сегмент,
							|	"+ПредставлениеТаблицы+".Дата
							|ИЗ
							|	Документ."+ПредставлениеТаблицы+" КАК "+ПредставлениеТаблицы+"
							|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
							|		ПО "+РеквизитПартнер+" = ПартнерыСегмента.Партнер
							|ГДЕ
							|	НЕ "+ПредставлениеТаблицы+".ПометкаУдаления";
							
						КонецЕсли;
						
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТекстЗапросаПоДокументам;
КонецФункции


Функция ЭтоТипОбъектаВоронкиПродаж(Тип) Экспорт
	
	СписокИсключаемыхТипов = Новый СписокЗначений;
	СписокИсключаемыхТипов.Добавить(Тип("СправочникСсылка.МаркетинговыеМероприятия"));
	СписокИсключаемыхТипов.Добавить(Тип("ДокументСсылка.CRM_ОтчетОРаботе"));
	СписокИсключаемыхТипов.Добавить(Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее"));
	СписокИсключаемыхТипов.Добавить(Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее"));
	СписокИсключаемыхТипов.Добавить(Тип("ДокументСсылка.ТелефонныйЗвонок"));
	СписокИсключаемыхТипов.Добавить(Тип("ДокументСсылка.СообщениеSMS"));
	СписокИсключаемыхТипов.Добавить(Тип("ДокументСсылка.Анкета"));
	СписокИсключаемыхТипов.Добавить(Тип("ДокументСсылка.УдалитьCRM_Событие"));
	СписокИсключаемыхТипов.Добавить(Тип("ДокументСсылка.CRM_Интерес"));
	СписокИсключаемыхТипов.Добавить(Тип("ДокументСсылка.CRM_Взаимодействие"));
	
	Если СписокИсключаемыхТипов.НайтиПоЗначению(Тип)<>Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Метаданные.ПланыВидовХарактеристик.CRM_ВидыОбъектовБизнесПроцессов.Тип.СодержитТип(Тип);
	
КонецФункции

Процедура ПриЗаписиОбъектаВоронкиПродаж(Источник, Отказ) Экспорт
	
	
	
	//Пока воронка не используется
	//Блашин Евгений Игоревич
	Возврат;
	
	// Записи по Интересам
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		
		Если ЗначениеЗаполнено(Источник.СостояниеИнтереса) Тогда
			
			НаборЗаписей = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
			НаборЗаписей.Отбор.СостояниеЭтапа.Установить(Перечисления.CRM_СостоянияЭтаповВоронки.Активный);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() > 0 Тогда
				АктивнаяЗапись = НаборЗаписей[0];
				Если АктивнаяЗапись.Этап <> Источник.СостояниеИнтереса Тогда
					Если Источник.СостояниеИнтереса		= Справочники.CRM_СостоянияИнтересов.ИнтересПотерян Тогда
						СостояниеЭтапа		= Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно;
					Иначе
						СостояниеЭтапа		= Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно;
					КонецЕсли;
					МенеджерЗаписи = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, АктивнаяЗапись, , "СостояниеЭтапа");
					МенеджерЗаписи.СостояниеЭтапа = СостояниеЭтапа;
					МенеджерЗаписи.ДатаЗавершения = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
					МенеджерЗаписи.Записать();
					НаборЗаписей.Очистить();
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЕсли;
			
			НоваяЗапись = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьМенеджерЗаписи();
			НоваяЗапись.Объект = Источник.Ссылка;
			НоваяЗапись.Этап = Источник.СостояниеИнтереса;
			НоваяЗапись.Прочитать();
			Если НЕ НоваяЗапись.Выбран() Тогда
				НоваяЗапись.ДатаНачала = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
				НоваяЗапись.Объект = Источник.Ссылка;
				НоваяЗапись.Этап = Источник.СостояниеИнтереса;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Источник.Партнер) Тогда
				НоваяЗапись.Партнер			= Источник.Партнер;
			ИначеЕсли ЗначениеЗаполнено(Источник.ПотенциальныйКлиент) Тогда
				НоваяЗапись.Партнер			= Источник.ПотенциальныйКлиент;
			КонецЕсли;
			
			НоваяЗапись.Пользователь	= Источник.Ответственный;
			НоваяЗапись.Подразделение	= Источник.Подразделение;
			НоваяЗапись.Офис			= Источник.Офис;
			НоваяЗапись.ТипУслуги		= Источник.ТипУслуги;
			НоваяЗапись.Сумма			= Источник.ОжидаемаяВыручка;
			НоваяЗапись.Количество = 1;

			НоваяЗапись.Этап   = Источник.СостояниеИнтереса;
			Если Источник.СостояниеИнтереса	= Справочники.CRM_СостоянияИнтересов.ИнтересПотерян Тогда
				НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно;
				Если Не ЗначениеЗаполнено(НоваяЗапись.ДатаЗавершения) Тогда
					НоваяЗапись.ДатаЗавершения = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
				КонецЕсли;
			ИначеЕсли Источник.СостояниеИнтереса = Справочники.CRM_СостоянияИнтересов.ИнтересЗакрыт Тогда
				НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно;
				Если Не ЗначениеЗаполнено(НоваяЗапись.ДатаЗавершения) Тогда
					НоваяЗапись.ДатаЗавершения = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
				КонецЕсли;
			Иначе
				НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.Активный;
				НоваяЗапись.ПлановаяДата = Источник.ДатаСледующегоДействия;
			КонецЕсли;
				
			НоваяЗапись.Записать();
		КонецЕсли;
		
	// Записи по БизнесПроцессам
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ЗадачаСсылка.ЗадачаИсполнителя")
	И ЗначениеЗаполнено(Источник.БизнесПроцесс)
	И ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		
		НаборЗаписей = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Источник.БизнесПроцесс);
		НаборЗаписей.Отбор.Этап.Установить(Источник.CRM_ТочкаМаршрута);
		
		НоваяЗапись					= НаборЗаписей.Добавить();
		НоваяЗапись.Объект			= Источник.БизнесПроцесс;
		НоваяЗапись.Этап			= Источник.CRM_ТочкаМаршрута;
		Если ЗначениеЗаполнено(Источник.ДатаИсполнения) Тогда
			НоваяЗапись.СостояниеЭтапа = ?(Источник.CRM_Неудача, Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно, Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно);
		Иначе	
			НоваяЗапись.СостояниеЭтапа	= Перечисления.CRM_СостоянияЭтаповВоронки.Активный;
		КонецЕсли;
		НоваяЗапись.Партнер			= Источник.БизнесПроцесс.Партнер;
		НоваяЗапись.КартаМаршрута	= Источник.БизнесПроцесс.КартаМаршрута;
		НоваяЗапись.Пользователь	= Источник.БизнесПроцесс.Ответственный;
		НоваяЗапись.Подразделение	= Источник.БизнесПроцесс.Подразделение;
		Если ЗначениеЗаполнено(НоваяЗапись.Подразделение) Тогда
			НоваяЗапись.Офис			= НоваяЗапись.Подразделение.CRM_Офис;
		КонецЕсли;
		НоваяЗапись.Сумма			= Источник.БизнесПроцесс.Сумма;
		НоваяЗапись.ПлановаяДата	= Источник.СрокИсполнения;
		НоваяЗапись.ДатаНачала		= Источник.ДатаНачала;
		НоваяЗапись.ДатаЗавершения	= Источник.ДатаИсполнения;
		НоваяЗапись.Количество = 1;
		НаборЗаписей.Записать();
		
	ИначеЕсли ЭтоТипОбъектаВоронкиПродаж(ТипЗнч(Источник.Ссылка)) Тогда
		
		Если Источник.ПометкаУдаления Тогда
			НаборЗаписей = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
			НаборЗаписей.Записать();
			Возврат;
		КонецЕсли;
		
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("Объект", Источник.Ссылка);
		
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.CRM_РассылкаЭлектронныхПисем") Тогда
			
			НаборЗаписей = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
			
			НоваяЗапись					= НаборЗаписей.Добавить();
			НоваяЗапись.Объект			= Источник.Ссылка;
			НоваяЗапись.Этап			= ПланыВидовХарактеристик.CRM_ВидыОбъектовБизнесПроцессов.РассылкаЭлектронныхПисем;
			НоваяЗапись.СостояниеЭтапа	= Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно;
			НоваяЗапись.Пользователь	= Источник.Ответственный;
			НоваяЗапись.Подразделение	= Источник.Подразделение;
			Если ЗначениеЗаполнено(НоваяЗапись.Подразделение) Тогда
				НоваяЗапись.Офис			= НоваяЗапись.Подразделение.CRM_Офис;
			КонецЕсли;
			НоваяЗапись.ПлановаяДата	= Источник.Дата;
			НоваяЗапись.ДатаНачала		= Источник.Дата;
			НоваяЗапись.ДатаЗавершения	= Источник.Дата;
			НоваяЗапись.Количество = Источник.Получатели.Количество();

			НаборЗаписей.Записать();
			
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.CRM_Телемаркетинг") Тогда
			
			НаборЗаписей = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
			
			СтруктураЗаписи.Вставить("Пользователь", Источник.Ответственный);
			СтруктураЗаписи.Вставить("Подразделение", Источник.Подразделение);
			Если ЗначениеЗаполнено(СтруктураЗаписи.Подразделение) Тогда
				СтруктураЗаписи.Вставить("Офис", СтруктураЗаписи.Подразделение.CRM_Офис);
			КонецЕсли;
			СтруктураЗаписи.Вставить("ПлановаяДата", Источник.ДатаНачала);
			СтруктураЗаписи.Вставить("ДатаНачала", Источник.ДатаНачала);
			СтруктураЗаписи.Вставить("ДатаЗавершения", Источник.ДатаОкончания);
			СтруктураЗаписи.Вставить("Этап", ПланыВидовХарактеристик.CRM_ВидыОбъектовБизнесПроцессов.Телемаркетинг);
			
			Если НЕ Источник.Завершен Тогда
				НоваяЗапись	= НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
				НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.Активный;
				НоваяЗапись.Количество = Источник.Участники.Количество();
			Иначе
				Успешных = Источник.Участники.НайтиСтроки(Новый Структура("Обработан", Истина)).Количество();
				НеУдачных = Источник.Участники.НайтиСтроки(Новый Структура("НеДозвонились", Истина)).Количество();
				Если Успешных > 0 Тогда
					НоваяЗапись	= НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
					НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно;
					НоваяЗапись.Количество = Успешных;
				КонецЕсли;
				Если НеУдачных > 0 Тогда
					НоваяЗапись	= НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
					НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно;
					НоваяЗапись.Количество = НеУдачных;
				КонецЕсли;
			КонецЕсли;
			НаборЗаписей.Записать();
			
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СообщениеSMS") Тогда
			
			НаборЗаписей = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
			
			СтруктураЗаписи.Вставить("Пользователь", Источник.Ответственный);
			СтруктураЗаписи.Вставить("Подразделение", Источник.CRM_ПодразделениеЗаказчик);
			Если ЗначениеЗаполнено(СтруктураЗаписи.Подразделение) Тогда
				СтруктураЗаписи.Вставить("Офис", СтруктураЗаписи.Подразделение.CRM_Офис);
			КонецЕсли;
			СтруктураЗаписи.Вставить("ПлановаяДата", Источник.Дата);
			СтруктураЗаписи.Вставить("ДатаНачала", Источник.Дата);
			СтруктураЗаписи.Вставить("ДатаЗавершения", Источник.Дата);
			СтруктураЗаписи.Вставить("Этап", ПланыВидовХарактеристик.CRM_ВидыОбъектовБизнесПроцессов.СМС);
			
			Успешных = 0;
			НеУдачных = 0;
			Для каждого Сообщение из Источник.Адресаты Цикл
				Если Сообщение.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.Исходящее
					ИЛИ Сообщение.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.ОтправляетсяПровайдером
					ИЛИ Сообщение.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.Доставлено
					ИЛИ Сообщение.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.ОтправленоПровайдером Тогда
					
					Успешных = Успешных+1;
					
				ИначеЕсли Сообщение.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.НеУдалосьПередатьПровайдеру
					ИЛИ Сообщение.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.НеОтправленоПровайдером
					ИЛИ Сообщение.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.НеДоставлено
					ИЛИ Сообщение.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.НеОпознаноПровайдером Тогда
					
					НеУдачных = НеУдачных+1;
					
				КонецЕсли;
			КонецЦикла;
			Если Успешных > 0 Тогда
				НоваяЗапись	= НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
				НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно;
				НоваяЗапись.Количество = Успешных;
			КонецЕсли;
			Если НеУдачных > 0 Тогда
				НоваяЗапись	= НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
				НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно;
				НоваяЗапись.Количество = НеУдачных;
			КонецЕсли;
			НаборЗаписей.Записать();
			
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
			
			НаборЗаписей = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
			
			СтруктураЗаписи.Вставить("Пользователь", Источник.Менеджер);
			СтруктураЗаписи.Вставить("Подразделение", Источник.CRM_Подразделение);
			Если ЗначениеЗаполнено(СтруктураЗаписи.Подразделение) Тогда
				СтруктураЗаписи.Вставить("Офис", СтруктураЗаписи.Подразделение.CRM_Офис);
			КонецЕсли;
			СтруктураЗаписи.Вставить("ПлановаяДата", Источник.Дата);
			СтруктураЗаписи.Вставить("ДатаНачала", Источник.Дата);
			СтруктураЗаписи.Вставить("ДатаЗавершения", Источник.Дата);
			СтруктураЗаписи.Вставить("Партнер", Источник.Партнер);
			СтруктураЗаписи.Вставить("Сумма", Источник.СуммаДокумента);
			СтруктураЗаписи.Вставить("Этап", ПланыВидовХарактеристик.CRM_ВидыОбъектовБизнесПроцессов.КоммерческоеПредложение);
			
			Если Источник.Товары.НайтиСтроки(Новый Структура("CRM_Утвержден", Истина)).Количество() > 0 Тогда
				НоваяЗапись	= НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
				НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно;
				НоваяЗапись.Количество = 1;
			КонецЕсли;

			НаборЗаписей.Записать();
			
		ИначеЕсли CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() И ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.CRM_СчетНаОплатуПокупателю") Тогда
			
			НаборЗаписей = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
			
			СтруктураЗаписи.Вставить("Пользователь", Источник.Ответственный);
			СтруктураЗаписи.Вставить("Подразделение", Источник.Подразделение);
			Если ЗначениеЗаполнено(СтруктураЗаписи.Подразделение) Тогда
				СтруктураЗаписи.Вставить("Офис", СтруктураЗаписи.Подразделение.CRM_Офис);
			КонецЕсли;
			СтруктураЗаписи.Вставить("ПлановаяДата", Источник.Дата);
			СтруктураЗаписи.Вставить("ДатаНачала", Источник.Дата);
			СтруктураЗаписи.Вставить("ДатаЗавершения", Источник.Дата);
			СтруктураЗаписи.Вставить("Партнер", Источник.Партнер);
			СтруктураЗаписи.Вставить("Сумма", Источник.СуммаДокумента);
			СтруктураЗаписи.Вставить("СуммаОтгружено", Источник.СуммаОтгрузки);
			СтруктураЗаписи.Вставить("СуммаОплачено", Источник.СуммаОплаты);
			СтруктураЗаписи.Вставить("Этап", ПланыВидовХарактеристик.CRM_ВидыОбъектовБизнесПроцессов.Счет);
			
			НоваяЗапись	= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
			НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно;
			НоваяЗапись.Количество = 1;
			НаборЗаписей.Записать();
			
		Иначе
			
			НаборЗаписей = РегистрыСведений.CRM_СостоянияВоронкиПродаж.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
			
			МетаданныеДокумента = Источник.Метаданные();
			
			Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
				СтруктураЗаписи.Вставить("Пользователь", Источник.Ответственный);
			КонецЕсли;
			
			Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Подразделение", МетаданныеДокумента) Тогда
				СтруктураЗаписи.Вставить("Подразделение", Источник.Подразделение);
			ИначеЕсли CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
				СтруктураЗаписи.Вставить("Пользователь", Источник.Ответственный.Подразделение);
			КонецЕсли;
							
			Если СтруктураЗаписи.Свойство("Подразделение") И ЗначениеЗаполнено(СтруктураЗаписи.Подразделение) Тогда
				СтруктураЗаписи.Вставить("Офис", СтруктураЗаписи.Подразделение.CRM_Офис);
			КонецЕсли;
			СтруктураЗаписи.Вставить("ПлановаяДата", Источник.Дата);
			СтруктураЗаписи.Вставить("ДатаНачала", Источник.Дата);
			СтруктураЗаписи.Вставить("ДатаЗавершения", Источник.Дата);
			
			Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("Партнер", МетаданныеДокумента) Тогда
				СтруктураЗаписи.Вставить("Партнер", Источник.Партнер);
			КонецЕсли;
			
			ВыборкаПВХ = ПланыВидовХарактеристик.CRM_ВидыОбъектовБизнесПроцессов.Выбрать();
			Пока ВыборкаПВХ.Следующий() Цикл
				Если ВыборкаПВХ.ТипЗначения.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
					СтруктураЗаписи.Вставить("Этап", ВыборкаПВХ.Ссылка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			НоваяЗапись	= НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
			НоваяЗапись.СостояниеЭтапа = Перечисления.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно;
			НоваяЗапись.Количество = 1;
			НаборЗаписей.Записать();
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Функция _ВоронкаПродажПолучитьТекстЗапроса(Форма) Экспорт
	
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВложенныйЗапрос.Ссылка КАК Этап,
		               |	ВложенныйЗапрос.КартаМаршрута КАК КартаМаршрута,
		               |	ВложенныйЗапрос.ТочкаМаршрута КАК ТочкаМаршрута,
		               |	ВложенныйЗапрос.РеквизитДопУпорядочивания КАК Порядок
		               |ПОМЕСТИТЬ ЭтапыТочекМаршрута
		               |ИЗ
		               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		               |		CRM_ВоронкиПродажСостав.Ссылка КАК Ссылка,
		               |		CRM_ВоронкиПродажСостав.КартаМаршрута КАК КартаМаршрута,
		               |		CRM_ВоронкиПродажСостав.ТочкаМаршрута КАК ТочкаМаршрута,
		               |		CRM_ВоронкиПродажСостав.Ссылка.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		               |	ИЗ
		               |		Справочник.CRM_ВоронкиПродаж.Состав КАК CRM_ВоронкиПродажСостав
		               |	ГДЕ
		               |		CRM_ВоронкиПродажСостав.Ссылка.Родитель = &Воронка
		               |		И НЕ CRM_ВоронкиПродажСостав.Ссылка.ПометкаУдаления
		               |	
		               |	УПОРЯДОЧИТЬ ПО
		               |		РеквизитДопУпорядочивания) КАК ВложенныйЗапрос
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	CRM_СостоянияВоронкиПродаж.Объект КАК Объект,
		               |	МИНИМУМ(CRM_СостоянияВоронкиПродаж.ДатаНачала) КАК ПерваяДата,
		               |	МАКСИМУМ(ЭтапыТочекМаршрута.Порядок) КАК ПорядокМакс,
		               |	МАКСИМУМ(CRM_СостоянияВоронкиПродаж.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ CRM_СостоянияВоронкиПродажОбъекты
		               |ИЗ
		               |	РегистрСведений.CRM_СостоянияВоронкиПродаж КАК CRM_СостоянияВоронкиПродаж
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		               |		ПО (ЭтапыТочекМаршрута.ТочкаМаршрута = CRM_СостоянияВоронкиПродаж.Этап)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		               |		ПО (ПартнерыСегмента.Партнер = CRM_СостоянияВоронкиПродаж.Партнер)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ИсточникиПервичногоИнтересаСрезПоследних.Период КАК Период,
		               |			ИсточникиПервичногоИнтересаСрезПоследних.Партнер КАК Партнер,
		               |			ИсточникиПервичногоИнтересаСрезПоследних.КаналПервичногоИнтереса КАК ИсточникПривлечения,
		               |			ИсточникиПервичногоИнтересаСрезПоследних.ИсточникПервичногоИнтереса КАК ЗначениеИсточникаПривлечения
		               |		ИЗ
		               |			РегистрСведений.ИсточникиПервичногоИнтереса.СрезПоследних КАК ИсточникиПервичногоИнтересаСрезПоследних
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |					МАКСИМУМ(ИсточникиПервичногоИнтересаСрезПоследних.Период) КАК Период,
		               |					ИсточникиПервичногоИнтересаСрезПоследних.Партнер КАК Партнер
		               |				ИЗ
		               |					РегистрСведений.ИсточникиПервичногоИнтереса.СрезПоследних КАК ИсточникиПервичногоИнтересаСрезПоследних
		               |				
		               |				СГРУППИРОВАТЬ ПО
		               |					ИсточникиПервичногоИнтересаСрезПоследних.Партнер) КАК МаксДатыСреза
		               |				ПО ИсточникиПервичногоИнтересаСрезПоследних.Период = МаксДатыСреза.Период
		               |					И ИсточникиПервичногоИнтересаСрезПоследних.Партнер = МаксДатыСреза.Партнер) КАК СрезПервичногоИнтереса
		               |		ПО CRM_СостоянияВоронкиПродаж.Партнер = СрезПервичногоИнтереса.Партнер
		               |			И CRM_СостоянияВоронкиПродаж.Объект.Дата >= СрезПервичногоИнтереса.Период
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродаж.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
		               |				ТОГДА CRM_СостоянияВоронкиПродаж.ДатаЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
		               |			ИНАЧЕ ВЫБОР
		               |					КОГДА CRM_СостоянияВоронкиПродаж.ПлановаяДата <> ДАТАВРЕМЯ(1, 1, 1)
		               |						ТОГДА CRM_СостоянияВоронкиПродаж.ПлановаяДата МЕЖДУ &НачалоПериода И &КонецПериода
		               |					ИНАЧЕ ИСТИНА
		               |				КОНЕЦ
		               |		КОНЕЦ
		               |	И НЕ CRM_СостоянияВоронкиПродаж.Объект.ПометкаУдаления
		               |	И (ВЫБОР
		               |				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА Документ.CRM_Интерес
		               |					ТОГДА CRM_СостоянияВоронкиПродаж.Объект.ДатаЗакрытия
		               |				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
		               |					ТОГДА CRM_СостоянияВоронкиПродаж.Объект.ДатаЗавершения
		               |				ИНАЧЕ CRM_СостоянияВоронкиПродаж.Объект.Дата
		               |			КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
		               |			ИЛИ ВЫБОР
		               |				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА Документ.CRM_Интерес
		               |					ТОГДА CRM_СостоянияВоронкиПродаж.Объект.ДатаЗакрытия
		               |				КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
		               |					ТОГДА CRM_СостоянияВоронкиПродаж.Объект.ДатаЗавершения
		               |				ИНАЧЕ CRM_СостоянияВоронкиПродаж.Объект.Дата
		               |			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1))
		               |{ГДЕ
		               |	CRM_СостоянияВоронкиПродаж.Пользователь КАК Пользователь,
		               |	CRM_СостоянияВоронкиПродаж.Офис КАК Офис,
		               |	CRM_СостоянияВоронкиПродаж.ТипУслуги КАК ТипУслуги,
		               |	CRM_СостоянияВоронкиПродаж.Подразделение КАК Подразделение,
		               |	CRM_СостоянияВоронкиПродаж.Партнер.БизнесРегион КАК БизнесРегион,
		               |	CRM_СостоянияВоронкиПродаж.СостояниеЭтапа КАК СостояниеЭтапа,
		               |	ПартнерыСегмента.Сегмент КАК Сегмент,
		               |	(CRM_СостоянияВоронкиПродаж.Партнер.ДатаРегистрации > &НачалоПериода
		               |			ИЛИ CRM_СостоянияВоронкиПродаж.Партнер ССЫЛКА Справочник.CRM_ПотенциальныеКлиенты) КАК НовыйКлиент,
		               |	СрезПервичногоИнтереса.ИсточникПривлечения КАК ИсточникПривлечения,
		               |	СрезПервичногоИнтереса.ЗначениеИсточникаПривлечения КАК ЗначениеИсточникаПривлечения,
		               |	(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА Документ.CRM_Интерес
		               |				ТОГДА CRM_СостоянияВоронкиПродаж.Объект.Завершен
		               |			КОГДА CRM_СостоянияВоронкиПродаж.Объект ССЫЛКА БизнесПроцесс.CRM_БизнесПроцесс
		               |				ТОГДА CRM_СостоянияВоронкиПродаж.Объект.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ) КАК Завершено}
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CRM_СостоянияВоронкиПродаж.Объект
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика,
		               |	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньВключенВГрафик
		               |ПОМЕСТИТЬ КалендарныйГрафик
		               |ИЗ
		               |	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			МИНИМУМ(CRM_СостоянияВоронкиПродажОбъекты.ПерваяДата) КАК ПерваяДата
		               |		ИЗ
		               |			CRM_СостоянияВоронкиПродажОбъекты КАК CRM_СостоянияВоронкиПродажОбъекты) КАК ВложенныйЗапрос
		               |		ПО КалендарныеГрафики.ДатаГрафика >= ВложенныйЗапрос.ПерваяДата
		               |ГДЕ
		               |	КалендарныеГрафики.Календарь = &Календарь
		               |	И КалендарныеГрафики.ДатаГрафика <= &ТекущаяДата
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	CRM_СостоянияВоронкиПродажОбъекты.Объект КАК Объект,
		               |	ЭтапыТочекМаршрута.Этап КАК Этап,
		               |	CRM_СостоянияВоронкиПродажОбъекты.ПерваяДата КАК ПерваяДата,
		               |	CRM_СостоянияВоронкиПродажОбъекты.Сумма КАК Сумма
		               |ПОМЕСТИТЬ ЭтапыОбъектов
		               |ИЗ
		               |	CRM_СостоянияВоронкиПродажОбъекты КАК CRM_СостоянияВоронкиПродажОбъекты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		               |		ПО (ЭтапыТочекМаршрута.Порядок <= CRM_СостоянияВоронкиПродажОбъекты.ПорядокМакс)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЭтапыОбъектов.Этап КАК Этап,
		               |	ЭтапыОбъектов.ПерваяДата КАК ПерваяДата,
		               |	CRM_СостоянияВоронкиПродаж.Объект КАК Объект,
		               |	CRM_СостоянияВоронкиПродаж.СостояниеЭтапа КАК СостояниеЭтапа,
		               |	CRM_СостоянияВоронкиПродаж.Партнер КАК Партнер,
		               |	CRM_СостоянияВоронкиПродаж.Пользователь КАК Пользователь,
		               |	CRM_СостоянияВоронкиПродаж.Подразделение КАК Подразделение,
		               |	CRM_СостоянияВоронкиПродаж.Офис КАК Офис,
		               |	CRM_СостоянияВоронкиПродаж.КартаМаршрута КАК КартаМаршрута,
		               |	CRM_СостоянияВоронкиПродаж.ТипУслуги КАК ТипУслуги,
		               |	CRM_СостоянияВоронкиПродаж.ДатаНачала КАК ДатаНачала,
		               |	CRM_СостоянияВоронкиПродаж.ДатаЗавершения КАК ДатаЗавершения,
		               |	CRM_СостоянияВоронкиПродаж.ПлановаяДата КАК ПлановаяДата,
		               |	ВЫБОР
		               |		КОГДА CRM_СостоянияВоронкиПродаж.Сумма = 0
		               |				ИЛИ CRM_СостоянияВоронкиПродаж.Сумма ЕСТЬ NULL
		               |			ТОГДА ЭтапыОбъектов.Сумма
		               |		ИНАЧЕ CRM_СостоянияВоронкиПродаж.Сумма
		               |	КОНЕЦ КАК Сумма,
		               |	CRM_СостоянияВоронкиПродаж.СуммаОтгружено КАК СуммаОтгружено,
		               |	CRM_СостоянияВоронкиПродаж.СуммаОплачено КАК СуммаОплачено,
		               |	CRM_СостоянияВоронкиПродаж.Количество КАК Количество
		               |ПОМЕСТИТЬ CRM_СостоянияВоронкиПродажОтбор
		               |ИЗ
		               |	ЭтапыОбъектов КАК ЭтапыОбъектов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостоянияВоронкиПродаж КАК CRM_СостоянияВоронкиПродаж
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		               |			ПО CRM_СостоянияВоронкиПродаж.Этап = ЭтапыТочекМаршрута.ТочкаМаршрута
		               |		ПО (ЭтапыТочекМаршрута.Этап = ЭтапыОбъектов.Этап)
		               |			И ЭтапыОбъектов.Объект = CRM_СостоянияВоронкиПродаж.Объект
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЭтапыОбъектов.Этап КАК Этап,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.Активный)
		               |				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Количество
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоличествоАктивных,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно)
		               |				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Количество
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоличествоУспешных,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно)
		               |				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Количество
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоличествоНеудачных,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа ЕСТЬ NULL
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоличествоПропущенных,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.Активный)
		               |				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК СуммаАктивных,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенУспешно)
		               |				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК СуммаУспешных,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.CRM_СостоянияЭтаповВоронки.ЗавершенНеудачно)
		               |				ТОГДА CRM_СостоянияВоронкиПродажОтбор.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК СуммаНеудачных,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа ЕСТЬ NULL
		               |				ТОГДА ЭтапыОбъектов.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК СуммаПропущенных
		               |ПОМЕСТИТЬ ИтогиПоЭтапам
		               |ИЗ
		               |	ЭтапыОбъектов КАК ЭтапыОбъектов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			CRM_СостоянияВоронкиПродажОтбор.Этап КАК Этап,
		               |			CRM_СостоянияВоронкиПродажОтбор.Объект КАК Объект,
		               |			МИНИМУМ(CRM_СостоянияВоронкиПродажОтбор.СостояниеЭтапа) КАК СостояниеЭтапа,
		               |			МАКСИМУМ(CRM_СостоянияВоронкиПродажОтбор.Сумма) КАК Сумма,
		               |			МАКСИМУМ(CRM_СостоянияВоронкиПродажОтбор.СуммаОтгружено) КАК СуммаОтгружено,
		               |			МАКСИМУМ(CRM_СостоянияВоронкиПродажОтбор.СуммаОплачено) КАК СуммаОплачено,
		               |			МАКСИМУМ(CRM_СостоянияВоронкиПродажОтбор.Количество) КАК Количество
		               |		ИЗ
		               |			CRM_СостоянияВоронкиПродажОтбор КАК CRM_СостоянияВоронкиПродажОтбор
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			CRM_СостоянияВоронкиПродажОтбор.Этап,
		               |			CRM_СостоянияВоронкиПродажОтбор.Объект) КАК CRM_СостоянияВоронкиПродажОтбор
		               |		ПО ЭтапыОбъектов.Объект = CRM_СостоянияВоронкиПродажОтбор.Объект
		               |			И ЭтапыОбъектов.Этап = CRM_СостоянияВоронкиПродажОтбор.Этап
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЭтапыОбъектов.Этап
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CRM_СостоянияВоронкиПродажОтбор.Этап КАК Этап,
		               |	CRM_СостоянияВоронкиПродажОтбор.Объект КАК Объект,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.ДатаНачала <= КалендарныйГрафик.ДатаГрафика
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ВремяВыполненияВДнях,
		               |	СУММА(ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродажОтбор.ПерваяДата <= КалендарныйГрафик.ДатаГрафика
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ВремяВыполненияВДняхСНачала
		               |ПОМЕСТИТЬ ДлительностьПоЭтапамОбъектов
		               |ИЗ
		               |	CRM_СостоянияВоронкиПродажОтбор КАК CRM_СостоянияВоронкиПродажОтбор
		               |		ЛЕВОЕ СОЕДИНЕНИЕ КалендарныйГрафик КАК КалендарныйГрафик
		               |		ПО CRM_СостоянияВоронкиПродажОтбор.ДатаНачала <= КалендарныйГрафик.ДатаГрафика
		               |			И (ВЫБОР
		               |				КОГДА CRM_СостоянияВоронкиПродажОтбор.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
		               |					ТОГДА &ТекущаяДата
		               |				ИНАЧЕ CRM_СостоянияВоронкиПродажОтбор.ДатаЗавершения
		               |			КОНЕЦ >= КалендарныйГрафик.ДатаГрафика)
		               |			И (КалендарныйГрафик.ДеньВключенВГрафик)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CRM_СостоянияВоронкиПродажОтбор.Этап,
		               |	CRM_СостоянияВоронкиПродажОтбор.Объект
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДлительностьПоЭтапамОбъектов.Этап КАК Этап,
		               |	СУММА(ДлительностьПоЭтапамОбъектов.ВремяВыполненияВДнях) КАК ВремяВыполненияВДнях,
		               |	ВЫБОР
		               |		КОГДА КОЛИЧЕСТВО(ДлительностьПоЭтапамОбъектов.Объект) <> 0
		               |			ТОГДА СУММА(ДлительностьПоЭтапамОбъектов.ВремяВыполненияВДняхСНачала) / КОЛИЧЕСТВО(ДлительностьПоЭтапамОбъектов.Объект)
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК ВремяВыполненияВДняхСНачалаСред
		               |ПОМЕСТИТЬ ДлительностьПоЭтапам
		               |ИЗ
		               |	ДлительностьПоЭтапамОбъектов КАК ДлительностьПоЭтапамОбъектов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДлительностьПоЭтапамОбъектов.Этап
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЭтапыТочекМаршрута.Этап КАК Этап,
		               |	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.КоличествоАктивных, 0)) КАК КоличествоАктивных,
		               |	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.КоличествоУспешных, 0)) КАК КоличествоУспешных,
		               |	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.КоличествоНеудачных, 0)) КАК КоличествоНеудачных,
		               |	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.КоличествоПропущенных, 0)) КАК КоличествоПропущенных,
		               |	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.СуммаАктивных, 0)) КАК СуммаАктивных,
		               |	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.СуммаУспешных, 0)) КАК СуммаУспешных,
		               |	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.СуммаНеудачных, 0)) КАК СуммаНеудачных,
		               |	МАКСИМУМ(ЕСТЬNULL(ИтогиПоЭтапам.СуммаПропущенных, 0)) КАК СуммаПропущенных,
		               |	МАКСИМУМ(ЕСТЬNULL(ДлительностьПоЭтапам.ВремяВыполненияВДнях, 0)) КАК ВремяВыполненияВДнях,
		               |	МАКСИМУМ(ЕСТЬNULL(ДлительностьПоЭтапам.ВремяВыполненияВДняхСНачалаСред, 0)) КАК ВремяВыполненияВДняхСНачалаСред,
		               |	ЭтапыТочекМаршрута.Порядок КАК Порядок
		               |ИЗ
		               |	ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогиПоЭтапам КАК ИтогиПоЭтапам
		               |		ПО (ИтогиПоЭтапам.Этап = ЭтапыТочекМаршрута.Этап)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ДлительностьПоЭтапам КАК ДлительностьПоЭтапам
		               |		ПО (ДлительностьПоЭтапам.Этап = ЭтапыТочекМаршрута.Этап)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЭтапыТочекМаршрута.Этап,
		               |	ЭтапыТочекМаршрута.Порядок
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Порядок";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция _ВоронкаПродажПолучитьТекстЗапросаРасшифрокиПоСостояниямИнтересов() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВложенныйЗапрос.Ссылка КАК Этап,
		               |	ВложенныйЗапрос.КартаМаршрута КАК КартаМаршрута,
		               |	ВложенныйЗапрос.ТочкаМаршрута КАК ТочкаМаршрута,
		               |	ВложенныйЗапрос.РеквизитДопУпорядочивания КАК Порядок
		               |ПОМЕСТИТЬ ЭтапыТочекМаршрута
		               |ИЗ
		               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		               |		CRM_ВоронкиПродажСостав.Ссылка КАК Ссылка,
		               |		CRM_ВоронкиПродажСостав.КартаМаршрута КАК КартаМаршрута,
		               |		CRM_ВоронкиПродажСостав.ТочкаМаршрута КАК ТочкаМаршрута,
		               |		CRM_ВоронкиПродажСостав.Ссылка.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
		               |	ИЗ
		               |		Справочник.CRM_ВоронкиПродаж.Состав КАК CRM_ВоронкиПродажСостав
		               |	ГДЕ
		               |		CRM_ВоронкиПродажСостав.Ссылка.Родитель = &Воронка
		               |		И НЕ CRM_ВоронкиПродажСостав.Ссылка.ПометкаУдаления
		               |	
		               |	УПОРЯДОЧИТЬ ПО
		               |		РеквизитДопУпорядочивания) КАК ВложенныйЗапрос
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	CRM_СостоянияВоронкиПродаж.Объект КАК Объект,
		               |	МАКСИМУМ(ЭтапыТочекМаршрута.Порядок) КАК ПорядокМакс
		               |ПОМЕСТИТЬ CRM_СостоянияВоронкиПродажОбъекты
		               |ИЗ
		               |	РегистрСведений.CRM_СостоянияВоронкиПродаж КАК CRM_СостоянияВоронкиПродаж
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭтапыТочекМаршрута КАК ЭтапыТочекМаршрута
		               |		ПО (ЭтапыТочекМаршрута.ТочкаМаршрута = CRM_СостоянияВоронкиПродаж.Этап)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		               |		ПО (ПартнерыСегмента.Партнер = CRM_СостоянияВоронкиПродаж.Партнер)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ИсточникиПервичногоИнтересаСрезПоследних.Период КАК Период,
		               |			ИсточникиПервичногоИнтересаСрезПоследних.Партнер КАК Партнер,
		               |			ИсточникиПервичногоИнтересаСрезПоследних.КаналПервичногоИнтереса КАК ИсточникПривлечения,
		               |			ИсточникиПервичногоИнтересаСрезПоследних.ИсточникПервичногоИнтереса КАК ЗначениеИсточникаПривлечения
		               |		ИЗ
		               |			РегистрСведений.ИсточникиПервичногоИнтереса.СрезПоследних КАК ИсточникиПервичногоИнтересаСрезПоследних
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |					МАКСИМУМ(ИсточникиПервичногоИнтересаСрезПоследних.Период) КАК Период,
		               |					ИсточникиПервичногоИнтересаСрезПоследних.Партнер КАК Партнер
		               |				ИЗ
		               |					РегистрСведений.ИсточникиПервичногоИнтереса.СрезПоследних КАК ИсточникиПервичногоИнтересаСрезПоследних
		               |				
		               |				СГРУППИРОВАТЬ ПО
		               |					ИсточникиПервичногоИнтересаСрезПоследних.Партнер) КАК МаксДатыСреза
		               |				ПО ИсточникиПервичногоИнтересаСрезПоследних.Период = МаксДатыСреза.Период
		               |					И ИсточникиПервичногоИнтересаСрезПоследних.Партнер = МаксДатыСреза.Партнер) КАК СрезПервичногоИнтереса
		               |		ПО CRM_СостоянияВоронкиПродаж.Партнер = СрезПервичногоИнтереса.Партнер
		               |			И CRM_СостоянияВоронкиПродаж.Объект.Дата >= СрезПервичногоИнтереса.Период
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА CRM_СостоянияВоронкиПродаж.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
		               |				ТОГДА CRM_СостоянияВоронкиПродаж.ДатаЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
		               |			ИНАЧЕ ВЫБОР
		               |					КОГДА CRM_СостоянияВоронкиПродаж.ПлановаяДата <> ДАТАВРЕМЯ(1, 1, 1)
		               |						ТОГДА CRM_СостоянияВоронкиПродаж.ПлановаяДата МЕЖДУ &НачалоПериода И &КонецПериода
		               |					ИНАЧЕ ИСТИНА
		               |				КОНЕЦ
		               |		КОНЕЦ
		               |	И НЕ CRM_СостоянияВоронкиПродаж.Объект.ПометкаУдаления
		               |	И CRM_СостоянияВоронкиПродаж.СостояниеЭтапа В(&СписокСостояний)
		               |{ГДЕ
		               |	CRM_СостоянияВоронкиПродаж.Пользователь КАК Пользователь,
		               |	CRM_СостоянияВоронкиПродаж.Офис КАК Офис,
		               |	CRM_СостоянияВоронкиПродаж.ТипУслуги КАК ТипУслуги,
		               |	CRM_СостоянияВоронкиПродаж.Подразделение КАК Подразделение,
		               |	CRM_СостоянияВоронкиПродаж.Партнер.БизнесРегион КАК БизнесРегион,
		               |	ПартнерыСегмента.Сегмент КАК Сегмент,
		               |	(CRM_СостоянияВоронкиПродаж.Партнер.ДатаРегистрации > &НачалоПериода
		               |			ИЛИ CRM_СостоянияВоронкиПродаж.Партнер ССЫЛКА Справочник.CRM_ПотенциальныеКлиенты) КАК НовыйКлиент,
		               |	СрезПервичногоИнтереса.ИсточникПривлечения КАК ИсточникПривлечения,
		               |	СрезПервичногоИнтереса.ЗначениеИсточникаПривлечения КАК ЗначениеИсточникаПривлечения}
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CRM_СостоянияВоронкиПродаж.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	CRM_Интерес.Ответственный КАК Пользователь,
	|	CRM_Интерес.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА CRM_Интерес.СостояниеИнтереса = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересЗакрыт)
	|			ТОГДА 1
	|		КОГДА CRM_Интерес.СостояниеИнтереса = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ИнтересПотерян)
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК АктивнаяУспешноНеУдачно,
	|	1 КАК Количество,
	|	CRM_Интерес.ОжидаемаяВыручка КАК Сумма,
	|	CRM_Интерес.Офис КАК Офис,
	|	CRM_Интерес.ТипУслуги КАК ТипУслуги,
	|	ЭтапыТочекМаршрута.Этап,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект,
	|	CRM_Интерес.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА CRM_Интерес.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА CRM_Интерес.ПотенциальныйКлиент
	|		ИНАЧЕ CRM_Интерес.Партнер
	|	КОНЕЦ КАК Клиент,
	|	ВЫБОР
	|		КОГДА CRM_Интерес.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.БизнесРегионы.ПустаяСсылка)
	|		ИНАЧЕ CRM_Интерес.Партнер.БизнесРегион
	|	КОНЕЦ КАК БизнесРегион,
	|	CRM_Интерес.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВсеИнтересы
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеИнтересы.Этап,
	|	ВсеИнтересы.Пользователь,
	|	ВсеИнтересы.Подразделение,
	|	ВсеИнтересы.Документ,
	|	ВсеИнтересы.ТипУслуги,
	|	ВсеИнтересы.Клиент,
	|	ВсеИнтересы.БизнесРегион,
	|	ВсеИнтересы.Проект,
	|	ВсеИнтересы.Количество,
	|	ВсеИнтересы.Сумма,
	|	ВсеИнтересы.Дата
	|ИЗ
	|	ВсеИнтересы КАК ВсеИнтересы
	|ГДЕ
	|	ВсеИнтересы.Этап = &Этап";
		
		
	Возврат ТекстЗапроса;
	
КонецФункции
