#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	
// Процедура создает элементы справочника по умолчанию.
//
// Параметры:
//	Нет.
//
Процедура СоздатьЭлементыСправочникаПоУмолчанию() Экспорт
	
	ОсновнойОфис = Справочники.CRM_ОфисыКомпании.НайтиПоНаименованию(НСтр("ru='Основной офис'"));
	
	Если НЕ ЗначениеЗаполнено(ОсновнойОфис) Тогда
		НовыйОфис = Справочники.CRM_ОфисыКомпании.СоздатьЭлемент();
		НовыйОфис.Наименование	= НСтр("ru='Основной офис'");
		НовыйОфис.CRM_ВремяПоГринвичу_GMT = 3;
		Попытка
			НовыйОфис.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры // СоздатьЭлементыСправочникаПоУмолчанию()

#КонецЕсли
