
&НаСервере
Процедура ПолучитьДоступныеМакетыПечати()
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПользовательскиеМакетыПечати.ИмяМакета,
		|	ПользовательскиеМакетыПечати.CRM_Представление
		|ИЗ
		|	РегистрСведений.ПользовательскиеМакетыПечати КАК ПользовательскиеМакетыПечати
		|ГДЕ
		|	ПользовательскиеМакетыПечати.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", "Справочник.ДоговорыКонтрагентов");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокМаетовПечати.Добавить(Выборка.ИмяМакета, Выборка.CRM_Представление);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ОК".
//
Процедура ОК(Команда)
	Закрыть(Новый Структура("Значение,Представление", Элементы.СписокМаетовПечати.ТекущиеДанные.Значение, Элементы.СписокМаетовПечати.ТекущиеДанные.Представление));
КонецПроцедуры // ОК()

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьДоступныеМакетыПечати();
	Если Параметры.Свойство("ИмяМакета") И НЕ ПустаяСтрока(Параметры.ИмяМакета) Тогда
		ИмяМакета		= Параметры.ИмяМакета;
		ТекущийМакет	= СписокМаетовПечати.НайтиПоЗначению(ИмяМакета);
		Если НЕ (ТекущийМакет = Неопределено) Тогда
			Элементы.СписокМаетовПечати.ТекущаяСтрока = СписокМаетовПечати.Индекс(ТекущийМакет);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура СписокМаетовПечатиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Новый Структура("Значение,Представление", Элемент.ТекущиеДанные.Значение, Элемент.ТекущиеДанные.Представление));
КонецПроцедуры
