#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// Процедура выполняет заполнение реквизитов предопределенных элементов.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьПредопределенныеКатегорииРешений() Экспорт
	
	СправочникОбъект = Справочники.CRM_КатегорииРешений.ТекущиеПроблемы.ПолучитьОбъект();
	СправочникОбъект.ЦветИндекс			= 15;
	СправочникОбъект.ЦветПредставление 	= НСтр("ru = 'Темно-красный'");
    СправочникОбъект.ЦветКрасный  		= 214;	
	СправочникОбъект.ЦветЗеленый  		= 36; 
	СправочникОбъект.ЦветСиний  		= 48;
	СправочникОбъект.Записать();
	
	СправочникОбъект = Справочники.CRM_КатегорииРешений.ДополнительнаяИнформация.ПолучитьОбъект();
	СправочникОбъект.ЦветИндекс			= 22;
	СправочникОбъект.ЦветПредставление 	= НСтр("ru = 'Темно-синий'");
    СправочникОбъект.ЦветКрасный  		= 52;	
	СправочникОбъект.ЦветЗеленый  		= 103; 
	СправочникОбъект.ЦветСиний  		= 184;
	СправочникОбъект.Записать();
	
	СправочникОбъект = Справочники.CRM_КатегорииРешений.РекомендуемаяИнформация.ПолучитьОбъект();
	СправочникОбъект.ЦветИндекс			= 19;
	СправочникОбъект.ЦветПредставление 	= НСтр("ru = 'Темно-зеленый'");
    СправочникОбъект.ЦветКрасный  		= 68;	
	СправочникОбъект.ЦветЗеленый  		= 166; 
	СправочникОбъект.ЦветСиний  		= 57;
	СправочникОбъект.Записать();
	
КонецПроцедуры	// ЗаполнитьПредопределенныеКатегорииРешений()

#КонецЕсли