#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ОбъектКопирования.ЭтоГруппа Тогда
		Ответственный = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
		Описание = "";
		ОписаниеHTML = "";
		Затраты.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьОбъект()
	
	Если Не ЭтоГруппа Тогда
		Ответственный = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьОбъект();
	
КонецПроцедуры


#КонецЕсли