
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтрПараметры = Новый Структура;
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = НачалоКвартала(ДобавитьМесяц(ТекущаяДата(),-9));
	Период.ДатаОкончания = КонецКвартала(ТекущаяДата());
    СтрПараметры.Вставить("Период", Период);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Клиент",ПараметрКоманды);
    
    ПользовательскиеНастройки = УстановитьПользовательскиеНастройкиОтчета("вогИсторияПересмотраКатегорииПоКлиенту",СтрПараметры);
    
    ПараметрыФормы = Новый Структура("Отбор, ПользовательскиеНастройки, СформироватьПриОткрытии",Отбор,ПользовательскиеНастройки, Истина);
    
    ОткрытьФорму("Отчет.вогИсторияПересмотраКатегорииПоКлиенту.Форма.ФормаОтчета", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры


&НаСервере
Функция УстановитьПользовательскиеНастройкиОтчета(ТипОтчета,СтруктураПараметров)
    СтруктураНастроек = Новый Структура;
    ОтчетОбъект = Отчеты[ТипОтчета].Создать();
    
    ПользовательскиеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки;
    Для Каждого ЭлПараметр  Из СтруктураПараметров Цикл
        Для Каждого ПараметрСКД Из ПользовательскиеНастройки.Элементы Цикл
            Если ТипЗнч(ПараметрСКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда  
                Если строка(ПараметрСКД.Параметр) = ЭлПараметр.Ключ Тогда 
                    ПараметрСКД.Значение = ЭлПараметр.Значение;
                    ПараметрСКД.Использование = Истина;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;    
    КонецЦикла;
        
    Возврат ПользовательскиеНастройки;
КонецФункции