&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.ТаблицаBSU.ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(Элементы.ТаблицаBSU.ТекущиеДанные.Наименование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого BSU Из Параметры.СписокBSU Цикл
		НоваяСтрока = ТаблицаНоменклатурныхПозиций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,BSU);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогНоменклатурныеПозиции.Ссылка КАК Наименование,
		|	"""" КАК УИД
		|ИЗ
		|	Справочник.вогНоменклатурныеПозиции КАК вогНоменклатурныеПозиции
		|ГДЕ
		|	НЕ вогНоменклатурныеПозиции.ПометкаУдаления
		|	И вогНоменклатурныеПозиции.НаправлениеДеятельности = &НаправлениеДеятельности";
	
	Запрос.УстановитьПараметр("НаправлениеДеятельности", Параметры.НаправлениеДеятельности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаНоменклатурныхПозиций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Элементы.ТаблицаBSU.ОтборСтрок = Новый ФиксированнаяСтруктура("Наименование",Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ТаблицаBSU.ОтборСтрок = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаBSUВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(Элемент.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры
