
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Классификатор = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("b3d84c6b-7581-11ea-87ff-005056bc3fe8"));
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Классификатор", Классификатор);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	// Создание внешнего источника данных
	ПараметрФиксацияСлева = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ФиксацияСлева");
	СтандартнаяОбработка = Ложь; // отключаем стандартный вывод отчета - будем выводить программно 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	// Инициализируем макет компоновки используя схему компоновки данных 
	// и созданные ранее настройки и данные расшифровки
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//+++ Терпогосян Д.Б. [20.08.2021 11:31:26] № DEV-857
	Попытка
		НачалоОб = 0; КонецОб = 0; 
		Для сч =1  По 15 Цикл
			ТекОбласть =  "R" + Сч + "C1:R" + Сч + "C2"; 
			лОбласть = ДокументРезультат.Область(ТекОбласть); 
			
			Если Найти(лОбласть.Текст, "Кат. ТРТ")> 0  и НачалоОб = 0 Тогда
				НачалоОб = сч;
			КонецЕсли; 
			Если Найти(лОбласть.Текст, "Кат. ТРТ")> 0  Тогда
				КонецОб = сч;
			КонецЕсли; 
			
		КонецЦикла; 
		ТекОбласть = "R1:R" + (КонецОб + 5); 
		лОбласть = ДокументРезультат.Область(ТекОбласть); 
		лОбласть.Разгруппировать(); 
		
		ТекОбласть =  "R" + НачалоОб + "C1:R" + КонецОб + "C2"; 
		лОбласть = ДокументРезультат.Область(ТекОбласть); 
		лОбласть.Объединить(); 
		лОбласть.Текст = "Категория ТРТ"; 
		
		ТекОбласть = "R" + (КонецОб + 4); 
		лОбласть = ДокументРезультат.Область(ТекОбласть); 
		ДокументРезультат.УдалитьОбласть(лОбласть,  ТипСмещенияТабличногоДокумента.ПоВертикали); 
		ТекОбласть = "R" + (КонецОб + 4); 
		лОбласть = ДокументРезультат.Область(ТекОбласть); 
		ДокументРезультат.УдалитьОбласть(лОбласть,  ТипСмещенияТабличногоДокумента.ПоВертикали); 
		ТекОбласть = "R1"; 
		лОбласть = ДокументРезультат.Область(ТекОбласть); 
		ДокументРезультат.УдалитьОбласть(лОбласть,  ТипСмещенияТабличногоДокумента.ПоВертикали); 
		
		ДокументРезультат.ФиксацияСверху = КонецОб + 4; 
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Изменена структура отчета! Дополнительное форматирование потеряно!";
		Сообщение.Сообщить(); 
	КонецПопытки; 
	//--- Терпогосян Д.Б. [20.08.2021 11:31:26] № DEV-857 
КонецПроцедуры
	
	
