
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		// Заполнение шапки
		ДоговорКонтрагента = ДанныеЗаполнения.Ссылка;
		Если ДанныеЗаполнения.вогФормаДоговора = Перечисления.вогТипыФормДоговоров.ФормаКлиента Тогда
			Возврат;			
		КонецЕсли; 
		
		// Заполнение ТЧ
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникПунктыДоговоровКонтрагентов.Ссылка,
			|	СправочникПунктыДоговоровКонтрагентов.Содержание
			|ИЗ
			|	Справочник.вогПунктыДоговоровКонтрагентов КАК СправочникПунктыДоговоровКонтрагентов
			|ГДЕ
			|	СправочникПунктыДоговоровКонтрагентов.Владелец = &ТипДоговора";
		
		Запрос.УстановитьПараметр("ТипДоговора", ДоговорКонтрагента.вогТипДоговора);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаПункты = Пункты.Добавить();
			СтрокаПункты.ИДВарианта 	 = 1;
			СтрокаПункты.ПунктДоговора   = Выборка.Ссылка;
			СтрокаПункты.ИсходныйВариант = Выборка.Содержание;
			СтрокаПункты.НовыйВариант	 = Выборка.Содержание;
			
		КонецЦикла; 	
		
	КонецЕсли;
	
	ИнициализироватьДокумент();

КонецПроцедуры

#КонецОбласти

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ЗаполнятьВсеРеквизиты = Истина)
	
	Автор = Пользователи.ТекущийПользователь();	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

