////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции формы.
//

&НаКлиенте
Процедура ПоказыватьЗавершённыеПроекты(Команда)
	
	ПоказыватьЗавершённыеПроекты = Не ПоказыватьЗавершённыеПроекты;
	
	Элементы.ФормаПоказыватьЗавершённыеПроекты.Пометка = ПоказыватьЗавершённыеПроекты;
	
	CRM_ХранилищеНастроек.Сохранить("ПоказыватьЗавершённыеПроекты", "", ПоказыватьЗавершённыеПроекты);
	
	Если ПоказыватьЗавершённыеПроекты Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Завершен");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"Завершен",
			Ложь);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьЗавершённыеПроекты = (CRM_ХранилищеНастроек.Загрузить("ПоказыватьЗавершённыеПроекты") = Истина);
	
	Элементы.ФормаПоказыватьЗавершённыеПроекты.Пометка = ПоказыватьЗавершённыеПроекты;
	
	Если ПоказыватьЗавершённыеПроекты Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Завершен");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"Завершен",
			Ложь);
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"CRM_ЭтоПроект",
		?(ПроектПроцесс=0,Ложь,Истина),ВидСравненияКомпоновкиДанных.Равно,,Истина);
		
	Если ПроектПроцесс = 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"bpmСостояниеПроцесса",Перечисления.bpmСостояниеПроцесса.Действует,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,"bpmСостояниеПроцесса");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПроцессПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"CRM_ЭтоПроект",
		?(ПроектПроцесс=0,Ложь,Истина),ВидСравненияКомпоновкиДанных.Равно,,Истина);
		
	Если ПроектПроцесс = 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"bpmСостояниеПроцесса",ПредопределенноеЗначение("Перечисление.bpmСостояниеПроцесса.Действует"),ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,"bpmСостояниеПроцесса");
	КонецЕсли;
		
КонецПроцедуры
