
// Процедура помещает команды группы только во все действия.
//
Процедура ПоместитьКомандыГруппыТолькоВоВсеДействия(Форма) Экспорт

	Попытка
	
		Если Не Найти(Форма.ИмяФормы,"ФормаСписка") Тогда
			Форма.Элементы.ФормаСправочникCRM_ШаблоныОбъектовЗагрузитьИзШаблона.ТолькоВоВсехДействиях = Истина;
			Форма.Элементы.ФормаСправочникCRM_ШаблоныОбъектовВыгрузитьВШаблон.ТолькоВоВсехДействиях = Истина;
			Форма.Элементы.ФормаСправочникCRM_ШаблоныОбъектовЗагрузитьИзШаблона.Видимость = Ложь;
		Иначе
			Форма.Элементы.ФормаСправочникCRM_ШаблоныОбъектовВыгрузитьВШаблон.ТолькоВоВсехДействиях = Истина;
			Форма.Элементы.ФормаСправочникCRM_ШаблоныОбъектовЗагрузитьИзШаблона.ТолькоВоВсехДействиях = Истина;
			Форма.Элементы.ФормаСправочникCRM_ШаблоныОбъектовЗагрузитьИзШаблона.Заголовок = НСтр("ru = 'Создать из шаблона'");
			
		КонецЕсли;
	Исключение
	КонецПопытки

КонецПроцедуры

// Функция загружает из шаблона на клиенте.
//
Процедура ЗагрузитьИзШаблонаНаКлиенте(сПараметры) Экспорт

	ТекстВопроса = НСтр("ru='Введенные данные могут быть заменены! Продолжить?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзШаблонаНаКлиентеЗавершение", ЭтотОбъект, сПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

Процедура ЗагрузитьИзШаблонаНаКлиентеЗавершение(Результат, сПараметры) Экспорт

	Если НЕ (Результат = КодВозвратаДиалога.ОК) Тогда
		Возврат;
	КонецЕсли;
		
	СсылкаНаОбъект = сПараметры.Ссылка;
	ВладелецШаблона = ПользователиКлиентСервер.ТекущийПользователь();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",		Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",		Истина);
	ПараметрыФормы.Вставить("Основание", СсылкаНаОбъект);
	
	ОткрытьФорму("Справочник.CRM_ШаблоныОбъектов.ФормаВыбора",ПараметрыФормы,сПараметры.Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры