
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ОписаниеСтатуса = вогОбщегоНазначения.ПолучитьОписаниеСтатусаСогласованияОбъекта(Запись.ОбъектСвязи);
		
		Если ОписаниеСтатуса.Статус = Перечисления.вогСтатусыСогласования.Согласован Тогда
			вогИнтеграцияСУчетнойСистемой.ЗарегистрироватьДанныеКОтправкеВУчетнуюСистему(Запись.ОбъектСвязи,,, Ложь);
		КонецЕсли;
		//START Кайдашов 23/12/19 CRM-74
		МЗ = РегистрыСведений.вогРолиКонтактныхЛиц.СоздатьМенеджерЗаписи();
		МЗ.CRM_РольКонтактногоЛица = Запись.CRM_РольКонтактногоЛица;
		МЗ.ОбъектСвязи = Запись.ОбъектСвязи;
		МЗ.КонтактноеЛицо = Запись.КонтактноеЛицо;
		МЗ.Записать(Истина);
		Если Запись.Собственник тогда
			МЗ = РегистрыСведений.вогРолиКонтактныхЛиц.СоздатьМенеджерЗаписи();
			МЗ.CRM_РольКонтактногоЛица = Справочники.РолиКонтактныхЛицПартнеров.Собственник;
			МЗ.ОбъектСвязи = Запись.ОбъектСвязи;
			МЗ.КонтактноеЛицо = Запись.КонтактноеЛицо;
			МЗ.Записать(Истина);
		КонецЕсли;
		
		//END Кайдашов
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли