#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имена блокруемых реквизитов для механизма блокирования реквизитов БСП
//	Параметры:
//  	ИмяОбъекта - Строка - Имя объекта метаданных
//	Возвращаемое значение:
//		Массив - имена блокируемых реквизитов
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта(ИмяОбъекта) Экспорт

	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вогЗапретРедактированияРеквизитов.ИмяРеквизита КАК ИмяРеквизита,
		|	вогЗапретРедактированияРеквизитов.Реквизит КАК Реквизит
		|ИЗ
		|	РегистрСведений.вогЗапретРедактированияРеквизитов КАК вогЗапретРедактированияРеквизитов
		|ГДЕ
		|	вогЗапретРедактированияРеквизитов.ИмяОбъекта = &ИмяОбъекта";
	
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ИмяРеквизита) Тогда
			Результат.Добавить(Выборка.ИмяРеквизита);
		Иначе
			Результат.Добавить(Выборка.Реквизит);
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли