Процедура УстановитьФинансирование(Сотрудник, Командировка, Финансирование) Экспорт
	
	НаборЗаписей = РегистрыСведений.вогФинансированиеКомандировок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Командировка.Установить(Командировка);
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	Запись = НаборЗаписей.Добавить();
	Запись.Командировка = Командировка;
	Запись.Сотрудник = Сотрудник;
	Запись.Финансирование = Финансирование;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьФинансирование(Сотрудник, Командировка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогФинансированиеКомандировок.Финансирование КАК Финансирование
		|ИЗ
		|	РегистрСведений.вогФинансированиеКомандировок КАК вогФинансированиеКомандировок
		|ГДЕ
		|	вогФинансированиеКомандировок.Командировка = &Командировка
		|	И вогФинансированиеКомандировок.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Командировка", Командировка);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.Финансирование;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции