
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокЗадач") Тогда
		Для Каждого Задача Из Параметры.СписокЗадач Цикл
			НоваяСтрока = ТаблицаСогласовантов.Добавить();
			НоваяСтрока.Сотрудник = Задача.БизнесПроцесс.Автор;
			НоваяСтрока.ДатаНачала = Задача.БизнесПроцесс.Предмет.ВремяНачала;
			НоваяСтрока.ДатаОкончания = Задача.БизнесПроцесс.Предмет.ВремяОкончания;
			НоваяСтрока.Задача = Задача;
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("ВариантВыполнения") Тогда
		ВариантВыполнения = Параметры.ВариантВыполнения;
		Элементы.ТаблицаСогласовантовВыбрать.Заголовок = ВариантВыполнения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для Каждого Строка Из ТаблицаСогласовантов Цикл
		Строка.Флаг = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Строка Из ТаблицаСогласовантов Цикл
		Строка.Флаг = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Новый Структура("ОтменаСогласования",Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("СогласоватьЗадачуЗавершение", ЭтотОбъект);
	ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаЗадачиРезультатВыполнения", 
			ПараметрыФормы, 
			ЭтотОбъект,
			,
			,
			, 
			ОписаниеОповещения,  
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // --- VOG Кулаков П.Л.

// +++ VOG Кулаков П.Л. 10.11.2020 CRM-999
&НаКлиенте
Процедура СогласоватьЗадачуЗавершение(Результат, ДополнительныеПараметры) Экспорт 

	Если Результат.Свойство("Отказ") И Результат.Отказ Тогда
		Возврат;
	КонецЕсли;

	РезультатВыполнения = СогласоватьНаСервере(Результат.РезультатВыполнения);
	СтруктураВозврата = Новый Структура("Успешно,ОписаниеОшибки",РезультатВыполнения,?(РезультатВыполнения,"","Не удалось выполнить задау"));
	Закрыть(Новый Структура("РезультатСогласования",СтруктураВозврата));
	
КонецПроцедуры // --- VOG Кулаков П.Л.
	
&НаСервере
Функция СогласоватьНаСервере(РезультатВыполнения)
	
	ЗадачаВыполнена = Ложь;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Для Каждого Строка Из ТаблицаСогласовантов Цикл
		
		Если Не Строка.Флаг Тогда
			Продолжить;
		КонецЕсли;
		
		ВариантыВыполнения = CRM_БизнесПроцессыСервер.ПолучитьВариантыВыполненияЗадачи(Строка.Задача);
		Если ВариантыВыполнения.СписокВариантов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВариантСогласования = Неопределено;
		
		Для Каждого Вариант Из ВариантыВыполнения.СписокВариантов Цикл
			Если Вариант.Представление = ВариантВыполнения Тогда
				ВариантСогласования = Вариант.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ВариантСогласования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадачаПринятаКИсполнению = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Строка.Задача, "ПринятаКИсполнению");
			
		Если НЕ ЗадачаПринятаКИсполнению Тогда
			CRM_БизнесПроцессыСервер.ПринятьЗадачуКИсполнениюИзФормыДокумента(Строка.Задача,ТекущийПользователь);
		КонецЕсли;
		
		CRM_БизнесПроцессыИЗадачиВызовСервера.ВыполнитьЗадачу(Строка.Задача,ВариантСогласования);
		ПараметрыВыполнения = Новый Структура("ВариантВыполнения,ВариантВыполненияСтрокой",ВариантСогласования,ВариантВыполнения);
		РезультатВыполнения = ВариантВыполнения + ?(РезультатВыполнения = "","",Символы.ПС + РезультатВыполнения);
		Результат = Новый Структура("РезультатВыполнения",РезультатВыполнения);
		CRM_БизнесПроцессыСервер.ЗафиксироватьРезультатВыполненияЗадачи(Строка.Задача,Результат,ПараметрыВыполнения);
		ЗадачаВыполнена = Истина;
		Сообщить("Выполнена задача: " + Строка.Задача);
	КонецЦикла;
	
	Возврат ЗадачаВыполнена;
	
КонецФункции
