
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;	
	
	Если Параметры.Свойство("ТипыРеспондента") Тогда
		Если ТипЗнч(Параметры.ТипыРеспондента.ИмяТаблиц) = Тип("Строка") Тогда
			СписокИменТаблиц = Новый СписокЗначений;
			СписокИменТаблиц.Добавить(Параметры.ТипыРеспондента.ИмяТаблиц);
			
		Иначе
			СписокИменТаблиц = Параметры.ТипыРеспондента.ИмяТаблиц;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"Ссылка.ТипыРеспондента.ТипРеспондента", 
			СписокИменТаблиц,
			ВидСравненияКомпоновкиДанных.ВСписке
		);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
