
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Форма3В1") Тогда
		Форма3В1 = Параметры.Форма3В1;
		Элементы.КомандаЗавершить.Заголовок = НСтр("ru = 'Подтвердить'");
	КонецЕсли;
	
	ЗаполнитьСписокРежимОтображенияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ГруппаСтраницыПриСменеСтраницы(Неопределено,Элементы.СтраницаВидТорговойТочки);
	УстановитьВидимостьЭлементовФормы();
	
	МассивКнопок = Новый Массив;
	МассивКнопок.Добавить("КомандаТорговаяТочка");
	// ++ VOG Солодов В.В. 23.08.2019 task 577
	МассивКнопок.Добавить("КомандаТРТД");
	// -- VOG Солодов В.В. 23.08.2019
	МассивКнопок.Добавить("КомандаРазовыйПокупатель");
	МассивКнопок.Добавить("КомандаИнтернетМагазин");
	МассивКнопок.Добавить("КомандаДистрибьютор");
	МассивКнопок.Добавить("КомандаДизайнер");
	МассивКнопок.Добавить("КомандаСтроитель");
	
	Для каждого ТекЭлемент Из МассивКнопок Цикл
		Элементы[ТекЭлемент].Пометка = Ложь;
	КонецЦикла;

	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"КомандаДалее","Доступность",Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"КомандаЗавершить","Видимость",Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТорговаяТочкаПриИзменении(Элемент)
	
	ТорговаяТочкаКлиент = Ложь; ТорговаяТочкаКлиентЮрлицо = Ложь;
	РежимОтображенияФормы.НайтиПоЗначению("ТорговаяТочка").Пометка 				= ЭтаФорма[Элемент.Имя];
	РежимОтображенияФормы.НайтиПоЗначению("ТорговаяТочкаКлиентЮрЛицо").Пометка 	= Ложь;
	РежимОтображенияФормы.НайтиПоЗначению("ТорговаяТочкаКлиент").Пометка 		= Ложь;
	ДоступностьКнопкиПодтвердить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговаяТочкаКлиентПриИзменении(Элемент)
	
	ТорговаяТочкаРежим = Ложь; ТорговаяТочкаКлиентЮрлицо = Ложь;
	РежимОтображенияФормы.НайтиПоЗначению("ТорговаяТочкаКлиент").Пометка 		= ЭтаФорма[Элемент.Имя];
	РежимОтображенияФормы.НайтиПоЗначению("ТорговаяТочкаКлиентЮрЛицо").Пометка 	= Ложь;
	РежимОтображенияФормы.НайтиПоЗначению("ТорговаяТочка").Пометка 				= Ложь;
	ДоступностьКнопкиПодтвердить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговаяТочкаКлиентЮрлицоПриИзменении(Элемент)
	
	ТорговаяТочкаКлиент = Ложь; ТорговаяТочкаРежим = Ложь;
	РежимОтображенияФормы.НайтиПоЗначению("ТорговаяТочкаКлиентЮрЛицо").Пометка 	= ЭтаФорма[Элемент.Имя];
	РежимОтображенияФормы.НайтиПоЗначению("ТорговаяТочкаКлиент").Пометка 		= Ложь;
	РежимОтображенияФормы.НайтиПоЗначению("ТорговаяТочка").Пометка 				= Ложь;
	ДоступностьКнопкиПодтвердить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = Элементы.СтраницаВидТорговойТочки.Имя Тогда
		Элементы.КомандаНазад.Видимость 					= Ложь;
		Элементы.КомандаЗавершить.Видимость 				= Ложь;
		//Элементы.КомандаДалее.Видимость 					= Истина;
		Элементы.КомандаДалее.КнопкаПоУмолчанию				= Истина;
	ИначеЕсли ТекущаяСтраница.Имя = Элементы.СтраницаРежимСоздания.Имя Тогда
		Элементы.КомандаНазад.Видимость 					= Истина;
		//Элементы.КомандаДалее.Видимость 					= Ложь;
		Элементы.КомандаЗавершить.Видимость 				= Истина;
		Элементы.КомандаЗавершить.КнопкаПоУмолчанию			= Истина;
		Если вогОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ВидТорговойТочки,"ИспользоватьНастройкиДляФормы3в1",Истина) Тогда
			Если НЕ вогОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ВидТорговойТочки,"ИспользоватьГеокодирование",Истина) Тогда
				Элементы.КомандаЗавершить.Заголовок = НСтр("ru = 'Подтвердить'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидТочкиПриИзменении(ИмяРеквизита)
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Дизайнер");
	МассивРеквизитов.Добавить("Дистрибьютор");
	МассивРеквизитов.Добавить("ИнтернетМагазин");
	МассивРеквизитов.Добавить("РазовыйПокупатель");
	МассивРеквизитов.Добавить("Строитель");
	МассивРеквизитов.Добавить("ТорговаяТочка");
	// ++ VOG Солодов В.В. 23.08.2019 task 577
	МассивРеквизитов.Добавить("ТРТД");
	// -- VOG Солодов В.В. 23.08.2019
	
	Для каждого ТекРеквизит Из МассивРеквизитов Цикл
		Если ТекРеквизит <> ИмяРеквизита Тогда
			ЭтаФорма[ТекРеквизит] = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ВидТорговойТочки = ПредопределенноеЗначение("Справочник.вогВидыТорговыхТочек."+ИмяРеквизита+"");
	//ЗаполнитьРежимСозданияОбъектов();
	//ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	Если Элементы.СтраницыОбъекта.ТекущаяСтраница.Имя 		= Элементы.СтраницаВидТорговойТочки.Имя Тогда
		Элементы.СтраницыОбъекта.ТекущаяСтраница 			= Элементы.СтраницаРежимСоздания;
	КонецЕсли;
	
	ГруппаСтраницыПриСменеСтраницы(Неопределено,Элементы.СтраницыОбъекта.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	
	Если Элементы.СтраницыОбъекта.ТекущаяСтраница.Имя 		= Элементы.СтраницаРежимСоздания.Имя Тогда
		Элементы.СтраницыОбъекта.ТекущаяСтраница 			= Элементы.СтраницаВидТорговойТочки;
	КонецЕсли;
	
	ГруппаСтраницыПриСменеСтраницы(Неопределено,Элементы.СтраницыОбъекта.ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершить(Команда)
	ОбработатьВыборПользователя();
КонецПроцедуры

&НаКлиенте
Процедура КомандаВидТорговойТочки(Команда)
	
	Элементы[Команда.Имя].Пометка = НЕ Элементы[Команда.Имя].Пометка;
	
	МассивКнопок = Новый Массив;
	МассивКнопок.Добавить("КомандаТорговаяТочка");
	// ++ VOG Солодов В.В. 23.08.2019 task 577
	МассивКнопок.Добавить("КомандаТРТД");
	// -- VOG Солодов В.В. 23.08.2019
	МассивКнопок.Добавить("КомандаРазовыйПокупатель");
	МассивКнопок.Добавить("КомандаИнтернетМагазин");
	МассивКнопок.Добавить("КомандаДистрибьютор");
	МассивКнопок.Добавить("КомандаДизайнер");
	МассивКнопок.Добавить("КомандаСтроитель");
	
	МассивКнопок.Удалить(МассивКнопок.Найти(Команда.Имя));
	
	Для каждого ТекЭлемент Из МассивКнопок Цикл
		Элементы[ТекЭлемент].Пометка = Ложь;
	КонецЦикла;
	
	ИмяЭлемента 			= СтрЗаменить(Команда.Имя,"Команда","");
	ЭтаФорма[ИмяЭлемента] 	= Элементы[Команда.Имя].Пометка;
	ВидТочкиПриИзменении(ИмяЭлемента);
	
	//УстановитьВидимостьЭлементовФормы();
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"КомандаДалее","Доступность",Элементы[Команда.Имя].Пометка);
	
	//КомандаДалее(Неопределено);
	
	ОбработатьВыборПользователя();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокРежимОтображенияФормы()
	
	РежимОтображенияФормы.Добавить("ТорговаяТочка");
	РежимОтображенияФормы.Добавить("ТорговаяТочкаКлиент");
	РежимОтображенияФормы.Добавить("ТорговаяТочкаКлиентЮрЛицо");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПользователя()
	
	ПараметрыФормы = Новый Структура("ПараметрыФормыВвода3в1,ФормаВвода3в1",Новый Структура("РежимОтображенияФормы,ТорговаяТочкаВид",РежимОтображенияФормы,ВидТорговойТочки),Истина);
	
	Если ВладелецФормы <> Неопределено Тогда
		Закрыть(ПараметрыФормы);
	ИначеЕсли НЕ вогОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ВидТорговойТочки,"ИспользоватьГеокодирование",Истина)
		И вогОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ВидТорговойТочки,"ИспользоватьНастройкиДляФормы3в1",Истина) Тогда
		ПараметрыФормы.Вставить("ТорговаяТочкаВид",ВидТорговойТочки);
		ПараметрыФормы.Вставить("РежимОтображенияФормы",РежимОтображенияФормы);
		ОткрытьФорму("Справочник.вогТорговыеТочки.Форма.вогФормаБыстрогоВвода",ПараметрыФормы);
		Закрыть();
	Иначе
		ОткрытьФорму("Обработка.вогГеокодирование.Форма.Форма",ПараметрыФормы);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРежимСозданияОбъектов()

	Если РазовыйПокупатель ИЛИ Дизайнер ИЛИ Дистрибьютор ИЛИ Строитель Тогда
		ТорговаяТочкаРежим			= Ложь;
		ТорговаяТочкаКлиент 		= Ложь;
		ТорговаяТочкаКлиентЮрлицо 	= Истина;
		ТорговаяТочкаКлиентЮрлицоПриИзменении(Элементы.ТорговаяТочкаКлиентЮрлицо);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаРежимСоздания","Доступность",Ложь);
	ИначеЕсли ИнтернетМагазин Тогда
		ТорговаяТочкаРежим			= Истина;
		ТорговаяТочкаКлиент 		= Ложь;
		ТорговаяТочкаКлиентЮрлицо 	= Ложь;
		ТорговаяТочкаКлиентПриИзменении(Элементы.ТорговаяТочкаКлиент);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаРежимСоздания","Доступность",Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияТорговаяТочкаКлиент","Доступность",Ложь);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТорговаяТочкаКлиент","Доступность",Ложь);	
	ИначеЕсли ТорговаяТочка Тогда
		ТорговаяТочкаРежим			= Истина;
		ТорговаяТочкаКлиент 		= Ложь;
		ТорговаяТочкаКлиентЮрлицо 	= Ложь;
		ТорговаяТочкаКлиентПриИзменении(Элементы.ТорговаяТочкаКлиент);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаРежимСоздания","Доступность",Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияТорговаяТочкаКлиентЮрлицо","Доступность",Ложь);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТорговаяТочкаКлиентЮрлицо","Доступность",Ложь);
	Иначе
		ТорговаяТочкаРежим			= Ложь;
		ТорговаяТочкаКлиент 		= Ложь;
		ТорговаяТочкаКлиентЮрлицо 	= Ложь;
		ТорговаяТочкаКлиентПриИзменении(Элементы.ТорговаяТочкаКлиент);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ГруппаРежимСоздания","Доступность",Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияТорговаяТочкаКлиентЮрлицо","Доступность",Истина);
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ТорговаяТочкаКлиентЮрлицо","Доступность",Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоступностьКнопкиПодтвердить()

	ФлагВыбора = Ложь;
	
	Для каждого ТекущийЭлементСписка Из РежимОтображенияФормы Цикл
		Если ТекущийЭлементСписка.Пометка Тогда
			ФлагВыбора = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"КомандаЗавершить","Доступность",ФлагВыбора);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФормы()

	//Элементы.КомандаНазад.Видимость 					= Истина;
	//Элементы.КомандаЗавершить.Видимость 				= Истина;
	//Элементы.КомандаЗавершить.КнопкаПоУмолчанию			= Истина;
	//Элементы.КомандаНазад.Видимость						= Ложь;
	//Если ЗначениеЗаполнено(ВидТорговойТочки) И вогОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ВидТорговойТочки,"ИспользоватьНастройкиДляФормы3в1",Истина) Тогда
	//	Если НЕ вогОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ВидТорговойТочки,"ИспользоватьГеокодирование",Истина) Тогда
	//		Элементы.КомандаЗавершить.Заголовок = НСтр("ru = 'Подтвердить'");
	//	КонецЕсли;
	//КонецЕсли;
		
КонецПроцедуры 

#КонецОбласти