
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Установить отбор по партнеру.
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ПервыйПартнер") Тогда

		СтандартнаяОбработка = Ложь;
		Партнер              = Параметры.Отбор.ПервыйПартнер;
		ОтборПартнеров       = Список.Отбор.Элементы[0];

		ОтборПартнера1 = ОтборПартнеров.Элементы[0];
		ОтборПартнера1.ПравоеЗначение = Партнер;
		ОтборПартнера1.Использование  = Истина;

		ОтборПартнера2 = ОтборПартнеров.Элементы[1];
		ОтборПартнера2.ПравоеЗначение = Партнер;
		ОтборПартнера2.Использование  = Истина;

		ОтборПартнеров.Использование  = Истина;
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	Если НЕ Копирование Тогда
		// Отменить стандартную обработку и параметризовать форму нового.
		Отказ = Истина;
		ОткрытьФорму("РегистрСведений.СвязиМеждуПартнерами.ФормаЗаписи", Новый Структура("Партнер", Партнер),,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
