
&НаКлиенте
Процедура ИмяМакетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМакета", Объект.ИмяМакета);
	ОписаниеОповещения = Новый ОписаниеОповещения("ИмяМакетаНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.вогТипыДоговоровКонтрагентов.Форма.ФормаВыбораМакетаПечати", ПараметрыФормы, Элемент,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ИмяМакетаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ (Результат = Неопределено) Тогда
		Объект.ИмяМакета				= Результат.Значение;
		//Объект.ПредставлениеИмяМакета	= Результат.Представление;
	КонецЕсли;
КонецПроцедуры
 