//////////////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагружаемыйМакет = Параметры.Макет;
	
	Если Не ЗначениеЗаполнено(ЗагружаемыйМакет) Тогда
		ВызватьИсключение НСтр("ru = 'Обработка не предназначена для непосредственного использования.'");
	КонецЕсли;
	
	Если CRM_ОбщегоНазначенияПовтИсп.ИспользуетсяРежимЗакладок() Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.Заголовок) Тогда
			Заголовок = Метаданные.Обработки.CRM_БыстроеОсвоение.Макеты.Найти(ЗагружаемыйМакет).Представление();
		Иначе
			Заголовок = Параметры.Заголовок;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗагружаемыйМакет) Тогда
		ЗагружаемыйМакет = "ОбщиеПринципыРаботыВРешении";
	КонецЕсли;
	
	МакетБыстроеОсвоение = ОбновитьМакетHTML (ЗагружаемыйМакет);
	
КонецПроцедуры

&НаКлиенте
Процедура МакетСЧегоНачатьПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтрокаИмяФормы = ДанныеСобытия.href;
	ПозицияМаркера = Найти(СтрокаИмяФормы,"marker_form://");
	Если ПозицияМаркера > 0 Тогда
		СтрокаИмяФормы = Прав(СтрокаИмяФормы,СтрДлина(СтрокаИмяФормы) - (ПозицияМаркера - 1));
		СтрокаИмяФормы = СтрЗаменить(СтрокаИмяФормы, "marker_form://", "");
		СтрокаИмяФормы = СтрЗаменить(СтрокаИмяФормы, "/", "");
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Макет, Заголовок", СтрокаИмяФормы, "");
		ОткрытьФорму("Обработка.CRM_БыстроеОсвоение.Форма",ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьМакетHTML (ИмяМакета, Заголовок = Неопределено)
	
	Возврат Обработки.CRM_БыстроеОсвоение.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	
КонецФункции
