
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЭтотОбъект.Отбор.Владелец.Значение) <> Тип("СправочникСсылка.вогТорговыеТочки") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	вогМенеджерыОбъектов.Менеджер КАК Менеджер
			|ИЗ
			|	РегистрСведений.вогМенеджерыОбъектов КАК вогМенеджерыОбъектов
			|ГДЕ
			|	вогМенеджерыОбъектов.Владелец = &Владелец
			|	И вогМенеджерыОбъектов.Подразделение = &Подразделение
			|	И вогМенеджерыОбъектов.Роль = &Роль
			|	И вогМенеджерыОбъектов.НаправлениеДеятельности = &НаправлениеДеятельности
			|	И вогМенеджерыОбъектов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|	И вогМенеджерыОбъектов.Менеджер <> &Менеджер";
			
			Запрос.УстановитьПараметр("Владелец", 					Запись.Владелец);
			Запрос.УстановитьПараметр("НаправлениеДеятельности", 	Запись.НаправлениеДеятельности);
			Запрос.УстановитьПараметр("Подразделение", 				Запись.Подразделение);
			Запрос.УстановитьПараметр("Роль", 						Запись.Роль);
			Запрос.УстановитьПараметр("Менеджер", 					Запись.Менеджер);
			
			ВыборкаДанных = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаДанных.Следующий() Тогда
				
				ШаблонСообщения = НСтр("ru = 'У ""%1"" уже есть %2 %3 по направлению ""%4"".'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Запись.Владелец, НРег(Запись.Роль),ВыборкаДанных.Менеджер ,Запись.НаправлениеДеятельности);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

	
#КонецЕсли