#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мАнализАвансовыхСтрок Экспорт; // Переменная хранит анализ авансовых строк.

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		
		Набор = РегистрыСведений.CRM_ЗагруженныеОборотыПоВзаиморасчетам.СоздатьНаборЗаписей();
		
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			
			//// Поищем записи аванса
			Если (НЕ СтрокаНабора.Загружено) И мАнализАвансовыхСтрок И ЗначениеЗаполнено(СтрокаНабора.ИдентификаторКорДокумента)
			И НЕ СтрокаНабора.ИдентификаторКорДокумента = "*" Тогда
			//	
				//Набор.Отбор.Сбросить();
				//Набор.Отбор.ИдентификаторДокумента.Установить(СтрокаНабора.ИдентификаторДокумента);
				// Набор.Отбор.ИдентификаторКорДокумента.Установить("*");
				//Набор.Отбор.Организация.Установить(СтрокаНабора.Организация);
				//Набор.Отбор.Контрагент.Установить(СтрокаНабора.Контрагент);
				//Набор.Отбор.ДоговорКонтрагента.Установить(СтрокаНабора.ДоговорКонтрагента);
				//Набор.Отбор.ВидыДвиженийПриходРасход.Установить(СтрокаНабора.ВидыДвиженийПриходРасход);
				//Набор.Отбор.Загружено.Установить(Ложь);
				//Набор.Прочитать();
			//	
			//	Если Набор.Количество() = 1 Тогда
			//		СтрокаНабора.СделкаСКлиентом = Набор[0].СделкаСКлиентом;
			//		Если Набор[0].СуммаДокумента = СтрокаНабора.СуммаДокумента Тогда
			//			Набор.Очистить();
			//		ИначеЕсли Набор[0].СуммаДокумента > СтрокаНабора.СуммаДокумента Тогда
			//			Набор[0].Загружено = Ложь;
			//			Набор[0].СуммаДокумента = Набор[0].СуммаДокумента - СтрокаНабора.СуммаДокумента;
			//		КонецЕсли;
			//		Набор.мАнализАвансовыхСтрок = Ложь;
			//		Набор.Записать();
			//	КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

мАнализАвансовыхСтрок = Ложь;
#КонецЕсли