
&НаКлиенте
Процедура ПериодПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца","Квартал",Ложь);
	ОткрытьФорму("ОбщаяФорма.вогВыборПериода"
			,ПараметрыФормы
			,ЭтаФорма
			,
			,
			,
			, Новый ОписаниеОповещения("ПериодПланированияНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Запись.ПериодПланирования = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияПриИзменении(Элемент)
	
	Запись.ПериодПланирования = НачалоКвартала(Запись.ПериодПланирования);
	
КонецПроцедуры
