
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Структура = Новый Структура;
	Структура.Вставить(НСтр("ru = 'День'"),			Перечисления.Периодичность.День);
	Структура.Вставить(НСтр("ru = 'Неделя'"),		Перечисления.Периодичность.Неделя);
	Структура.Вставить(НСтр("ru = 'Декада'"),		Перечисления.Периодичность.Декада);
	Структура.Вставить(НСтр("ru = 'Месяц'"),		Перечисления.Периодичность.Месяц);
	Структура.Вставить(НСтр("ru = 'Квартал'"),		Перечисления.Периодичность.Квартал);
	Структура.Вставить(НСтр("ru = 'Полугодие'"),	Перечисления.Периодичность.Полугодие);
	Структура.Вставить(НСтр("ru = 'Год'"),			Перечисления.Периодичность.Год);
	
	СтруктураПериодичность = Структура;
	
	Если Объект.Предопределенный Тогда
		
		Элементы.Периодичность.Доступность = Ложь;
		Элементы.ДатаНачала.Доступность = Ложь;
		Элементы.ДатаНачала.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ДатаОкончания.Доступность = Ложь;
		Элементы.ДатаОкончания.АвтоОтметкаНезаполненного = Ложь;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры // ПриСозданииНаСервере()

#Область ПроцедурыОбработчикиСобытийРеквизитовФормы

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ДатаНачала.
//
Процедура ДатаНачалаПриИзменении(Элемент)
			
	Если ЗначениеЗаполнено(Объект.Периодичность)
		И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		
		Если Объект.Периодичность = СтруктураПериодичность.Неделя Тогда	
			
			Объект.ДатаНачала = НачалоНедели(Объект.ДатаНачала);
						
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Месяц Тогда	
			
			Объект.ДатаНачала = НачалоМесяца(Объект.ДатаНачала);
						
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Квартал Тогда	
			
			Объект.ДатаНачала = НачалоКвартала(Объект.ДатаНачала);
						
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Полугодие Тогда	
			
			МесяцДатыНачала = Месяц(Объект.ДатаНачала);
			
			Объект.ДатаНачала = НачалоГода(Объект.ДатаНачала);

			Если МесяцДатыНачала > 6 Тогда
				
				Объект.ДатаНачала = ДобавитьМесяц(Объект.ДатаНачала, 6);
				
			КонецЕсли;	
						 
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Год Тогда
			
			Объект.ДатаНачала = НачалоГода(Объект.ДатаНачала);
						
		КонецЕсли;	
			
	КонецЕсли;	
	
	Если Объект.ДатаНачала > Объект.ДатаОкончания 
		И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Значение поля ""Дата начала"" больше значения поля ""Дата окончания""'");
		Сообщение.Поле = "Объект.ДатаНачала";
		Сообщение.Сообщить();
				
	КонецЕсли;	
	
КонецПроцедуры // ДатаНачалаПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ДатаОкончания.
//
Процедура ДатаОкончанияПриИзменении(Элемент)
			
	Если ЗначениеЗаполнено(Объект.Периодичность)
		И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Если Объект.Периодичность = СтруктураПериодичность.Неделя Тогда	
			
			Объект.ДатаОкончания = КонецНедели(Объект.ДатаОкончания);
			
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Месяц Тогда	
			
			Объект.ДатаОкончания = КонецМесяца(Объект.ДатаОкончания);
			
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Квартал Тогда	
			
			Объект.ДатаОкончания = КонецКвартала(Объект.ДатаОкончания);
			
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Полугодие Тогда	
			
			МесяцДатыОкончания = Месяц(Объект.ДатаОкончания);
			
			Объект.ДатаОкончания = КонецГода(Объект.ДатаОкончания);

			Если МесяцДатыОкончания < 7 Тогда
				
				Объект.ДатаОкончания = ДобавитьМесяц(Объект.ДатаОкончания, - 6);
				
			КонецЕсли;	
			 
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Год Тогда
			
			Объект.ДатаОкончания = КонецГода(Объект.ДатаОкончания);
			
		КонецЕсли;	
			
	КонецЕсли;
	
	Если Объект.ДатаНачала > Объект.ДатаОкончания 
		И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Значение поля ""Дата окончания"" меньше значения поля ""Дата начала""'");
		Сообщение.Поле = "Объект.ДатаОкончания";
		Сообщение.Сообщить();
						
	КонецЕсли;
	
КонецПроцедуры // ДатаОкончанияПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля Периодичность.
//
Процедура ПериодичностьПриИзменении(Элемент)
		
	Если ЗначениеЗаполнено(Объект.ДатаНачала)
		И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Если Объект.Периодичность = СтруктураПериодичность.Неделя Тогда
			
			Объект.ДатаНачала = НачалоНедели(Объект.ДатаНачала);
			Объект.ДатаОкончания = КонецНедели(Объект.ДатаОкончания);
			
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Декада Тогда
			Объект.ДатаОкончания = КонецДня((Объект.ДатаНачала + (24 * 60 * 60 * 10)));
			
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Месяц Тогда
			
			Объект.ДатаНачала = НачалоМесяца(Объект.ДатаНачала);
			Объект.ДатаОкончания = КонецМесяца(Объект.ДатаОкончания);
			
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Квартал Тогда
			
			Объект.ДатаНачала = НачалоКвартала(Объект.ДатаНачала);
			Объект.ДатаОкончания = КонецКвартала(Объект.ДатаОкончания);
			
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Полугодие Тогда	
			
			МесяцДатыНачала = Месяц(Объект.ДатаНачала);
			
			Объект.ДатаНачала = НачалоГода(Объект.ДатаНачала);

			Если МесяцДатыНачала > 6 Тогда
				
				Объект.ДатаНачала = ДобавитьМесяц(Объект.ДатаНачала, 6);
				
			КонецЕсли;
				
			МесяцДатыОкончания = Месяц(Объект.ДатаОкончания);
			
			Объект.ДатаОкончания = КонецГода(Объект.ДатаОкончания);

			Если МесяцДатыОкончания < 7 Тогда
				
				Объект.ДатаОкончания = ДобавитьМесяц(Объект.ДатаОкончания, - 6);
				
			КонецЕсли;
			 
		ИначеЕсли Объект.Периодичность = СтруктураПериодичность.Год Тогда
			
			Объект.ДатаНачала = НачалоГода(Объект.ДатаНачала);
			Объект.ДатаОкончания = КонецГода(Объект.ДатаОкончания);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПериодичностьПриИзменении()

#КонецОбласти

#КонецОбласти
