&НаКлиенте
Процедура ЗагрузитьССервера(Команда)
	ЭтаФорма.СистемаДляЗагрузки = "Палитра";  //VOG Ульянов И.В. DEV-101
	ЗагрузитьССервераНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьССервераНаСервере()
	
	ЧтениеXML = Справочники.НастройкиПодключенияЗагрузкиНоменклатуры.ПолучитьФайлЗагрузки(Справочники.НастройкиПодключенияЗагрузкиНоменклатуры.Палитра);
	
	Объект.ТаблицаЗагрузки.Очистить();
	Обработки.ЗагрузкаНоменклатурыПалитра.ОбработатьФайл(ЧтениеXML,Объект.ТаблицаЗагрузки,"Только существующие");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьССервераАспект(Команда) //VOG Ульянов И.В. DEV-101
	ЭтаФорма.СистемаДляЗагрузки = "Аспект";
	ЗагрузитьССервераАспектНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьССервераАспектНаСервере() //VOG Ульянов И.В. DEV-101
	
	ЧтениеXML = Справочники.НастройкиПодключенияЗагрузкиНоменклатуры.ПолучитьФайлЗагрузки(Справочники.НастройкиПодключенияЗагрузкиНоменклатуры.Аспект);
	Обработки.ЗагрузкаНоменклатурыПалитра.ОбработатьФайлАспект(ЧтениеXML,Объект.ТаблицаЗагрузки,"Только существующие");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствия(Команда)
	ОткрытьФорму("РегистрСведений.СоответствияЗагружаемыхРеквизитов.ФормаСписка");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ТаблицаРеквизитов.Загрузить(Обработки.ОбновлениеНоменклатурыПалитра.ПолучитьТЗРеквизитов());
	
	Для каждого Стр из Объект.ТаблицаРеквизитов цикл
		Стр.РежимОбновления = "Перезапись значений";
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементы(Команда)
	ОбновитьЭлементыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыНаСервере()
	СтруктураОбновляемыхРеквизитов = Обработки.ОбновлениеНоменклатурыПалитра.ПолучитьСтруктуруОбновляемыхРеквизитов(Объект.ТаблицаРеквизитов);
	
	Если СтруктураОбновляемыхРеквизитов.ТЗДизайны.Количество() > 0 Тогда
		Обработки.ЗагрузкаНоменклатурыПалитра.ОбновитьДизайны(Объект.ТаблицаЗагрузки,СтруктураОбновляемыхРеквизитов.ТЗДизайны);
	КонецЕсли;	
	
	Если СтруктураОбновляемыхРеквизитов.ТЗНоменклатурныеГруппы.Количество() > 0 Тогда
		Обработки.ЗагрузкаНоменклатурыПалитра.ОбновитьНоменклатурныеГруппы(Объект.ТаблицаЗагрузки, СтруктураОбновляемыхРеквизитов.ТЗНоменклатурныеГруппы);
	КонецЕсли;	
	
	Если СтруктураОбновляемыхРеквизитов.ТЗНоменклатура.Количество() > 0 Тогда
		Обработки.ЗагрузкаНоменклатурыПалитра.ОбновитьНоменклатуру(Объект.ТаблицаЗагрузки, СтруктураОбновляемыхРеквизитов.ТЗНоменклатура, ЭтаФорма.СистемаДляЗагрузки);
	КонецЕсли;		
	
КонецПроцедуры	

&НаКлиенте
Процедура ПометитьВсе(Команда)
	
    Для Каждого СтрокаТаблицыФормы Из Объект.ТаблицаЗагрузки Цикл
        ИдентификаторСтроки= СтрокаТаблицыФормы.ПолучитьИдентификатор();
        Если Элементы.ТаблицаЗагрузки.ПроверитьСтроку(ИдентификаторСтроки) Тогда
            СтрокаТаблицыФормы.Загрузить = Истина;
        КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Команда)
	
	Для Каждого СтрокаТаблицыФормы Из Объект.ТаблицаЗагрузки Цикл
        ИдентификаторСтроки= СтрокаТаблицыФормы.ПолучитьИдентификатор();
        Если Элементы.ТаблицаЗагрузки.ПроверитьСтроку(ИдентификаторСтроки) Тогда
            СтрокаТаблицыФормы.Загрузить = Ложь;
        КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсеРеквизиты(Команда)
    Для Каждого СтрокаТаблицыФормы Из Объект.ТаблицаРеквизитов Цикл
        ИдентификаторСтроки= СтрокаТаблицыФормы.ПолучитьИдентификатор();
        Если Элементы.ТаблицаРеквизитов.ПроверитьСтроку(ИдентификаторСтроки) Тогда
            СтрокаТаблицыФормы.Загрузить = Истина;
        КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуРеквизиты(Команда)
	
	Для Каждого СтрокаТаблицыФормы Из Объект.ТаблицаРеквизитов Цикл
        ИдентификаторСтроки= СтрокаТаблицыФормы.ПолучитьИдентификатор();
        Если Элементы.ТаблицаРеквизитов.ПроверитьСтроку(ИдентификаторСтроки) Тогда
            СтрокаТаблицыФормы.Загрузить = Ложь;
        КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// ++ VOG Солодов В.В. 24.12.2020 CRM-1130
&НаСервере
Функция ПолучитьКоллекциюНоменклатурыПроизводителя(НаименованиеКоллекции)
	
	КоллекцияСсылка = Справочники.КоллекцииНоменклатурыПроизводителей.НайтиПоНаименованию(НаименованиеКоллекции, Истина);
	
	Если Не ЗначениеЗаполнено(КоллекцияСсылка) Тогда
		
		КоллекцияОбъект = Справочники.КоллекцииНоменклатурыПроизводителей.СоздатьЭлемент();
		КоллекцияОбъект.Наименование = НаименованиеКоллекции;
		
		КоллекцияОбъект.Записать();
		КоллекцияСсылка = КоллекцияОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат КоллекцияСсылка;
	
КонецФункции // -- VOG Солодов В.В. 24.12.2020 CRM-1130

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	Фильтр = "*.xml";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ВыбФайл = ДиалогОткрытияФайла.ПолноеИмяФайла;
		ДвоичныеДанные = Новый ДвоичныеДанные(ВыбФайл);
		ЗагрузитьДанныеНаСервере(ПоместитьВоВременноеХранилище(ДвоичныеДанные));
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(АдресВременногоХранилища,Расширение = "xml") 	
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные = ПолучитьИЗВременногоХранилища(АдресВременногоХранилища);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);	
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
	УдалитьВременныйФайл(ИмяВременногоФайла);
	
	//ОбработатьФайл(ЧтениеXML);
	
КонецПроцедуры
	
&НаСервере
Процедура УдалитьВременныйФайл(ПолноеИмяФайла)
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;            		
	Попытка
		УдалитьФайлы(ПолноеИмяФайла)
	Исключение
	КонецПопытки    	
КонецПроцедуры

