#Область СлужебныеПроцедурыИФункции

Процедура ПереместитьДанныеВНовыйРегистр() Экспорт
	
	НачатьТранзакцию();
	Попытка

		НаборСтарый = РегистрыСведений.УдалитьНастройкиВерсионированияОбъектов.СоздатьНаборЗаписей();
		НаборСтарый.Прочитать();
		
		НаборНовый = РегистрыСведений.НастройкиВерсионированияОбъектов.СоздатьНаборЗаписей();
		НаборНовый.Загрузить(НаборСтарый.Выгрузить());
		НаборНовый.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
