#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ОпределитьТипПоляКонтактнойИнформации(ВидКИ) Экспорт
	
	ТипПоля = Неопределено;
	
	Если ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонЮридическогоЛица
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонТорговойТочки
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонРаспределительногоЦентра Тогда
		
		ТипПоля = Перечисления.вогТипыПолейКонтрагента.Телефон;
		
	ИначеЕсли ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЮридическогоЛица
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресТорговойТочки 
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресРаспределительногоЦентра Тогда
		
		ТипПоля = Перечисления.вогТипыПолейКонтрагента.ФактическийАдрес;
		
	ИначеЕсли ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресЮридическогоЛица 
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресТорговойТочки 
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресРаспределительногоЦентра Тогда
		
		ТипПоля = Перечисления.вогТипыПолейКонтрагента.ЮридическийАдрес;
		
	КонецЕсли;
	
	Возврат ТипПоля;
	
КонецФункции

#КонецОбласти

#КонецЕсли