
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.Добавить("ОбщиеНастройки");
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		СписокОбъектов.Добавить(ПараметрКоманды);
		СписокОбъектов.Добавить(ПользователиКлиентСервер.ТекущийПользователь());
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Пользователи") Тогда
		СписокОбъектов.Добавить(CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Подразделение"));
		СписокОбъектов.Добавить(ПараметрКоманды);
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.скРабочийСтол.Форма.ФормаНастройкиРабочегоСтола", 
		Новый Структура("СписокОбъектов", СписокОбъектов), 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);
	
КонецПроцедуры

#КонецОбласти