
Функция ПолучитьАвтораЗадачи(БизнесПроцесс, ТочкаМаршрута) экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вогНеобработанныеЗадачиБизнесПроцессов.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.вогНеобработанныеЗадачиБизнесПроцессов КАК вогНеобработанныеЗадачиБизнесПроцессов
		|ГДЕ
		|	вогНеобработанныеЗадачиБизнесПроцессов.БизнесПроцесс = &БизнесПроцесс
		|	И вогНеобработанныеЗадачиБизнесПроцессов.ТочкаМаршрутаБизнесПроцесса = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Пользователь;
	Иначе
		Возврат Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
КонецФункции