
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Автор) тогда
		ТекущийОбъект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ВерсияСценария) тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	вогВерсииСценариевПланирования.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.вогВерсииСценариевПланирования КАК вогВерсииСценариевПланирования
		|ГДЕ
		|	вогВерсииСценариевПланирования.Владелец = &Владелец
		|	И вогВерсииСценариевПланирования.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Владелец",ТекущийОбъект.СценарийПланирования);
		Запрос.УстановитьПараметр("Наименование","Основная");
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ТекущийОбъект.ВерсияСценария = Выборка.Ссылка;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ПериодПланирования) тогда
		// ++ VOG Солодов В.В. 14.10.2021 CRM-1246
		ТекущийОбъект.ПериодПланирования = вогОбщегоНазначенияКлиентСервер.ПолучитьГодПланирования(Истина);
		// До изменения
		//ТекущийОбъект.ПериодПланирования = Дата(Константы.ГодПланированияОбои.Получить(),1,1);
		// -- VOG Солодов В.В. 14.10.2021 CRM-1246
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка = Документы.ПланированиеПродажПоПотенциальнымТорговымТочкамОбои.ПустаяСсылка() тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
		Объект.Дата = ТекущаяДата();
		Если ЗначениеЗаполнено(Параметры.СценарийПланирования) тогда
			Объект.СценарийПланирования = Параметры.СценарийПланирования;
			Объект.ПериодПланирования = НачалоКвартала(ДобавитьМесяц(Объект.Дата,1));	
		Иначе	
			Объект.СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаГод;	
			// ++ VOG Солодов В.В. 14.10.2021 CRM-1246
			Объект.ПериодПланирования = вогОбщегоНазначенияКлиентСервер.ПолучитьГодПланирования(Истина);
			// До изменения
			//Объект.ПериодПланирования = Дата(Константы.ГодПланированияОбои.Получить(),1,1);
			// -- VOG Солодов В.В. 14.10.2021 CRM-1246
		КонецЕсли;
		Объект.ВерсияСценария = Справочники.вогВерсииСценариевПланирования.НайтиПоНаименованию("Основная",Истина,,Объект.СценарийПланирования);
		
		//+++ Терпогосян Д.Б. [06.08.2021 17:26:29] № DEV-743
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(	ТекущийПользователь, "Подразделение", Истина);
		Объект.Подразделение  = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(	РеквизитыПользователя.Подразделение);
		//--- Терпогосян Д.Б. [06.08.2021 17:26:35] № DEV-743 

	КонецЕсли;

	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПланированияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование тогда
		Элементы.ДанныеПланирования.ТекущиеДанные.УИД="";	
	Конецесли;
КонецПроцедуры

// +++ VOG Кулаков П.Л. 13.04.2021 DEV-383
&НаКлиенте
Процедура ДанныеПланированияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования И Элемент.ТекущийЭлемент.Имя = "ДанныеПланированияТорговаяТочка"
			И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТорговаяТочка) Тогда
		Элемент.ТекущиеДанные.Менеджер = ЗаполнитьМенеджераНаСервере(Элемент.ТекущиеДанные.ТорговаяТочка);
	КонецЕсли;
	
КонецПроцедуры // --- VOG Кулаков П.Л.

// +++ VOG Кулаков П.Л. 13.04.2021 DEV-383
&НаСервере
Функция ЗаполнитьМенеджераНаСервере(ТорговаяТочка)
	
	Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Объект.Автор.Подразделение);
		
	Если ЗначениеЗаполнено(ТорговаяТочка) Тогда
		ПодразделениеТорговойТочки = РегистрыСведений.ПодразделенияТорговыхТочек.ПолучитьПодразделениеТорговойТочки(ТорговаяТочка,Справочники.НаправленияДеятельности.Обои);
		Если ПодразделениеТорговойТочки <> Неопределено Тогда
			МенеджерТорговойТочки = РегистрыСведений.вогМенеджерыОбъектов.ПолучитьМенеджераТорговойТочки(ТорговаяТочка,ПодразделениеТорговойТочки,Справочники.НаправленияДеятельности.Обои);
			Если МенеджерТорговойТочки = Неопределено Тогда
				МенеджерТорговойТочки = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли; 
	Иначе
		МенеджерТорговойТочки = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Возврат МенеджерТорговойТочки;
	
КонецФункции // --- VOG Кулаков П.Л.

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//+++ Терпогосян Д.Б. [06.08.2021 16:52:01] № DEV-743
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//--- Терпогосян Д.Б. [06.08.2021 16:52:07] № DEV-743 
КонецПроцедуры
