
&НаКлиенте
Процедура КомандаПрименить(Команда)
	
	ОчиститьСообщения();
	ВсеОК = ПроверитьЗаполнение();
	
	Если НЕ ВсеОК Тогда
		Возврат;
	КонецЕсли;

	ДатаВремяСтарая = CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(ДатаСтарая);
	// Проверим что новая дата больше старой
	//Если НачалоДня(ДатаНачала) < НачалоДня(ДатаСтарая) Тогда
	//	
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//					НСтр("ru = 'Ошибка! Новая дата контрольной точки должна быть больше или равна старой.'"), ,
	//					, "ДатаНачала",
	//					);
	//	Возврат;					
	//ИначеЕсли НачалоДня(ДатаНачала) = НачалоДня(ДатаСтарая) Тогда
	//	Если (Не НаВесьДень) И ВремяНачала < ДатаВремяСтарая.Время Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//					НСтр("ru = 'Ошибка! Время новое контрольной точки должно быть больше или равно старой.'"), ,
	//					, "ВремяНачала"
	//					);		
	//	Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	ПередаваемыеДанные = Новый Структура;
	ПередаваемыеДанные.Вставить("ДатаНачала", ДатаНачала);
	ПередаваемыеДанные.Вставить("ДатаОкончания",ДатаОкончания);
	//ПередаваемыеДанные.Вставить("ДатаСтарая",ДатаСтарая);
	//ПередаваемыеДанные.Вставить("ВремяНачала",ВремяНачала);
	ПередаваемыеДанные.Вставить("НаВесьДень",НаВесьДень);
	ПередаваемыеДанные.Вставить("Комментарий", Комментарий);
	Закрыть(ПередаваемыеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьДатуВремя()
	
	ДатаВремяНачала = CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(ДатаНачала);
	ДатаВремяСтарая = CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(ДатаСтарая);
	//Если ДатаВремяНачала.Дата<=ДатаВремяСтарая.Дата Тогда
	//	ДатаНачала=ДатаСтарая;
	//	ВремяНачала = ?(ДатаВремяНачала.Время <=ДатаВремяСтарая.Время,ДатаВремяСтарая.Время,ДатаВремяНачала.Время);
	//КонецЕсли;
	Если ДатаОкончания < ДатаНачала Тогда
		ДатаОкончания=ДатаНачала;
		ДатаВремяНачала = CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(ДатаНачала);
		ВремяОкончания = ДатаВремяНачала.Время;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДатаСтарая",ЭтаФорма.ДатаСтарая);
	Параметры.Свойство("НаВесьДень",ЭтаФорма.НаВесьДень);
	
	Если НачалоДня(ТекущаяДата())<НачалоДня(ДатаСтарая) Тогда
		ДатаНачала = НачалоДня(ДатаСтарая)+60*60*24;
		ДатаОкончания = ДатаНачала+60*60*24;
	Иначе
		ДатаНачала = НачалоДня(ТекущаяДата())+60*60*24;
		ДатаОкончания = ДатаНачала+60*60*24;
	КонецЕсли;
	Если Не НаВесьДень Тогда
		ДатаВремяСтарая = CRM_ОбщегоНазначенияКлиентСервер.РазделитьДатаНаДатуИВремя(ДатаСтарая);
		ВремяНачала = ДатаВремяСтарая.Время;
	Иначе
		ВремяНачала = 0;
		ВремяОкончания = 0;
	КонецЕсли;
	
	//agr (179592 / 231458 / 14.11.2016)
	//УправлениеДоступностьЭлементовФормы.УстановитьДоступностьЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ВремяНачала.Видимость = (НЕ НаВесьДень);
	Элементы.ВремяОкончания.Видимость = (НЕ НаВесьДень);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СкорректироватьДатуВремя();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	СкорректироватьДатуВремя();
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	СкорректироватьДатуВремя();
	ДатаНачала = CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала);	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПриИзменении(Элемент)
	СкорректироватьДатуВремя();
	ДатаОкончания = CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОкончания, ВремяОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранноеВремя = CRM_ОбщегоНазначенияКлиентСервер.ВыбратьВремяИзСписка(ЭтаФорма, ВремяНачала, Элемент);
	Если ВыбранноеВремя <> Неопределено Тогда
		ВремяНачала = ВыбранноеВремя;
	КонецЕсли;
	ДатаНачала = CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаНачала, ВремяНачала);	
	СкорректироватьДатуВремя();
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранноеВремя = CRM_ОбщегоНазначенияКлиентСервер.ВыбратьВремяИзСписка(ЭтаФорма, ВремяОкончания, Элемент);
	Если ВыбранноеВремя <> Неопределено Тогда
		ВремяОкончания = ВыбранноеВремя;
	КонецЕсли;
	ДатаОкончания = CRM_ОбщегоНазначенияКлиентСервер.СформироватьДатуИзДатыИВремени(ДатаОкончания, ВремяОкончания);
	СкорректироватьДатуВремя();
	
КонецПроцедуры

&НаКлиенте
Процедура НаВесьДеньПриИзменении(Элемент)
	
	Элементы.ВремяНачала.Видимость = (Не НаВесьДень);
	Элементы.ВремяОкончания.Видимость = (Не НаВесьДень);
	
КонецПроцедуры


