
#Область ОбработчикиСобытийФормы
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УзелОбменаСсылка = Параметры.УзелОбменаСсылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрочитатьНомераСообщений();
	Заголовок = УзелОбменаСсылка;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
//

//
// Производит запись измененны данных и закрывает форму.
//
&НаКлиенте
Процедура ЗаписатьИзмененияУзла(Команда)
	ЗаписатьНомераСообщений();
	Оповестить("ИзменениеДанныхУзлаОбмена", УзелОбменаСсылка, ЭтотОбъект);
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//

&НаСервере
Процедура ПрочитатьНомераСообщений()
	Данные = ПланыОбмена.CRM_Полный.ПолучитьПараметрыУзлаОбмена(УзелОбменаСсылка, "НомерОтправленного, НомерПринятого, ВерсияДанных");
	Если Данные=Неопределено Тогда
    	НомерОтправленного = Неопределено;
    	НомерПринятого     = Неопределено;
    	ВерсияДанных	   = Неопределено;
    Иначе
    	НомерОтправленного = Данные.НомерОтправленного;
    	НомерПринятого     = Данные.НомерПринятого;
    	ВерсияДанных	   = Данные.ВерсияДанных;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьНомераСообщений()
	Данные = Новый Структура("НомерОтправленного, НомерПринятого", НомерОтправленного, НомерПринятого);
	ПланыОбмена.CRM_Полный.УстановитьПараметрыУзлаОбмена(УзелОбменаСсылка, Данные);
КонецПроцедуры

#КонецОбласти
