
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) И (ОбменДаннымиПовтИсп.ПолучитьЭтотУзелПланаОбменаПоСсылке(Объект.Ссылка) = Объект.Ссылка) Тогда
	//	
	//	КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыполнениеОбменаДанными.Видимость = Ложь;
	//	
	//КонецЕсли;
	
	УстановитьЗаголовокНомеровСообщений();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПриЗакрытии".
//
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда Возврат; КонецЕсли;
	
	Оповестить("ЗакрытаФормаУзлаПланаОбмена");
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНомераСообщений(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекПараметры = Новый Структура("УзелОбменаСсылка", Объект.Ссылка);
		ОткрытьФорму("ПланОбмена.CRM_Полный.Форма.НомераСообщенийУзлаПланаОбмена", ТекПараметры);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПрочитатьНомераСообщений()
    РеквизитыЗапроса = "НомерОтправленного, НомерПринятого";
	Данные = ПланыОбмена.CRM_Полный.ПолучитьПараметрыУзлаОбмена(Объект.Ссылка, РеквизитыЗапроса);
    Если Данные=Неопределено Тогда
        Возврат Новый Структура(РеквизитыЗапроса)
	КонецЕсли;
	Возврат Данные;
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокНомеровСообщений()
	
	Текст = НСтр("ru='№ сообщений: отпр. %1, прин. %2'");
	
	Данные = ПрочитатьНомераСообщений();
	Текст = СтрЗаменить(Текст, "%1", Формат(Данные.НомерОтправленного, "ЧДЦ=0; ЧН="));
	Текст = СтрЗаменить(Текст, "%2", Формат(Данные.НомерПринятого, "ЧДЦ=0; ЧН="));
	
	Элементы.ФормаРедактироватьНомераСообщений.Заголовок = Текст;
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ИзменениеДанныхУзлаОбмена" И Объект.Ссылка=Параметр Тогда
		УстановитьЗаголовокНомеровСообщений();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
