
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("НаправлениеДеятельности") Тогда
		
		Если Параметры.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Обои Тогда
			
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(Справочники.вогУровниГруппировкиКоллекцийНоменклатуры.Бренд);
			ДанныеВыбора.Добавить(Справочники.вогУровниГруппировкиКоллекцийНоменклатуры.ЦеноваяКатегория);
			ДанныеВыбора.Добавить(Справочники.вогУровниГруппировкиКоллекцийНоменклатуры.Дизайн);
			
		ИначеЕсли Параметры.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Плитка Тогда
			
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.Добавить(Справочники.вогУровниГруппировкиКоллекцийНоменклатуры.Бренд);
			ДанныеВыбора.Добавить(Справочники.вогУровниГруппировкиКоллекцийНоменклатуры.Коллекция);
			ДанныеВыбора.Добавить(Справочники.вогУровниГруппировкиКоллекцийНоменклатуры.Цвет);
			
		КонецЕсли;
		
		Если Параметры.Свойство("СтрокаПоиска")
			И Параметры.СтрокаПоиска <> ""
			И ДанныеВыбора <> Неопределено
			И ДанныеВыбора.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	вогУровниГруппировкиКоллекцийНоменклатуры.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.вогУровниГруппировкиКоллекцийНоменклатуры КАК вогУровниГруппировкиКоллекцийНоменклатуры
			|ГДЕ
			|	вогУровниГруппировкиКоллекцийНоменклатуры.Наименование ПОДОБНО &Наименование
			|	И вогУровниГруппировкиКоллекцийНоменклатуры.Ссылка В(&СписокСсылок)";
			
			Запрос.УстановитьПараметр("Наименование", Параметры.СтрокаПоиска + "%");
			Запрос.УстановитьПараметр("СписокСсылок", ДанныеВыбора);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ДанныеВыбора = Новый СписокЗначений;
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ДанныеВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
