// ++ VOG Ульянов И.В. 30.09.2019 task
Функция ПолучитьПодписьПечать(Организация, Ответственный) Экспорт
	
	СтруктураДанных = Новый Структура("Подпись, Печать", Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вогПечатиИПодписиСрезПоследних.Владелец КАК Владелец,
		|	вогПечатиИПодписиСрезПоследних.Картинка КАК Картинка
		|ИЗ
		|	РегистрСведений.вогПечатиИПодписи.СрезПоследних КАК вогПечатиИПодписиСрезПоследних
		|ГДЕ
		|	вогПечатиИПодписиСрезПоследних.Владелец В(&МассивВладельцев)";
	
	МассивВладельцев = Новый Массив;
	МассивВладельцев.Добавить(Организация);
	МассивВладельцев.Добавить(Ответственный);
	
	Запрос.УстановитьПараметр("МассивВладельцев", МассивВладельцев);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Владелец = Организация тогда
			СтруктураДанных.Печать = Новый Картинка(Выборка.Картинка.Получить());
		КонецЕсли;		
		Если Выборка.Владелец = Ответственный тогда
			СтруктураДанных.Подпись = Новый Картинка(Выборка.Картинка.Получить());
		КонецЕсли;		
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции
// -- VOG Ульянов И.В. 30.09.2019 task