
// +CRM

&НаКлиенте
Процедура ШаблонОповещенияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"CRM_ШаблонОповещения",
		?(ШаблонОповещения=0,Ложь,Истина),ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И НЕ Группа Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ШаблонОповещения",?(ШаблонОповещения=0,Ложь,Истина));
		ОткрытьФорму("Справочник.sms4bШаблоны.ФормаОбъекта",ПараметрыФормы,Элементы.Список);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"CRM_ШаблонОповещения",
		?(ШаблонОповещения=0,Ложь,Истина),ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
КонецПроцедуры

// -CRM
