
Процедура ОбработкаКнопокСообщенийДокументаМероприятие(Действие,ИдентификаторСообщения) Экспорт
	
	Документы.CRM_Мероприятие.ОбработкаКнопокСообщений(Действие,ИдентификаторСообщения);	
	
	
КонецПроцедуры


Процедура ДобавитьНапоминаниеДляПолучателейПриОтправкеСообщения(Получатели,Объект,ЗаголовокОбсуждения,ТекстСообщения)   Экспорт
	
	вогСистемаВзаимодействийСервер.ДобавитьНапоминаниеДляПолучателейПриОтправкеСообщения(Получатели,Объект,ЗаголовокОбсуждения,ТекстСообщения);
	
КонецПроцедуры

//Функция возвращает массив навигационных ссылок из непрочитанных напоминаний текущего пользователя
Функция ПолучитьСписокАктивныхНапоминанийТекущегоПользователя() экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	вогНапоминанияОСообщениях.Контекст КАК Контекст
	               |ИЗ
	               |	РегистрСведений.вогНапоминанияОСообщениях КАК вогНапоминанияОСообщениях
	               |ГДЕ
	               |	вогНапоминанияОСообщениях.Пользователь = &Пользователь
	               |	И НЕ вогНапоминанияОСообщениях.Прочитано ";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контекст");
	Возврат Результат;
	
КонецФункции

Процедура ПриЗакрытииФормыОбъекта(URL) экспорт
	
	вогСистемаВзаимодействийСервер.ПриЗакрытииФормыОбъектa(URL);
	
КонецПроцедуры


Процедура вогОткрытиеФормыОбъектаДляНапоминанийОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	вогСистемаВзаимодействийСервер.вогОткрытиеФормыОбъектаДляНапоминанийОбработкаПолученияФормы(Источник,ВидФормы,Параметры,ВыбраннаяФорма,ДополнительнаяИнформация,СтандартнаяОбработка);
	
КонецПроцедуры