
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура КомандаПечать(Команда)
	ДокументРезультат.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если	Не Параметры.Свойство("АдресТабличногоДокумента")
		Или ТипЗнч(Параметры.АдресТабличногоДокумента) <> Тип("Строка")
		Или Не ЭтоАдресВременногоХранилища(Параметры.АдресТабличногоДокумента) Тогда
		//
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТабДокумент = ПолучитьИзВременногоХранилища(Параметры.АдресТабличногоДокумента);
	УдалитьИзВременногоХранилища(Параметры.АдресТабличногоДокумента);
	
	ДокументРезультат.Вывести(ТабДокумент);
КонецПроцедуры
