
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Расшифровка") И Параметры.Расшифровка = Неопределено Тогда
		РасшифровкаНеИспользуется = Истина;
	Иначе
		ПараметрыРасшифровки = Параметры.Расшифровка;
		ПрименяемыеНастройки = Отчет.КомпоновщикНастроек.ФиксированныеНастройки;
		
		// Установить параметры данных.
		ПрименяемыеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра(
		"ТекущийПериод", ПараметрыРасшифровки.ТекущийПериод
		);
		ПрименяемыеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра(
		"ПрошлыйПериод", ПараметрыРасшифровки.ПрошлыйПериод
		);
		ПрименяемыеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра(
		"ТипПараметраКлассификации", ПараметрыРасшифровки.ТипПараметраКлассификации
		);
		
		// установить отбор
		ОтборРасшифровки = ПрименяемыеНастройки.Отбор;
		Для Каждого Элемент Из ПараметрыРасшифровки.Отбор Цикл
			ЭлементОтбора = ОтборРасшифровки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элемент.Ключ);
			ЭлементОтбора.ПравоеЗначение = Элемент.Значение;
			ЭлементОтбора.Использование  = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если РасшифровкаНеИспользуется Тогда
		Возврат;
	КонецЕсли;
	
	// установить заголовки
	ПараметрыРасшифровки = Параметры.Расшифровка;
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ПараметрыРасшифровки.Заголовок);
	Выбор = Настройки.Выбор.Элементы;
	ПредыдущееЗначениеПараметра = Новый ПолеКомпоновкиДанных("ПрошлоеЗначениеПараметраКлассификации");
	ТекущееЗначениеПараметра = Новый ПолеКомпоновкиДанных("ТекущееЗначениеПараметраКлассификации");
	Для Каждого Элемент Из Выбор Цикл
		Если Элемент.Поле = ПредыдущееЗначениеПараметра
		 Или Элемент.Поле = ТекущееЗначениеПараметра Тогда
			Элемент.Заголовок = ПараметрыРасшифровки.ТипПараметраКлассификации;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если РасшифровкаНеИспользуется Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru='Отказ'"), ,
			НСтр("ru='Отчет может быть использован только как расшифровка анализа клиентской базы (BCG)'"),
			БиблиотекаКартинок.Информация32
		);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьРезультатДляСохраненияСервер()
	
	Если НЕ CRM_ЛицензированиеСервер.ПодсистемаCRMИспользуется() Тогда
		Возврат НСтр("ru = 'Невозможно сохранить результат отчета. Подсистема 1С:CRM не используется!'");
	КонецЕсли;
	
	Возврат CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().ОбщаяФорма_CRM_ОбщаяФормаОтчетов_СформироватьРезультатДляСохраненияСервер(ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура СохранитьРезультат(Команда)
	СтруктураПараметры = СформироватьРезультатДляСохраненияСервер();
	Если ТипЗнч(СтруктураПараметры) = Тип("Структура") Тогда
		ОткрытьФорму("ОбщаяФорма.CRM_СохранениеЗагрузкаРезультатовОтчетов", СтруктураПараметры, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатВОтбор(Команда)
	СтруктураПараметры = Новый Структура("Режим,КомпоновщикНастроек", "", Отчет.КомпоновщикНастроек);
	Если Не ЗначениеЗаполнено(Отчет.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки) Тогда
		СтруктураПараметры.Вставить("ИспользоватьПользовательскиеПоляОтбора");
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьРезультатВОтборЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CRM_ЗагрузкаРезультатовОтчетовВОтбор", СтруктураПараметры, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатВОтборЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		CRM_ОбщегоНазначенияКлиент.УстановитьОтборПоСпискуРезультатаОтчета(
		РезультатЗакрытия.Наименование,
		РезультатЗакрытия.Поле,
		Отчет.КомпоновщикНастроек.Настройки,
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	КонецЕсли;
КонецПроцедуры
