
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ++ VOG Солодов В.В. 22.07.2021 DEV-641
Процедура ПередЗаписью(Отказ, Замещение)
	
	СписокНоменклатуры = Новый СписокЗначений;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
			СписокНоменклатуры.Добавить(Запись.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНоменклатура.вогПроизводитель КАК Производитель,
	|	ЕСТЬNULL(ТаблицаBSU.Ссылка, ЗНАЧЕНИЕ(Справочник.вогНоменклатурныеПозиции.ПустаяСсылка)) КАК НоменклатурнаяПозиция,
	|	ЕСТЬNULL(ТаблицаДизайны.Бренд, ЗНАЧЕНИЕ(Справочник.вогБренды.ПустаяСсылка)) КАК Бренд,
	|	ЕСТЬNULL(ТаблицаДизайны.НоменклатурнаяГруппа, ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)) КАК НоменклатурнаяГруппа,
	|	ТаблицаНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ТаблицаЕдиницыИзмерения.Коэффициент, 0) КАК К
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вогНоменклатурныеПозиции КАК ТаблицаBSU
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вогДизайныНоменклатуры КАК ТаблицаДизайны
	|			ПО ТаблицаBSU.Дизайн = ТаблицаДизайны.Ссылка
	|		ПО ТаблицаНоменклатура.НоменклатурнаяПозиция = ТаблицаBSU.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ТаблицаЕдиницыИзмерения
	|		ПО ТаблицаНоменклатура.ЕдиницаДляОтчетов = ТаблицаЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	ТаблицаНоменклатура.Ссылка В(&СписокНоменклатуры)";
	
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		тзДанныеНоменклатуры = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			
			Если Не ЗначениеЗаполнено(Запись.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не (ЗначениеЗаполнено(Запись.Бренд)
				И ЗначениеЗаполнено(Запись.Производитель)
				И ЗначениеЗаполнено(Запись.НоменклатурнаяГруппа)) Тогда
				
				СтрокаТЗ = тзДанныеНоменклатуры.Найти(Запись.Номенклатура);
				
				Если Не СтрокаТЗ = Неопределено Тогда
					
					Запись.Бренд 				= СтрокаТЗ.Бренд;
					Запись.Производитель 		= СтрокаТЗ.Производитель;
					Запись.НоменклатурнаяГруппа = СтрокаТЗ.НоменклатурнаяГруппа;
					Если СтрокаТЗ.К > 0 Тогда
						Запись.Количество_в_единицах_отчетов = Запись.Количество / СтрокаТЗ.К;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // -- VOG Солодов В.В. 22.07.2021 DEV-641

Процедура ПриЗаписи(Отказ, Замещение)
	
	// ++ VOG Солодов В.В. 22.07.2021 DEV-641
	// До изменения
	//СписокНоменклатуры = Новый СписокЗначений;
	//
	//Для каждого Запись из ЭтотОбъект цикл
	//	Если ЗначениеЗаполнено(Запись.Номенклатура) тогда
	//		СписокНоменклатуры.Добавить(Запись.Номенклатура);		
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Номенклатура.вогПроизводитель КАК Производитель,
	//               |	Номенклатура.НоменклатурнаяПозиция КАК НоменклатурнаяПозиция,
	//               |	Номенклатура.НоменклатурнаяПозиция.Дизайн.Бренд КАК Бренд,
	//               |	Номенклатура.НоменклатурнаяПозиция.Дизайн.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//               |	Номенклатура.Ссылка КАК Номенклатура,
	//               |	Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК К
	//               |ИЗ
	//               |	Справочник.Номенклатура КАК Номенклатура
	//               |ГДЕ
	//               |	Номенклатура.Ссылка В(&СписокНоменклатуры)";
	//
	//Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	//тзДанныеНоменклатуры = Запрос.Выполнить().Выгрузить();
	//Для каждого Запись из ЭтотОбъект цикл
	//	Если ЗначениеЗаполнено(Запись.Номенклатура) тогда
	//		Если НЕ(ЗначениеЗаполнено(Запись.Бренд) и ЗначениеЗаполнено(Запись.Производитель) и ЗначениеЗаполнено(Запись.НоменклатурнаяГруппа)) тогда
	//			СтрокаТЗ = тзДанныеНоменклатуры.Найти(Запись.Номенклатура);
	//			Если СтрокаТЗ<>Неопределено тогда
	//				Запись.Бренд = СтрокаТЗ.Бренд;
	//				Запись.Производитель = СтрокаТЗ.Производитель;
	//				Запись.НоменклатурнаяГруппа = СтрокаТЗ.НоменклатурнаяГруппа;
	//				Если СтрокаТЗ.К>0 тогда
	//					Запись.Количество_в_единицах_отчетов = Запись.Количество / СтрокаТЗ.К;
	//				КонецЕслИ;	
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	// -- VOG Солодов В.В. 22.07.2021 DEV-641
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли