
Процедура ПередЗаписью(Отказ)
	
	МаксДатаИсполнения = Дата(1,1,1);
	Ответственный = Справочники.Пользователи.ПустаяСсылка();
	СрокИсполненияПроцесса = Дата(1,1,1);
	Для каждого Строка из Исполнители цикл
		МаксДатаИсполнения = Макс(Строка.СрокИсполнения,МаксДатаИсполнения);
		Если Строка.Ответственный тогда
			Ответственный = строка.Исполнитель;
			СрокИсполненияПроцесса = Строка.СрокИсполнения;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Проверяющий) и  МаксДатаИсполнения > СрокОбработкиРезультатов тогда
		Сообщить("Срок обработки результатов должен быть позже, чем крайняя дата исполнения решения по пункту протокола");
		Отказ = Истина;
	КонецЕсли;
		
	//Если Мероприятие.вогПрограмма.ВыгрузитьКолонку("НомерПункта").Найти(НомерПунктаПрограммы) = Неопределено тогда
	//	Сообщить("Не верно указан пункт программы");
	//	Отказ = Истина;
	//КонецЕсли;
	
	Наименование = Мероприятие.Тема + " пункт протокола " + НомерПунктаПрограммы;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры
