
&НаКлиенте
Процедура СправочникПриИзменении(Элемент)
	Запись.ИмяРеквизитаВФайле		= Справочник;
	Запись.СправочникВНашейСистеме	= Элемент.ТекстРедактирования;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.ТегФайла = "" Тогда
		Запись.ТегФайла = "Палитра";
	КонецЕсли;
	
	Справочник = Запись.ИмяРеквизитаВФайле;
	
КонецПроцедуры

//Brend Бренды
//PatternType Стили рисунка обоев
//Structure Виды структуры обоев
//Information Тип рисунка обоев
//PictureSize Размер рисунка обоев
//PictureElements Элементы рисунка обоев
//Surface Виды поверхности обоев
//Colors Цвета
//Basis Основа для обоев
//TypeProd Способы производства обоев