#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПараметрыСпискаМенеджерыОбъектов(ВидСписка) Экспорт
	
	СтруктураСвойств = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	Если ВидСписка = "МенеджерыВидВсе" Тогда
		
		СтруктураСвойств.ТекстЗапроса =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрСведенийМенеджерыОбъектов.Владелец КАК Владелец,
		|	РегистрСведенийМенеджерыОбъектов.Роль КАК Роль,
		|	РегистрСведенийМенеджерыОбъектов.Менеджер КАК Менеджер,
		|	РегистрСведенийМенеджерыОбъектов.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	РегистрСведенийМенеджерыОбъектов.ДатаНачала КАК ДатаНачала,
		|	РегистрСведенийМенеджерыОбъектов.ДатаОкончания КАК ДатаОкончания,
		|	РегистрСведенийМенеджерыОбъектов.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.вогМенеджерыОбъектов КАК РегистрСведенийМенеджерыОбъектов
		|ГДЕ
		|	РегистрСведенийМенеджерыОбъектов.Владелец = &Владелец
		|	И ВЫБОР
		|			КОГДА РегистрСведенийМенеджерыОбъектов.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА РегистрСведенийМенеджерыОбъектов.ДатаОкончания > &ТекущаяДата
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вогИсторияМенеджеровОбъектов.Владелец,
		|	вогИсторияМенеджеровОбъектов.Роль,
		|	вогИсторияМенеджеровОбъектов.Менеджер,
		|	вогИсторияМенеджеровОбъектов.НаправлениеДеятельности,
		|	вогИсторияМенеджеровОбъектов.ДатаНачала,
		|	вогИсторияМенеджеровОбъектов.ДатаОкончания,
		|	вогИсторияМенеджеровОбъектов.Подразделение
		|ИЗ
		|	РегистрСведений.вогИсторияМенеджеровОбъектов КАК вогИсторияМенеджеровОбъектов
		|ГДЕ
		|	вогИсторияМенеджеровОбъектов.Владелец = &Владелец";
		
		СтруктураСвойств.ОсновнаяТаблица = "";
		
	Иначе
		
		СтруктураСвойств.ТекстЗапроса =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрСведенийМенеджерыОбъектов.Владелец КАК Владелец,
		|	РегистрСведенийМенеджерыОбъектов.Роль КАК Роль,
		|	РегистрСведенийМенеджерыОбъектов.Менеджер КАК Менеджер,
		|	РегистрСведенийМенеджерыОбъектов.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	РегистрСведенийМенеджерыОбъектов.ДатаНачала КАК ДатаНачала,
		|	РегистрСведенийМенеджерыОбъектов.ДатаОкончания КАК ДатаОкончания,
		|	РегистрСведенийМенеджерыОбъектов.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.вогМенеджерыОбъектов КАК РегистрСведенийМенеджерыОбъектов
		|ГДЕ
		|	РегистрСведенийМенеджерыОбъектов.Владелец = &Владелец
		|	И ВЫБОР
		|			КОГДА РегистрСведенийМенеджерыОбъектов.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА РегистрСведенийМенеджерыОбъектов.ДатаОкончания > &ТекущаяДата
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		СтруктураСвойств.ОсновнаяТаблица = "РегистрСведений.вогМенеджерыОбъектов";
		
	КонецЕсли;
	
	Возврат СтруктураСвойств;
	
КонецФункции 

#КонецОбласти

#КонецЕсли