
&НаСервереБезКонтекста
Функция ЭтоГруппа(Элемент)
	
	Выборка = Справочники.вогВидыПлитки.ВыбратьИерархически(Элемент);
	Возврат Выборка.Следующий();
	
КонецФункции



&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтоГруппа(ВыбранноеЗначение) и НЕ РазрешитьВыборГруппыЭлементов тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

	Если ЭтоГруппа(Значение) и НЕ РазрешитьВыборГруппыЭлементов тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешитьВыборГруппыЭлементов = Параметры.РазрешитьВыборГруппыЭлементов;
	
КонецПроцедуры
