
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьHTMLТекст();
	вогНачальнаяСтраницаПользователяКлиетСервер.НачальнаяСтраницаПользователяПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьHTMLТекст()
	
	Виджет = Справочники.вогВиджетыРабочегоСтола.Планирование;
	НастройкиВиджетаФона = Виджет.НастройкиВиджета.Получить();
	ПланыHTML = НастройкиВиджетаФона.КодЭлемента;
	КодФормирования = НастройкиВиджетаФона.КодФормирования;
	Попытка
		Выполнить(КодФормирования);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
	Для Каждого Строка Из Виджет.Действия Цикл
		НоваяСтрока = ДействияВиджетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		НоваяСтрока.Виджет = Виджет;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("УстановитьПунктМеню",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПунктМеню()
	Если Элементы.МенюHTML.Документ <> Неопределено Тогда
		Если Элементы.МенюHTML.Документ.readyState = "complete" Тогда
			вогНачальнаяСтраницаПользователяКлиетСервер.НачальнаяСтраницаПользователяПриОткрытии(ЭтаФорма,"планы");
			//ОтключитьОбработчикОжидания("УстановитьПунктМеню");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МенюHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Element <> Неопределено Тогда
		вогНачальнаяСтраницаПользователяКлиетСервер.МенюHTMLПриНажатии(ЭтаФорма,"планы");
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Процедура ПланыHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если СтрЧислоВхождений(ДанныеСобытия.Href, "Open_Form") > 0 Тогда	
		
		НайденноеДействие = ДействиеПоСобытию(ДанныеСобытия.Href);
		
		Если Не НайденноеДействие.Количество() = 0 Тогда		
			
			ПараметрыОткрытия = ВыполнитьПроизвольныйКодНаСервере(НайденноеДействие[0].ВыполняемыйКод, ДанныеСобытия.Href);
			
			Если ПараметрыОткрытия = Неопределено Тогда Возврат КонецЕсли;
			
			ОписаниеОповещения = Неопределено;
			Если Не ПараметрыОткрытия.ОписаниеОповещения = Неопределено Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения(ПараметрыОткрытия.ОписаниеОповещения, ЭтотОбъект, ПараметрыОткрытия.ПараметрыОповещения)	
			КонецЕсли;
			
			ОткрытьФорму(ПараметрыОткрытия.НазваниеФормы, ПараметрыОткрытия.Параметры, ЭтаФорма, УникальныйИдентификатор,,, ОписаниеОповещения);
			
		КонецЕсли;	
		
	ИначеЕсли СтрЧислоВхождений(ДанныеСобытия.Href, "Change") > 0 Тогда	
		
		НайденноеДействие = ДействиеПоСобытию(ДанныеСобытия.Href);
		
		Если Не НайденноеДействие.Количество() = 0 Тогда		
			
			ДанныеВыбора = ВыполнитьПроизвольныйКодНаСервере(НайденноеДействие[0].ВыполняемыйКод, ДанныеСобытия.Href);
			
			Если ДанныеВыбора <> Неопределено Тогда
				
				ОписаниеОповещения = Неопределено;
				Если Не ДанныеВыбора.ОписаниеОповещения = Неопределено Тогда
					ОписаниеОповещения = Новый ОписаниеОповещения(ДанныеВыбора.ОписаниеОповещения, ЭтотОбъект, ДанныеВыбора.ПараметрыОповещения)	
				КонецЕсли;
			
				ПоказатьВыборИзСписка(ОписаниеОповещения, ДанныеВыбора.СписокДанных,Элемент);
							
			КонецЕсли;
			
		КонецЕсли;
		          
	ИначеЕсли СтрЧислоВхождений(ДанныеСобытия.Href, "Execute_Client") > 0 Тогда
		
		НайденноеДействие = ДействиеПоСобытию(ДанныеСобытия.Href);
		
		Если Не НайденноеДействие.Количество() = 0 Тогда		
			
			РезультатВыполнения = ВыполнитьПроизвольныйКодНаКлиенте(НайденноеДействие[0].ВыполняемыйКод, ДанныеСобытия.Href);
			
			Если НЕ РезультатВыполнения Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить запрос. Обратитесь к администратору");
			КонецЕсли;
			
		КонецЕсли;
	ИначеЕсли СтрЧислоВхождений(ДанныеСобытия.Href, "Execute_Server") > 0 Тогда
		
		НайденноеДействие = ДействиеПоСобытию(ДанныеСобытия.Href);
		
		Если Не НайденноеДействие.Количество() = 0 Тогда		
			
			РезультатВыполнения = ВыполнитьПроизвольныйКодНаСервере(НайденноеДействие[0].ВыполняемыйКод, ДанныеСобытия.Href);
			
			Если НЕ РезультатВыполнения Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить запрос. Обратитесь к администратору");
			КонецЕсли;
			
		КонецЕсли;
	ИначеЕсли СтрЧислоВхождений(ДанныеСобытия.Href, "View_Option") > 0 Тогда
		
		НайденноеДействие = ДействиеПоСобытию(ДанныеСобытия.Href);
		
		Если Не НайденноеДействие.Количество() = 0 Тогда		
			
			РезультатВыполнения = ВыполнитьПроизвольныйКодНаСервере(НайденноеДействие[0].ВыполняемыйКод, ДанныеСобытия.Href);
			
			Если НЕ РезультатВыполнения Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить запрос. Обратитесь к администратору");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДействиеПоСобытию(ИмяСобытия)
	
	Если СтрНайти(ИмяСобытия, "Open_Form_Credit_Control") Тогда
		
		Действие = "Open_Form_Credit_Control";
		
	Иначе
		
		НомерСимвола = СтрНайти(ИмяСобытия, "/", НаправлениеПоиска.СКонца);
			
		Действие = Сред(ИмяСобытия, НомерСимвола + 1, СтрДлина(ИмяСобытия));	
		
		Если СтрНайти(Действие, "_ID_") Тогда		
			Действие = Сред(Действие, 0, СтрНайти(Действие, "_", НаправлениеПоиска.СКонца) - 1)	
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ДействияВиджетов.НайтиСтроки(Новый Структура("Действие", Действие));
	
КонецФункции

&НаКлиенте
Функция ВыполнитьПроизвольныйКодНаКлиенте(ВыполняемыйКод, ИмяСобытия)
	
	Результат = Неопределено;
	
	Выполнить(ВыполняемыйКод);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыполнитьПроизвольныйКодНаСервере(ВыполняемыйКод, ИмяСобытия)
	
	Результат = Неопределено;
	
	Выполнить(ВыполняемыйКод);
	
	Возврат Результат;
	
КонецФункции
