
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Записывать = Истина;
	
	НГБерезы 	= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("23f84ea5-6868-11e7-9071-005056acd97c"));
	НГПечоры 	= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("75e9b0e1-ec17-11e5-b10e-005056acd97c"));
	НГУфа 		= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("08fced4f-9215-11e3-ba76-005056ac259f"));
	НГШахты 	= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("ee883a10-6867-11e7-9071-005056acd97c"));
	НГКерамин 	= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("c086e912-43d3-11e8-8a33-005056acd97c"));
	НГИК 		= Справочники.НоменклатурныеГруппы.ПолучитьСсылку(Новый УникальныйИдентификатор("0298e138-2a43-11eb-abef-005056bcd3e3"));
	
	Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Ответственный.Подразделение);
	
	// ++ VOG Солодов В.В. 24.03.2021 DEV-260
	СоответствиеНГ = Новый Соответствие;
	СоответствиеНГ.Вставить("КоличествоБереза", 	НГБерезы);
	СоответствиеНГ.Вставить("КоличествоПечоры", 	НГПечоры);
	СоответствиеНГ.Вставить("КоличествоУфа", 		НГУфа);
	СоответствиеНГ.Вставить("КоличествоШахты", 		НГШахты);
	СоответствиеНГ.Вставить("КоличествоКерамин", 	НГКерамин);
	СоответствиеНГ.Вставить("КоличествоИК", 		НГИК);
	
	Для Каждого Строка Из РаспределениеDIY Цикл
		
		Для Каждого КлючИЗначение Из СоответствиеНГ Цикл
			
			НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
			НоваяЗапись.Период 					= Дата;
			НоваяЗапись.Регистратор 			= Ссылка;
			НоваяЗапись.Клиент 					= Строка.Клиент;
			НоваяЗапись.НоменклатурнаяГруппа 	= КлючИЗначение.Значение;
			НоваяЗапись.Подразделение 			= Подразделение;
			НоваяЗапись.КоличествоПлан 			= Строка[КлючИЗначение.Ключ];
			
			НоваяЗапись.СценарийПланирования 	= СценарийПланирования;
			НоваяЗапись.ВерсияСценария 			= ВерсияСценария;
			НоваяЗапись.ПериодПланирования 		= ПериодПланирования;
			
		КонецЦикла;
		
	КонецЦикла;
	// До изменения
	//Для Каждого Строка Из РаспределениеDIY Цикл
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГБерезы;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоБереза;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГПечоры;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоПечоры;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГУфа;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоУфа;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГШахты;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоШахты;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГКерамин;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоКерамин;
	//	
	//	НоваяЗапись = Движения.вогРаспределениеDIYПоНоменклатурнымГруппам.Добавить();
	//	НоваяЗапись.Период = Дата;
	//	НоваяЗапись.Регистратор = Ссылка;
	//	НоваяЗапись.Клиент = Строка.Клиент;
	//	НоваяЗапись.НоменклатурнаяГруппа = НГИК;
	//	НоваяЗапись.Подразделение = Подразделение;
	//	НоваяЗапись.КоличествоПлан = Строка.КоличествоИК;
	//	
	//КонецЦикла;
	// -- VOG Солодов В.В. 24.03.2021 DEV-260
	
КонецПроцедуры

#КонецОбласти