
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;	
	
	Если Параметры.Свойство("Принадлежность") Тогда
		Если ТипЗнч(Параметры.Принадлежность.ИмяТаблиц) = Тип("Строка") Тогда
			СписокИменТаблиц = Новый СписокЗначений;
			СписокИменТаблиц.Добавить(Параметры.Принадлежность.ИмяТаблиц);
			
		Иначе
			СписокИменТаблиц = Параметры.Принадлежность.ИмяТаблиц;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
			"Ссылка.Принадлежность.ИмяТаблицы", 
			СписокИменТаблиц,
			ВидСравненияКомпоновкиДанных.ВСписке
		);
		
	КонецЕсли;
	
	// ++ Харченко Д.И. №  - 06.09.2018 / 
	
	Если Параметры.Свойство("ВидОтображенияИсключить") Тогда
		
		Если ТипЗнч(Параметры.ВидОтображенияИсключить) = Тип("ПеречислениеСсылка.CRM_ВидыОтображенияКлассификаторов") Тогда
			
			СписокВидОтображенияИсключить = Новый СписокЗначений;
			СписокВидОтображенияИсключить.Добавить(Параметры.ВидОтображенияИсключить);
			
		Иначе
			
			СписокВидОтображенияИсключить = Параметры.ВидОтображенияИсключить;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидОтображения", СписокВидОтображенияИсключить, ВидСравненияКомпоновкиДанных.НеВСписке);

	КонецЕсли;
	
	// -- Харченко Д.И. №  - 06.09.2018
КонецПроцедуры

#КонецОбласти
