#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьТекстовыйДокументПравил(ЭлементСсылка) Экспорт
	
	ХранилищеПравил 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСсылка, "ХранилищеПравил", Истина);
	ТекстДляУстановки 	= ХранилищеПравил.Получить();
	
	ТекстовыйДокументПравилОбмена = Новый ТекстовыйДокумент;
	ТекстовыйДокументПравилОбмена.УстановитьТекст(ТекстДляУстановки);
	
	Возврат ТекстовыйДокументПравилОбмена;
	
КонецФункции

#КонецОбласти

#КонецЕсли