#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура создает  элементы справочника по умолчанию.
//
// Параметры:
//	Нет.
//
Процедура СоздатьЭлементыСправочникаПоУмолчанию() Экспорт
	
	// Элемент "День рождения контактного лица".
	Элемент	= Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("День рождения контактного лица", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_ВидыКлючевыхСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= НСтр("ru='День рождения контактного лица'");
		НовыйЭлемент.РеквизитДопУпорядочивания	= 1; 
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "День рождения компании".
	Элемент	= Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("День рождения компании", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_ВидыКлючевыхСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= НСтр("ru='День рождения компании'");
		НовыйЭлемент.РеквизитДопУпорядочивания  = 3;
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "Профессиональный праздник компании".
	Элемент	= Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("Профессиональный праздник компании", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_ВидыКлючевыхСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= НСтр("ru='Профессиональный праздник компании'");
		НовыйЭлемент.РеквизитДопУпорядочивания  = 4;
		НовыйЭлемент.Записать();
	КонецЕсли; 
	// Элемент "Профессиональный праздник контактного лица".
	Элемент	= Справочники.CRM_ВидыКлючевыхСобытий.НайтиПоНаименованию("Профессиональный праздник контактного лица", Истина);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		НовыйЭлемент				= Справочники.CRM_ВидыКлючевыхСобытий.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= НСтр("ru='Профессиональный праздник контактного лица'");
		НовыйЭлемент.РеквизитДопУпорядочивания  = 2;
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры // СоздатьЭлементыСправочникаПоУмолчанию()

#КонецЕсли
