#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") Тогда
		
		Если Параметры.Ключ.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Документ.CRM_ДокументРасчетовСКонтрагентом.Форма.РеализацияТоваровУслуг";
		ИначеЕсли Параметры.Ключ.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПБДСРасчетыСКонтрагентами Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Документ.CRM_ДокументРасчетовСКонтрагентом.Форма.ПБДСРасчетыСКонтрагентами";
		ИначеЕсли Параметры.Ключ.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПКОРасчетыСКонтрагентами Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Документ.CRM_ДокументРасчетовСКонтрагентом.Форма.ПКОРасчетыСКонтрагентами";
		ИначеЕсли Параметры.Ключ.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Документ.CRM_ДокументРасчетовСКонтрагентом.Форма.ВозвратТоваровОтПокупателя";
		ИначеЕсли Параметры.Ключ.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Документ.CRM_ДокументРасчетовСКонтрагентом.Форма.КорректировкаРеализацииТоваров";
		ИначеЕсли Параметры.Ключ.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаДолга Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Документ.CRM_ДокументРасчетовСКонтрагентом.Форма.КорректировкаДолга";
		КонецЕсли;
	Конецесли;
	
КонецПроцедуры

#Область Проведение

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУправленческогоУчета, &ВалютаРегламентированногоУчета, &ВалютаНакладной)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакладнаяЗапасы.Ссылка КАК Документ,
		|	НакладнаяЗапасы.Ссылка.ДокументРеализации КАК ДокументОснование,
		|	НакладнаяЗапасы.Ссылка.Контрагент,
		|	НакладнаяЗапасы.Ссылка.Договор,
		|	НакладнаяЗапасы.Ссылка.ВалютаВзаиморасчетов КАК ВалютаРасчетов,
		|	НакладнаяЗапасы.Ссылка.Дата КАК Период,
		|	НакладнаяЗапасы.Ссылка.Организация,
		|	ВЫБОР КОГДА НакладнаяЗапасы.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя) ТОГДА
		|		НакладнаяЗапасы.Ссылка.ДокументРеализации.Заказ
		|	ИНАЧЕ
		|		НакладнаяЗапасы.Ссылка.Заказ
		|	КОНЕЦ КАК Заказ,
		|	НакладнаяЗапасы.СтавкаНДС,
		|	НакладнаяЗапасы.СуммаНДС,
		|	НакладнаяЗапасы.Сумма
		|ПОМЕСТИТЬ НакладнаяТоварыУслуги
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Товары КАК НакладнаяЗапасы
		|ГДЕ
		|	НакладнаяЗапасы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НакладнаяУслуги.Ссылка,
		|	НакладнаяУслуги.Ссылка.ДокументРеализации,
		|	НакладнаяУслуги.Ссылка.Контрагент,
		|	НакладнаяУслуги.Ссылка.Договор,
		|	НакладнаяУслуги.Ссылка.ВалютаВзаиморасчетов,
		|	НакладнаяУслуги.Ссылка.Дата,
		|	НакладнаяУслуги.Ссылка.Организация,
		|	ВЫБОР КОГДА НакладнаяУслуги.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя) ТОГДА
		|		НакладнаяУслуги.Ссылка.ДокументРеализации.Заказ
		|	ИНАЧЕ
		|		НакладнаяУслуги.Ссылка.Заказ
		|	КОНЕЦ,
		|	НакладнаяУслуги.СтавкаНДС,
		|	НакладнаяУслуги.СуммаНДС,
		|	НакладнаяУслуги.Сумма
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Услуги КАК НакладнаяУслуги
		|ГДЕ
		|	НакладнаяУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакладнаяТоварыУслуги.Документ,
		|	НакладнаяТоварыУслуги.ДокументОснование,
		|	НакладнаяТоварыУслуги.Контрагент,
		|	НакладнаяТоварыУслуги.Договор,
		|	НакладнаяТоварыУслуги.ВалютаРасчетов,
		|	НакладнаяТоварыУслуги.Период,
		|	НакладнаяТоварыУслуги.Организация,
		|	НакладнаяТоварыУслуги.Заказ,
		|	НакладнаяТоварыУслуги.СтавкаНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА НакладнаяТоварыУслуги.Документ.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
		|						ТОГДА НакладнаяТоварыУслуги.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ НакладнаяТоварыУслуги.СуммаНДС * НакладнаяТоварыУслуги.Документ.КурсВзаиморасчетов * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * НакладнаяТоварыУслуги.Документ.КратностьВзаиморасчетов)
		|				КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА НакладнаяТоварыУслуги.Документ.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
		|						ТОГДА НакладнаяТоварыУслуги.СуммаНДС * КурсыРегВалюты.Курс * НакладнаяТоварыУслуги.Документ.КратностьВзаиморасчетов / (НакладнаяТоварыУслуги.Документ.КурсВзаиморасчетов * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ НакладнаяТоварыУслуги.СуммаНДС
		|				КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
		|	ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА НакладнаяТоварыУслуги.Документ.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
		|						ТОГДА НакладнаяТоварыУслуги.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ НакладнаяТоварыУслуги.Сумма * НакладнаяТоварыУслуги.Документ.КурсВзаиморасчетов * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * НакладнаяТоварыУслуги.Документ.КратностьВзаиморасчетов)
		|				КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА НакладнаяТоварыУслуги.Документ.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
		|						ТОГДА НакладнаяТоварыУслуги.Сумма * КурсыРегВалюты.Курс * НакладнаяТоварыУслуги.Документ.КратностьВзаиморасчетов / (НакладнаяТоварыУслуги.Документ.КурсВзаиморасчетов * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ НакладнаяТоварыУслуги.Сумма
		|				КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВал
		|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
		|ИЗ
		|	НакладнаяТоварыУслуги КАК НакладнаяТоварыУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
		|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУправленческогоУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
		|		ПО (КурсыРегВалюты.Валюта = &ВалютаРегламентированногоУчета)";
		Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
			|	ТаблицаДокумента.Ссылка.Дата КАК Период,
			|	&Организация КАК Организация,
			|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
			|	ТаблицаДокумента.Ссылка.Договор КАК Договор,
			|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
			|	ТаблицаДокумента.СчетНаОплату КАК Заказ,
			|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Плитка) КАК НаправлениеДеятельностиПродажи,
			|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
			|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетовКуда,
			|	&Ссылка КАК ДокументКуда,
			|	ТаблицаДокумента.Ссылка.Заказ КАК ДокументОснование,
			|	ТаблицаДокумента.Документ КАК Документ,
			|	ТаблицаДокумента.Документ.Дата КАК ДокументДата,
			|	СУММА(ВЫРАЗИТЬ(ВЫБОР
			|					КОГДА ТаблицаДокумента.Ссылка.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
			|						ТОГДА ТаблицаДокумента.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
			|					ИНАЧЕ ТаблицаДокумента.Сумма * ТаблицаДокумента.Ссылка.КурсВзаиморасчетов * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ТаблицаДокумента.Ссылка.КратностьВзаиморасчетов)
			|				КОНЕЦ КАК ЧИСЛО(15, 2))) КАК Сумма,
			|	СУММА(ВЫРАЗИТЬ(ВЫБОР
			|					КОГДА ТаблицаДокумента.Ссылка.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
			|						ТОГДА ТаблицаДокумента.Сумма * КурсыРегВалюты.Курс * ТаблицаДокумента.Ссылка.КратностьВзаиморасчетов / (ТаблицаДокумента.Ссылка.КурсВзаиморасчетов * КурсыРегВалюты.Кратность)
			|					ИНАЧЕ ТаблицаДокумента.Сумма
			|				КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаВал,
			|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ) КАК ДатаПлатежа
			|ПОМЕСТИТЬ ВременнаяТаблицаПредоплата
			|ИЗ
			|	Документ.CRM_ДокументРасчетовСКонтрагентом.ЗачетАвансов КАК ТаблицаДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
			|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУправленческогоУчета)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
			|		ПО (КурсыРегВалюты.Валюта = &ВалютаРегламентированногоУчета)
			|ГДЕ
			|	ТаблицаДокумента.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаДокумента.Ссылка,
			|	ТаблицаДокумента.Документ,
			|	ТаблицаДокумента.Ссылка.Дата,
			|	ТаблицаДокумента.Ссылка.Контрагент,
			|	ТаблицаДокумента.Ссылка.Договор,
			|	ТаблицаДокумента.СчетНаОплату,
			|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
			|	ТаблицаДокумента.Документ.Дата,
			|	ТаблицаДокумента.Ссылка.Заказ,
			|	НАЧАЛОПЕРИОДА(ТаблицаДокумента.Документ.Дата, ДЕНЬ)
			|;";
		КонецЕсли;
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУправленческогоУчета, &ВалютаРегламентированногоУчета)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакладнаяЗапасы.Ссылка КАК Документ,
		|	НакладнаяЗапасы.Ссылка.ДокументРеализации КАК ДокументОснование,
		|	НакладнаяЗапасы.Ссылка.Контрагент,
		|	НакладнаяЗапасы.Ссылка.Договор,
		|	НакладнаяЗапасы.Ссылка.ВалютаВзаиморасчетов КАК ВалютаРасчетов,
		|	НакладнаяЗапасы.Ссылка.Дата КАК Период,
		|	НакладнаяЗапасы.Ссылка.Организация,
		|	НакладнаяЗапасы.Ссылка.ДокументРеализации.Заказ КАК Заказ,
		|	НакладнаяЗапасы.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА НЕ НакладнаяЗапасы.ЕстьВДокументеПоступленияРеализации
		|			ТОГДА НакладнаяЗапасы.СуммаНДС
		|		ИНАЧЕ НакладнаяЗапасы.СуммаНДС - НакладнаяЗапасы.СуммаНДСДоИзменения
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА НЕ НакладнаяЗапасы.ЕстьВДокументеПоступленияРеализации
		|			ТОГДА НакладнаяЗапасы.Сумма
		|		ИНАЧЕ НакладнаяЗапасы.Сумма - НакладнаяЗапасы.СуммаДоИзменения
		|	КОНЕЦ КАК Сумма,
		|	НакладнаяЗапасы.ЕстьВДокументеПоступленияРеализации КАК ЕстьВДокументеПоступленияРеализации
		|ПОМЕСТИТЬ НакладнаяТоварыУслуги
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Товары КАК НакладнаяЗапасы
		|ГДЕ
		|	НакладнаяЗапасы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НакладнаяУслуги.Ссылка,
		|	НакладнаяУслуги.Ссылка.ДокументРеализации,
		|	НакладнаяУслуги.Ссылка.Контрагент,
		|	НакладнаяУслуги.Ссылка.Договор,
		|	НакладнаяУслуги.Ссылка.ВалютаВзаиморасчетов,
		|	НакладнаяУслуги.Ссылка.Дата,
		|	НакладнаяУслуги.Ссылка.Организация,
		|	НакладнаяУслуги.Ссылка.ДокументРеализации.Заказ,
		|	НакладнаяУслуги.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА НЕ НакладнаяУслуги.ЕстьВДокументеПоступленияРеализации
		|			ТОГДА НакладнаяУслуги.СуммаНДС
		|		ИНАЧЕ НакладнаяУслуги.СуммаНДС - НакладнаяУслуги.СуммаНДСДоИзменения
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ НакладнаяУслуги.ЕстьВДокументеПоступленияРеализации
		|			ТОГДА НакладнаяУслуги.Сумма
		|		ИНАЧЕ НакладнаяУслуги.Сумма - НакладнаяУслуги.СуммаДоИзменения
		|	КОНЕЦ,
		|	НакладнаяУслуги.ЕстьВДокументеПоступленияРеализации
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Услуги КАК НакладнаяУслуги
		|ГДЕ
		|	НакладнаяУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДокументРеализации КАК Документ,
		|	НакладнаяТоварыУслуги.ДокументОснование,
		|	НакладнаяТоварыУслуги.Контрагент,
		|	НакладнаяТоварыУслуги.Договор,
		|	НакладнаяТоварыУслуги.ВалютаРасчетов,
		|	НакладнаяТоварыУслуги.Период,
		|	НакладнаяТоварыУслуги.Организация,
		|	НакладнаяТоварыУслуги.Заказ,
		|	НакладнаяТоварыУслуги.СтавкаНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА НакладнаяТоварыУслуги.Документ.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
		|						ТОГДА НакладнаяТоварыУслуги.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ НакладнаяТоварыУслуги.СуммаНДС * НакладнаяТоварыУслуги.Документ.КурсВзаиморасчетов * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * НакладнаяТоварыУслуги.Документ.КратностьВзаиморасчетов)
		|				КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА НакладнаяТоварыУслуги.Документ.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
		|						ТОГДА НакладнаяТоварыУслуги.СуммаНДС * КурсыРегВалюты.Курс * НакладнаяТоварыУслуги.Документ.КратностьВзаиморасчетов / (НакладнаяТоварыУслуги.Документ.КурсВзаиморасчетов * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ НакладнаяТоварыУслуги.СуммаНДС
		|				КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВал,
		|	ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА НакладнаяТоварыУслуги.Документ.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
		|						ТОГДА НакладнаяТоварыУслуги.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ НакладнаяТоварыУслуги.Сумма * НакладнаяТоварыУслуги.Документ.КурсВзаиморасчетов * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * НакладнаяТоварыУслуги.Документ.КратностьВзаиморасчетов)
		|				КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА НакладнаяТоварыУслуги.Документ.ВалютаВзаиморасчетов = &ВалютаРегламентированногоУчета
		|						ТОГДА НакладнаяТоварыУслуги.Сумма * КурсыРегВалюты.Курс * НакладнаяТоварыУслуги.Документ.КратностьВзаиморасчетов / (НакладнаяТоварыУслуги.Документ.КурсВзаиморасчетов * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ НакладнаяТоварыУслуги.Сумма
		|				КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВал,
		|	НакладнаяТоварыУслуги.ЕстьВДокументеПоступленияРеализации КАК ЕстьВДокументеРеализации
		|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
		|ИЗ
		|	НакладнаяТоварыУслуги КАК НакладнаяТоварыУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты
		|		ПО (КурсыУпрВалюты.Валюта = &ВалютаУправленческогоУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
		|		ПО (КурсыРегВалюты.Валюта = &ВалютаРегламентированногоУчета)";
		
		ДокументРеализации = ПолучитьИсправляемыйДокументРеализации(ДокументСсылкаРасходнаяНакладная, Истина);
		
		Запрос.УстановитьПараметр("ДокументРеализации", ДокументРеализации);
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаДолга Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ТаблицаДокумента.ПризнакАванса,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ПризнакАванса
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	КОНЕЦ  КАК ТипРасчетов,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.Документ = НЕОПРЕДЕЛЕНО
		|			ТОГДА &Ссылка
		|		ИНАЧЕ ТаблицаДокумента.Документ
		|	КОНЕЦ КАК Документ,
		|	ТаблицаДокумента.Ссылка.КонтрагентИсточник КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Ссылка.ВалютаВзаиморасчетов КАК Валюта,
		//|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.СчетНаОплату КАК Заказ,
		|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
		|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаРасчетов,
		|	СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаУчета,
		//|	ВЫБОР
		//|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
		//|			ТОГДА СУММА(ТаблицаДокумента.СуммаРасчетов)
		//|		ИНАЧЕ -СУММА(ТаблицаДокумента.СуммаРасчетов)
		//|	КОНЕЦ,
		|	-СУММА(ТаблицаДокумента.СуммаРасчетов)КАК СуммаРасчетовОстаток,
		//|	ВЫБОР
		//|		КОГДА ТаблицаДокумента.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
		//|			ТОГДА СУММА(ТаблицаДокумента.СуммаУчета)
		//|		ИНАЧЕ -СУММА(ТаблицаДокумента.СуммаУчета)
		//|	КОНЕЦ,
		|	-СУММА(ТаблицаДокумента.СуммаУчета) КАК СуммаУчетаОстаток,
		|	&КорректировкаДолга КАК СодержаниеПроводки
		|ПОМЕСТИТЬ ВременнаяТаблицаПокупатели
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Дебитор КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		//|	И ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ПризнакАванса
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
		|	КОНЕЦ,
		|	ТаблицаДокумента.ПризнакАванса,
		|	ТаблицаДокумента.Документ,
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Договор,
		|	ТаблицаДокумента.СчетНаОплату,
		|	ТаблицаДокумента.Ссылка.КонтрагентИсточник,
		|	ТаблицаДокумента.Ссылка.ВалютаВзаиморасчетов,
		|	ТаблицаДокумента.Ссылка.Дата";
		
		Запрос.УстановитьПараметр("КорректировкаДолга", НСтр("ru = 'Корректировка долга'"));
		
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПКОРасчетыСКонтрагентами
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПБДСРасчетыСКонтрагентами Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУправленческогоУчета, &ВалютаРегламентированногоУчета)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
		|	ТаблицаДокумента.Ссылка.ВалютаВзаиморасчетов КАК ВалютаДенежныхСредств,
		|	ТаблицаДокумента.Заказ КАК Документ,
		//|	ТаблицаДокумента.Ссылка.ВидОперации КАК ВидОперации,
		|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Договор КАК Договор,
		|	ТаблицаДокумента.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СчетНаОплату = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Документ.CRM_СчетНаОплатуПокупателю.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаДокумента.СчетНаОплату
		|	КОНЕЦ КАК Заказ,
		|	ТаблицаДокумента.ПризнакАванса КАК ПризнакАванса,
		|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
		|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.Сумма * КурсыРегВалюты.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыРегВалюты.Кратность) КАК ЧИСЛО(15, 2))) КАК СуммаУчета,
		|	СУММА(ТаблицаДокумента.СуммаВзаиморасчетов) КАК СуммаРасчетов,
		|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаПлатежа
		|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.РасшифровкаПлатежа КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
		|		ПО (КурсыВалютУчета.Валюта = &ВалютаУправленческогоУчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты
		|		ПО (КурсыРегВалюты.Валюта = &ВалютаРегламентированногоУчета)
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка.ВалютаВзаиморасчетов,
		|	ТаблицаДокумента.Заказ,
		|	ТаблицаДокумента.Ссылка.Контрагент,
		|	ТаблицаДокумента.Договор,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.СчетНаОплату = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Документ.CRM_СчетНаОплатуПокупателю.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаДокумента.СчетНаОплату
		|	КОНЕЦ,
		|	ТаблицаДокумента.ПризнакАванса,
		|	ТаблицаДокумента.Ссылка.Дата,
		|	ТаблицаДокумента.Договор.ВалютаРасчетов";
		
	КонецЕсли;
		
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНакладной", ДокументСсылкаРасходнаяНакладная.ВалютаВзаиморасчетов);
	
	Запрос.ВыполнитьПакет();
	
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
		СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ДокументРеализации", ДокументРеализации);
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
		Запрос.УстановитьПараметр("СодержаниеПроводки", НСтр("ru='Возникновение обязательств покупателя'"));
		Запрос.УстановитьПараметр("ЗачетАванса", НСтр("ru='Зачет предоплаты'"));
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
		Запрос.УстановитьПараметр("СодержаниеПроводки", НСтр("ru='Сторнирование долга'"));
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПКОРасчетыСКонтрагентами
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПБДСРасчетыСКонтрагентами Тогда
		Запрос.УстановитьПараметр("ВозникновениеАвансаПокупателя", "Возникновение аванса покупателя");
		Запрос.УстановитьПараметр("ПогашениеОбязательствПокупателя", "Погашение обязательств покупателя");
	КонецЕсли;
	
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг 
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
		
	// Формирование временной таблицы по расчетам с покупателями.
	ТекстЗапроса = "
	|ВЫБРАТЬ";
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
	ТекстЗапроса =ТекстЗапроса + "
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,";
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
	ТекстЗапроса =ТекстЗапроса + "
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,";
	КонецЕсли;
	ТекстЗапроса =ТекстЗапроса + "
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Договор КАК Договор,";
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
	ТекстЗапроса =ТекстЗапроса + "
	|	ТаблицаДокумента.Документ КАК Документ,";
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
	ТекстЗапроса =ТекстЗапроса + "
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ДокументОснование = ЗНАЧЕНИЕ(Документ.CRM_ДокументРасчетовСКонтрагентом.ПустаяСсылка)
	|				ИЛИ ТаблицаДокумента.ДокументОснование = ЗНАЧЕНИЕ(Документ.CRM_СчетНаОплатуПокупателю.ПустаяСсылка)
	|				ИЛИ ТаблицаДокумента.ДокументОснование = НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ ТаблицаДокумента.ДокументОснование
	|	КОНЕЦ КАК Документ,";
	КонецЕсли;
	ТекстЗапроса =ТекстЗапроса + "
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,";
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
	ТекстЗапроса =ТекстЗапроса + "
	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,";
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
	ТекстЗапроса =ТекстЗапроса + "
	|	-СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	-СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	-СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	-СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,";
	КонецЕсли;
	ТекстЗапроса =ТекстЗапроса + "
	|	ВЫРАЗИТЬ(&СодержаниеПроводки КАК СТРОКА(100)) КАК СодержаниеПроводки
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,";
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
	ТекстЗапроса =ТекстЗапроса + "
	|	ТаблицаДокумента.Документ,";
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
	ТекстЗапроса =ТекстЗапроса + "
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ДокументОснование = ЗНАЧЕНИЕ(Документ.CRM_ДокументРасчетовСКонтрагентом.ПустаяСсылка)
	|				ИЛИ ТаблицаДокумента.ДокументОснование = ЗНАЧЕНИЕ(Документ.CRM_СчетНаОплатуПокупателю.ПустаяСсылка)
	|				ИЛИ ТаблицаДокумента.ДокументОснование = НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ ТаблицаДокумента.ДокументОснование
	|	КОНЕЦ,";
	КонецЕсли;
	ТекстЗапроса =ТекстЗапроса + "
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)";
	
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг Тогда
	ТекстЗапроса =ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетов,
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.ДокументКуда,
	|	ТаблицаДокумента.ДокументКуда.Заказ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	-СУММА(ТаблицаДокумента.Сумма),
	|	-СУММА(ТаблицаДокумента.СуммаВал),
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100))
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	//|ГДЕ
	//|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.ДокументКуда,
	|	ТаблицаДокумента.ДокументКуда.Заказ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда";
	КонецЕсли;
	
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаДолга Тогда
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки КАК СодержаниеПроводки,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ТаблицаДокумента.ТипРасчетов КАК ТипРасчетов,
	|	ТаблицаДокумента.Дата КАК Период,
	|	СУММА(ТаблицаДокумента.СуммаУчета) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.СуммаУчетаОстаток) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаРасчетовОстаток) КАК СуммаВалДляОстатка
	//|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаПокупатели КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.СодержаниеПроводки,
	|	ТаблицаДокумента.ВидДвижения,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор,
	|	ТаблицаДокумента.Валюта,
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Заказ";
	
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПКОРасчетыСКонтрагентами
	ИЛИ ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПБДСРасчетыСКонтрагентами Тогда
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|	КОНЕЦ КАК Документ,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор КАК Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ КАК ТипРасчетов,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа) КАК СуммаПлатежа,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК Сумма,
	|	СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВал,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаУчета) КАК СуммаДляОстатка,
	|	-СУММА(ВременнаяТаблицаРасшифровкаПлатежа.СуммаРасчетов) КАК СуммаВалДляОстатка,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов КАК Валюта,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПокупателя
	|		ИНАЧЕ &ПогашениеОбязательствПокупателя
	|	КОНЕЦ КАК СодержаниеПроводки
	//|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаРасшифровкаПлатежа.НомерСтроки,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Договор,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Дата,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаРасчетов,
	|	ВременнаяТаблицаРасшифровкаПлатежа.ВалютаДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &Ссылка
	|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.Документ
	|	КОНЕЦ,
	|	ВременнаяТаблицаРасшифровкаПлатежа.Заказ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.ПризнакАванса
	|			ТОГДА &ВозникновениеАвансаПокупателя
	|		ИНАЧЕ &ПогашениеОбязательствПокупателя
	|	КОНЕЦ";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТипРасчетов", "ТипРасчетов");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Документ", "Документ");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");
	Блокировка.Заблокировать();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицаПродажи(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Если ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг или ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.АктВыполненныхРабот Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Номенклатура,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Заказ.Подразделение КАК Подразделение,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Заказ.Ответственный КАК Менеджер,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Организация,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Контрагент КАК Партнер,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Договор КАК ДоговорКонтрагента,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Заказ КАК ДокументПродажи,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Количество,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Сумма КАК Стоимость,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Сумма КАК СтоимостьБезСкидок,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.СуммаНДС КАК НДС,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка КАК Документ
		|ПОМЕСТИТЬ НакладнаяТоварыУслуги
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Товары КАК CRM_ДокументРасчетовСКонтрагентомТовары
		|ГДЕ
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Номенклатура,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Заказ.Подразделение,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Заказ.Ответственный,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Организация,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Контрагент,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Договор,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Заказ,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Количество,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Сумма,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Сумма,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.СуммаНДС,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Услуги КАК CRM_ДокументРасчетовСКонтрагентомУслуги
		|ГДЕ
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакладнаяТоварыУслуги.Номенклатура,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	НакладнаяТоварыУслуги.Подразделение,
		|	НакладнаяТоварыУслуги.Менеджер,
		|	НакладнаяТоварыУслуги.Организация,
		|	НакладнаяТоварыУслуги.Партнер,
		|	НакладнаяТоварыУслуги.ДоговорКонтрагента,
		|	НакладнаяТоварыУслуги.ДокументПродажи,
		|	СУММА(НакладнаяТоварыУслуги.Количество) КАК Количество,
		|	СУММА(НакладнаяТоварыУслуги.Стоимость) КАК Стоимость,
		|	СУММА(НакладнаяТоварыУслуги.СтоимостьБезСкидок) КАК СтоимостьБезСкидок,
		|	СУММА(НакладнаяТоварыУслуги.НДС) КАК НДС,
		|	НакладнаяТоварыУслуги.Документ.Дата КАК Период
		|ИЗ
		|	НакладнаяТоварыУслуги КАК НакладнаяТоварыУслуги
		|
		|СГРУППИРОВАТЬ ПО
		|	НакладнаяТоварыУслуги.Номенклатура,
		|	НакладнаяТоварыУслуги.Подразделение,
		|	НакладнаяТоварыУслуги.Менеджер,
		|	НакладнаяТоварыУслуги.Организация,
		|	НакладнаяТоварыУслуги.Партнер,
		|	НакладнаяТоварыУслуги.ДоговорКонтрагента,
		|	НакладнаяТоварыУслуги.ДокументПродажи,
		|	НакладнаяТоварыУслуги.Документ.Дата";
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Номенклатура,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Заказ.Подразделение КАК Подразделение,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Заказ.Ответственный КАК Менеджер,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Организация,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Контрагент КАК Партнер,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Договор КАК ДоговорКонтрагента,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Заказ КАК ДокументПродажи,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Количество,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Сумма КАК Стоимость,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Сумма КАК СтоимостьБезСкидок,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.СуммаНДС КАК НДС,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка КАК Документ
		|ПОМЕСТИТЬ НакладнаяТоварыУслуги
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Товары КАК CRM_ДокументРасчетовСКонтрагентомТовары
		|ГДЕ
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Номенклатура,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Заказ.Подразделение,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Заказ.Ответственный,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Организация,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Контрагент,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Договор,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Заказ,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Количество,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Сумма,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Сумма,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.СуммаНДС,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Услуги КАК CRM_ДокументРасчетовСКонтрагентомУслуги
		|ГДЕ
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакладнаяТоварыУслуги.Номенклатура,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	НакладнаяТоварыУслуги.Подразделение,
		|	НакладнаяТоварыУслуги.Менеджер,
		|	НакладнаяТоварыУслуги.Организация,
		|	НакладнаяТоварыУслуги.Партнер,
		|	НакладнаяТоварыУслуги.ДоговорКонтрагента,
		|	НакладнаяТоварыУслуги.ДокументПродажи,
		|	СУММА(-НакладнаяТоварыУслуги.Количество) КАК Количество,
		|	СУММА(-НакладнаяТоварыУслуги.Стоимость) КАК Стоимость,
		|	СУММА(-НакладнаяТоварыУслуги.СтоимостьБезСкидок) КАК СтоимостьБезСкидок,
		|	СУММА(-НакладнаяТоварыУслуги.НДС) КАК НДС,
		|	НакладнаяТоварыУслуги.Документ.Дата КАК Период
		|ИЗ
		|	НакладнаяТоварыУслуги КАК НакладнаяТоварыУслуги
		|
		|СГРУППИРОВАТЬ ПО
		|	НакладнаяТоварыУслуги.Номенклатура,
		|	НакладнаяТоварыУслуги.Подразделение,
		|	НакладнаяТоварыУслуги.Менеджер,
		|	НакладнаяТоварыУслуги.Организация,
		|	НакладнаяТоварыУслуги.Партнер,
		|	НакладнаяТоварыУслуги.ДоговорКонтрагента,
		|	НакладнаяТоварыУслуги.ДокументПродажи,
		|	НакладнаяТоварыУслуги.Документ.Дата";	
	ИначеЕсли ДокументСсылкаРасходнаяНакладная.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Номенклатура,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Заказ.Подразделение КАК Подразделение,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Заказ.Ответственный КАК Менеджер,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Организация,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Контрагент КАК Партнер,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Договор КАК ДоговорКонтрагента,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка.Заказ КАК ДокументПродажи,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Количество - CRM_ДокументРасчетовСКонтрагентомТовары.КоличествоДоКорректировки КАК Поле1,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Сумма - CRM_ДокументРасчетовСКонтрагентомТовары.СуммаДоКорректировки КАК Стоимость,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Сумма - CRM_ДокументРасчетовСКонтрагентомТовары.СуммаДоКорректировки КАК СтоимостьБезСкидок,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.СуммаНДС - CRM_ДокументРасчетовСКонтрагентомТовары.СуммаНДСДоКорректировки КАК НДС,
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка КАК Документ
		|ПОМЕСТИТЬ НакладнаяТоварыУслуги
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Товары КАК CRM_ДокументРасчетовСКонтрагентомТовары
		|ГДЕ
		|	CRM_ДокументРасчетовСКонтрагентомТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Номенклатура,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Заказ.Подразделение,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Заказ.Ответственный,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Организация,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Контрагент,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Договор,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка.Заказ,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Количество - CRM_ДокументРасчетовСКонтрагентомУслуги.КоличествоДоКорректировки,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Сумма - CRM_ДокументРасчетовСКонтрагентомУслуги.СуммаДоКорректировки,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Сумма - CRM_ДокументРасчетовСКонтрагентомУслуги.СуммаДоКорректировки,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.СуммаНДС - CRM_ДокументРасчетовСКонтрагентомУслуги.СуммаНДСДоКорректировки,
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка
		|ИЗ
		|	Документ.CRM_ДокументРасчетовСКонтрагентом.Услуги КАК CRM_ДокументРасчетовСКонтрагентомУслуги
		|ГДЕ
		|	CRM_ДокументРасчетовСКонтрагентомУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакладнаяТоварыУслуги.Номенклатура,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	НакладнаяТоварыУслуги.Подразделение,
		|	НакладнаяТоварыУслуги.Менеджер,
		|	НакладнаяТоварыУслуги.Организация,
		|	НакладнаяТоварыУслуги.Партнер,
		|	НакладнаяТоварыУслуги.ДоговорКонтрагента,
		|	НакладнаяТоварыУслуги.ДокументПродажи,
		|	СУММА(НакладнаяТоварыУслуги.Стоимость) КАК Стоимость,
		|	СУММА(НакладнаяТоварыУслуги.СтоимостьБезСкидок) КАК СтоимостьБезСкидок,
		|	СУММА(НакладнаяТоварыУслуги.НДС) КАК НДС,
		|	НакладнаяТоварыУслуги.Документ.Дата КАК Период
		|ИЗ
		|	НакладнаяТоварыУслуги КАК НакладнаяТоварыУслуги
		|
		|СГРУППИРОВАТЬ ПО
		|	НакладнаяТоварыУслуги.Номенклатура,
		|	НакладнаяТоварыУслуги.Подразделение,
		|	НакладнаяТоварыУслуги.Менеджер,
		|	НакладнаяТоварыУслуги.Организация,
		|	НакладнаяТоварыУслуги.Партнер,
		|	НакладнаяТоварыУслуги.ДоговорКонтрагента,
		|	НакладнаяТоварыУслуги.ДокументПродажи,
		|	НакладнаяТоварыУслуги.Документ.Дата";		
	КонецЕсли;
	Если ТекстЗапроса <> Неопределено Тогда
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРасходнаяНакладная.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", Новый ТаблицаЗначений);	
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти


#Область ИнициализацияДаных

// Функция находит и возвращает документ, являющийся отправной точкой исправлений (либо РТУ либо корректировку РТУ)
// либо первоначальный документ РТУ при передаче истины в параметр Исходный
Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации, Исходный = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ДокРеализации) 
		И ДокРеализации.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров
		//И (ДокРеализации.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки ИЛИ Исходный)
		И Исходный
		И ДокРеализации.ДокументРеализации <> ДокРеализации Тогда
		
		Возврат ПолучитьИсправляемыйДокументРеализации(ДокРеализации.ДокументРеализации, Исходный);
		
	Иначе
		Возврат ДокРеализации;
	КонецЕсли;
	
КонецФункции	

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства) Экспорт
	
		
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаПродажи(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()



Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Если Данные.Ссылка.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ВозвратТоваровОтПокупателя Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Строка(Данные.Ссылка.ВидДокумента) + " " + Данные.Номер + " от " + Формат(Данные.Дата,"ДЛФ=DT");
		ИначеЕсли Данные.Ссылка.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаДолга Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Строка(Данные.Ссылка.ВидДокумента) + " " + Данные.Номер + " от " + Формат(Данные.Дата,"ДЛФ=DT");
		ИначеЕсли Данные.Ссылка.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.КорректировкаРеализацииТоваров Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Строка(Данные.Ссылка.ВидДокумента) + " " + Данные.Номер + " от " + Формат(Данные.Дата,"ДЛФ=DT");
		ИначеЕсли Данные.Ссылка.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПБДСРасчетыСКонтрагентами Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Строка(Данные.Ссылка.ВидДокумента) + " " + Данные.Номер + " от " + Формат(Данные.Дата,"ДЛФ=DT");
		ИначеЕсли Данные.Ссылка.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.ПКОРасчетыСКонтрагентами Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Строка(Данные.Ссылка.ВидДокумента) + " " + Данные.Номер + " от " + Формат(Данные.Дата,"ДЛФ=DT");
		ИначеЕсли Данные.Ссылка.ВидДокумента = Перечисления.CRM_ВидДокументаРасчетов.РеализацияТоваровИУслуг Тогда
			СтандартнаяОбработка = Ложь;
			Представление = Строка(Данные.Ссылка.ВидДокумента) + " " + Данные.Номер + " от " + Формат(Данные.Дата,"ДЛФ=DT");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли