
#Область ПрограммныйИнтерфейс

Функция СписокВариантовОтложенногоВремени() Экспорт

	СписокВариантов = Новый СписокЗначений;
	
	СписокВариантов.Добавить(300   , НСтр("ru = '5 минут'"));
	СписокВариантов.Добавить(600   , НСтр("ru = '10 минут'"));
	СписокВариантов.Добавить(900   , НСтр("ru = '15 минут'"));
	СписокВариантов.Добавить(1800  , НСтр("ru = '30 минут'"));
	СписокВариантов.Добавить(3600  , НСтр("ru = '1 час'"));
	СписокВариантов.Добавить(7200  , НСтр("ru = '2 часа'"));
	СписокВариантов.Добавить(14400 , НСтр("ru = '4 часа'"));
	СписокВариантов.Добавить(28800 , НСтр("ru = '8 часов'"));
	СписокВариантов.Добавить(86400 , НСтр("ru = '1 день'"));
	СписокВариантов.Добавить(172800, НСтр("ru = '2 дня'"));
	СписокВариантов.Добавить(259200, НСтр("ru = '3 дня'"));
	СписокВариантов.Добавить(345600, НСтр("ru = '4 дня'"));
	СписокВариантов.Добавить(604800, НСтр("ru = '1 неделя'"));
	
	Возврат СписокВариантов;
	
КонецФункции // СписокВариантовОтложенногоВремени()

#КонецОбласти