
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	Направление=вогОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущийПользователь,"CRM_НаправлениеДеятельности");
	Если ЗначениеЗаполнено(Направление) тогда
		
		УжеЕстьЭлементОтбора = Ложь;	
		Для каждого Элемент из Список.Отбор.Элементы цикл
			Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НаправлениеДеятельности") тогда
				УжеЕстьЭлементОтбора = Истина;	
			КонецЕсли;
		КонецЦикла;
		Если Не УжеЕстьЭлементОтбора тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НаправлениеДеятельности");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Направление;
		КонецЕсли;
	КонецЕсли;
	

КонецПроцедуры
