#Область СлужебныйПрограммныйИнтерфейс

Функция МенеджерыЛогическихХранилищ() Экспорт
	
	ВсеМенеджерыЛогическихХранилищ = Новый Соответствие;
	
	ПередачаДанныхПереопределяемый.МенеджерыЛогическихХранилищ(ВсеМенеджерыЛогическихХранилищ);
	
	Возврат ВсеМенеджерыЛогическихХранилищ;
	
КонецФункции

Функция МенеджерыФизическихХранилищ() Экспорт
	
	ВсеМенеджерыФизическихХранилищ = Новый Соответствие;
	
	ПередачаДанныхПереопределяемый.МенеджерыФизическихХранилищ(ВсеМенеджерыФизическихХранилищ);
	
	Возврат ВсеМенеджерыФизическихХранилищ;
	
КонецФункции

#КонецОбласти