
// По умолчанию отправляем письма рассылок по SMTP
Процедура УстановитьСпособОтправкиРассылокПоУмолчанию() Экспорт
	Если НЕ ЗначениеЗаполнено(Константы.CRM_СпособОтправкиРассылок.Получить()) Тогда
		Константы.CRM_СпособОтправкиРассылок.Установить(Перечисления.CRM_СпособыОтправкиРассылок.SMTP);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.CRM_СпособОтправкиОповещенийПоЭлектроннойПочте.Получить()) Тогда
		Константы.CRM_СпособОтправкиОповещенийПоЭлектроннойПочте.Установить(Перечисления.CRM_СпособыОтправкиРассылок.SMTP);
	КонецЕсли;
КонецПроцедуры