
// +++ VOG Кулаков П.Л. 11.03.2021 DEV-260
&НаКлиенте
Процедура ГодовоеПланирование(Команда)
	
	// ++ VOG Солодов В.В. 24.03.2021 DEV-260
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить(
		"СценарийПланирования", ПредопределенноеЗначение("Справочник.вогСценарииПланирования.ПланНаГод"));
	// До изменения
	//ПараметрыФормы = Новый Структура("ПериодПланирования", "Год");
	// -- VOG Солодов В.В. 24.03.2021 DEV-260
	ОткрытьФорму("Документ.вогРаспределениеDIYПоНоменклатурнымГруппам.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры // --- VOG Кулаков П.Л.

// +++ VOG Кулаков П.Л. 11.03.2021 DEV-260
&НаКлиенте
Процедура КвартальноеПланирование(Команда)
	
	// ++ VOG Солодов В.В. 24.03.2021 DEV-260
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить(
		"СценарийПланирования", ПредопределенноеЗначение("Справочник.вогСценарииПланирования.ПланНаКвартал"));
	// До изменения
	//ПараметрыФормы = Новый Структура("ПериодПланирования", "Квартал");
	// -- VOG Солодов В.В. 24.03.2021 DEV-260
	ОткрытьФорму("Документ.вогРаспределениеDIYПоНоменклатурнымГруппам.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры // --- VOG Кулаков П.Л.
