
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	// ++ VOG Солодов В.В. 11.08.2021 DEV-476
	ПараметрыОтбораСтрок = Новый Структура;
	ПараметрыОтбораСтрок.Вставить("КоллекцияПроизводителя", Справочники.КоллекцииНоменклатурыПроизводителей.ПустаяСсылка());
	
	НайденныеСтроки = Коллекции.НайтиСтроки(ПараметрыОтбораСтрок);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		ИндексСтроки = Коллекции.Индекс(НайденнаяСтрока);
		Коллекции.Удалить(ИндексСтроки);
		
	КонецЦикла;
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	// -- VOG Солодов В.В. 11.08.2021 DEV-476
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли