
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиКомпоновки = КомпоновщикНастроек.Настройки;
	
	СтатусТТКлассификатор = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("dcdbe20f-9a73-11e8-89fa-005056bc3fe8"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "СтатусТТКлассификатор", СтатусТТКлассификатор);
	
	СтатусЗакрыта = Справочники.CRM_ЗначенияКлассификаторов.ПолучитьСсылку(Новый УникальныйИдентификатор("005e9af3-9a74-11e8-89fa-005056bc3fe8"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "Закрыт", СтатусЗакрыта);
	
	КлассификацияТТКлассификатор = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("b3d84c6b-7581-11ea-87ff-005056bc3fe8"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, "КлассификацияТТ", КлассификацияТТКлассификатор);
	
	
КонецПроцедуры
