
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ПараметрыФормы = Новый Структура("Отбор,КлючВарианта, СформироватьПриОткрытии",Новый Структура("Клиент", ПараметрКоманды),"Ведомость", Истина);
		ОткрытьФорму("Отчет.CRM_ВедомостьВзаиморасчетыСКлиентами.Форма", ПараметрыФормы,,,ПараметрыВыполненияКоманды.Окно);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Клиент не связан с Партнером базы CRM!'")); 
	КонецЕсли;
	
КонецПроцедуры
